{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt4590930/", "name": "The Gamechangers", "image": "https://m.media-amazon.com/images/M/MV5BMTg5NDg5NjAxNV5BMl5BanBnXkFtZTgwNDM0MTg5NjE@._V1_.jpg", "genre": ["Biography", "Drama"], "actor": [{"@type": "Person", "url": "/name/nm0705356/", "name": "Daniel Radcliffe"}, {"@type": "Person", "url": "/name/nm0000200/", "name": "Bill Paxton"}, {"@type": "Person", "url": "/name/nm1478079/", "name": "Joe Dempsie"}, {"@type": "Person", "url": "/name/nm2187587/", "name": "Ryan Gage"}], "director": {"@type": "Person", "url": "/name/nm2787176/", "name": "Owen Harris"}, "creator": [{"@type": "Person", "url": "/name/nm1198822/", "name": "James Wood"}, {"@type": "Organization", "url": "/company/co0486601/"}], "description": "The Gamechangers is a TV movie starring Daniel Radcliffe, Bill Paxton, and Joe Dempsie. The struggle of Houser's legal feud against American lawyer Jack Thompson, over the morality of the Grand Theft Auto video game series.", "datePublished": "2015-09-15", "keywords": "docudrama", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 2236, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4590930/"}, "author": {"@type": "Person", "name": "Deadiron29"}, "dateCreated": "2015-09-18", "inLanguage": "English", "name": "An entertaining take on one of the biggest controvercies regarding video-games", "reviewBody": "The debate about the effects of violent video-games on people had existed long before GTA (when Mortal Kombat was released it was the first time I personally heard about it) but, with GTA something changed that made the debate much more heated and aggressive. Conservatives all over the world were open arms about how these evil games were turning the children into potential killing machines. Jack Thompson although not the only one, was the more well known among these people.\n\nThe movie starts one day after the release of Vice City and spans across all the creative process and release of San Andreas. Within set time frames two plot lines are follow, the legal battle between Thompson and Rockstar, and the development of San Andreas. These plot lines flow nicely and never feel too slow-paced.\n\nI was surprised at how balanced the film was, it does not takes any sides and does not portray Thompson as just an asshole, it shows a man who believes he is doing the right thing (whether or not is truly the right thing is for us to decide) And although this story does have objectively a winner at the end, the effort of presenting the event fairly and not in a one sided manner is something to applaud for.\n\nDaniel Radcliffe is good as Houser. I cannot say it is a remarkable performance. The same goes for Paxton's character although he projects a lot more energy into the role but, that has to do more with the way the character is written than anything else the supporting cast does the job but, there is no one particularly memorable.\n\nThe influence of The Social Network in this movie cannot be denied and its one of the reason some people have criticized this film strongly, stating that is just a carbon copy of it is not. The influences are present in the tone of the movie but, saying it is a carbon copy of David Fincher's film is more than a stretch.\n\nAll things considered, The Gamechangers is an entertaining TV movie about a controversial subject which remains still. I doubt it will be a classic by any means but, it does the job of telling the story in a fun an effective manner.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H30M", "EntryURL": "https://www.imdb.com/title/tt4590930", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Gamechangers", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Gamechangers/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Gamechangers/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Gamechangers/thumb.jpg", "EntryAdded": "2016-03-21"}