{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt4044364/", "name": "Citizenfour", "image": "https://m.media-amazon.com/images/M/MV5BMTc0MTM0MTA5MF5BMl5BanBnXkFtZTgwNzEwODEwMzE@._V1_.jpg", "genre": ["Documentary", "Biography", "News", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm5722984/", "name": "Edward Snowden"}, {"@type": "Person", "url": "/name/nm3390925/", "name": "Glenn Greenwald"}, {"@type": "Person", "url": "/name/nm5015568/", "name": "William Binney"}, {"@type": "Person", "url": "/name/nm3335834/", "name": "Jacob Appelbaum"}], "director": {"@type": "Person", "url": "/name/nm0688636/", "name": "Laura Poitras"}, "description": "Citizenfour is a movie starring Edward Snowden, Glenn Greenwald, and William Binney. A documentarian and a reporter travel to Hong Kong for the first of many meetings with Edward Snowden.", "datePublished": "2014-11-06", "creator": [{"@type": "Organization", "url": "/company/co0245372/"}, {"@type": "Organization", "url": "/company/co0132772/"}, {"@type": "Organization", "url": "/company/co0139821/"}], "keywords": "mass surveillance,corrupt government,government surveillance,nsa,edward snowden", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 50740, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4044364/"}, "author": {"@type": "Person", "name": "mlwehle"}, "dateCreated": "2014-10-27", "inLanguage": "English", "name": "Solid, Powerful", "reviewBody": "I thought Citizenfour was quite powerful as a humanizing portrayal of Snowden. I didn't learn anything new particularly about NSA programs, since I've been reading each story I come across, but the film quite effectively transported me into Snowden's hotel room in Hong Kong and into conversations with Snowden, Greenwald, Poitras and MacAskill. Snowden comes off as a completely responsible, quite sincere, thoughtful young man. He very clearly and explicitly says that he does not want to be the story, and one believes him. Whereas Assange can impress people as narcissistic and Bradley/Chelsea Manning's sexual confusion was only one of a number of facets which distracted from Cablegate, Snowden sounds like a young Ellsberg – very intelligent and well-spoken.\n\nPoitras's style was interesting, I thought. The camera a number of times holds for lengthy periods on fairly static shots of architecture, which served to impress the viewer with the monolithic, pervasive nature of the NSA's networks. There's a long disorienting shot out the window of a train at night or going through a tunnel, which draws you into the dark network Snowden's revealing.\n\nThe film successfully touches on a number of different aspects of the surveillance state, bringing in the idea that when we talk about \"privacy\" we're talking about security, about our constitutional right to freedom from unlawful search and seizure. I think this is a hard sell for too many viewers. I don't fault the film here. I saw it with a friend who was a few minutes late because she was watching the Giants' game. In discussing the movie afterward she questioned just how important some of the issues raised were. Greenwald and others speak passionately about the dangers of the surveillance state, but my date pointed out that she can't feel much fear that the NSA is going to be breaking down her door because of anything she's said on the phone or in e-mail. My own experience is that friends and colleagues on the one hand self-censor and don't mention politics, drugs, Bittorrent use, etc. in e-mail or social media for fear of the all-knowing eye, or on the other hand seem oblivious to any danger – why worry about Google programmatically reading every single e-mail sent or received, if it means free e-mail and potentially more accurate search results when shopping? Snowden at one point convincingly says he doesn't think it is possible for anyone no matter how brilliant and educated to individually fight all the electronic surveillance systems in existence. We're told of the multitude of methods of surveillance and repeatedly shown NSA officials blatantly lying to Congress about their existence. The lack of accountability for this last has been personally troubling to me – I remember Watergate and Iran-Contra – how is it that the heads of the NSA can with impunity flat out lie to Congress about spying on American citizens? What will viewers come away with when walking out of the theater after Citizenfour? I'm wondering how many will see it as a call to action, and how many as a well-executed depiction of Edward Snowden's experience, which may not be seen as intersecting our own.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H54M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi2548870937", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTY3NzU1MTY2MV5BMl5BanBnXkFtZTgwNTg1MzU5MjE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTY3NzU1MTY2MV5BMl5BanBnXkFtZTgwNTg1MzU5MjE@._V1_.jpg", "description": "A documentarian and a reporter travel to Hong Kong for the first of many meetings with Edward Snowden.", "uploadDate": "2014-10-12T14:33:20Z"}, "EntryURL": "https://www.imdb.com/title/tt4044364", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Citizenfour", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Citizenfour/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Citizenfour/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Citizenfour/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Citizenfour/thumb.jpg", "EntryAdded": "2015-08-24"}