{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt4044364/", "name": "Citizenfour", "image": "https://m.media-amazon.com/images/M/MV5BMTc0MTM0MTA5MF5BMl5BanBnXkFtZTgwNzEwODEwMzE@._V1_.jpg", "genre": ["Documentary", "Biography", "News", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm5722984/", "name": "Edward Snowden"}, {"@type": "Person", "url": "/name/nm3390925/", "name": "Glenn Greenwald"}, {"@type": "Person", "url": "/name/nm5015568/", "name": "William Binney"}, {"@type": "Person", "url": "/name/nm3335834/", "name": "Jacob Appelbaum"}], "director": {"@type": "Person", "url": "/name/nm0688636/", "name": "Laura Poitras"}, "description": "Citizenfour is a movie starring Edward Snowden, Glenn Greenwald, and William Binney. A documentarian and a reporter travel to Hong Kong for the first of many meetings with Edward Snowden.", "datePublished": "2014-11-06", "creator": [{"@type": "Organization", "url": "/company/co0245372/"}, {"@type": "Organization", "url": "/company/co0132772/"}, {"@type": "Organization", "url": "/company/co0139821/"}], "keywords": "mass surveillance,corrupt government,government surveillance,nsa,edward snowden", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 50740, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4044364/"}, "author": {"@type": "Person", "name": "ferguson-6"}, "dateCreated": "2014-11-20", "inLanguage": "English", "name": "Walk a Mile in his Shoes", "reviewBody": "Greetings again from the darkness. Edward Snowden. You know the name and you know the story. Hero of the People or Enemy of the State? Ultimate Patriot or a double-spy for the Russians? Protected as a Whistle-Blower or Guilty of Treason? Chances are you long ago made up your mind on how you view Ed (his stated name preference). \n\nIn January 2013, Snowden contacted documentarian Laura Poitras via an anonymous email name \"Citizenfour\". By June, the two were meeting in a Hong Kong hotel along with journalist Glenn Greenwald. What follows is a mesmerizing look at the actual footage shot of Greenwald interviewing Snowden. This is Ed Snowden before the media storm. This is Ed Snowden continually proclaiming that he is not the story, and he is trusting Greenwald to determine what documents are fit for public release. He voices concern about jeopardizing national security, while at the same time being adamant about exposing the immense and widespread governmental tracking of digital movements by millions of people \u0085 most with no known ties to terrorism.\n\nThe timeline is public record, so the core of the film is really an intimate look at the man who, acutely aware of the coming fallout, proceeded with pulling the curtain back on NSA actions that he deemed inappropriate. Ms. Poitras structures the film as a thriller, and it will certainly cause tension in every viewer. We can't help but put ourselves in Snowden's shoes. Would we feel the need to go public with proof? Who would we tell? How would we tell them? Would we be willing to release our name, knowing it could put everyone we love in danger? Would we be prepared to watch our President publicly call us out as unpatriotic and a danger to the nation? These questions are impossible for us to answer, but add weight to the scenes of Snowden answering Greenwald's questions while Ms. Poitras works the camera.\n\nOne of the more interesting points made in the movie is that what we once termed individual freedom and liberties, is now couched as privacy. We have come to expect our privacy, and certainly don't appreciate our government digging through our emails, search history, texts and phone calls. But how to balance the individual \"right\" to privacy with the government's need to collect intelligence in the name of national security? That's the key question, and one with no clear answer.\n\nRegardless of your opinion on Snowden and his actions, the film presents him as an idealist believing he is doing the right thing. Most of this occurs before the media firestorm, but we do see the anticipated fallout. Once Snowden goes into hiding, we witness Greenwald becoming the face and voice of the cause. He is a talented journalist and exceptional speaker, and doesn't back down from the reaction of those who stand accused. \n\nThe film allows us to take notice of the personal attacks on Snowden as an attempt discredit his documentation. Making Snowden the story distracted the media and the general public from the real issue. It's a fascinating film that will surely make you uncomfortable and cause re-evaluation of the chain of events. You may not change your mind, but you will most certainly have a better understanding of the human side.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H54M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi2548870937", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTY3NzU1MTY2MV5BMl5BanBnXkFtZTgwNTg1MzU5MjE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTY3NzU1MTY2MV5BMl5BanBnXkFtZTgwNTg1MzU5MjE@._V1_.jpg", "description": "A documentarian and a reporter travel to Hong Kong for the first of many meetings with Edward Snowden.", "uploadDate": "2014-10-12T14:33:20Z"}, "EntryURL": "https://www.imdb.com/title/tt4044364", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Citizenfour", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Citizenfour/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Citizenfour/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Citizenfour/thumb.jpg", "EntryAdded": "2015-08-24"}