{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Doomsday", "EntryURL": "https://www.imdb.com/title/tt0483607", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Doomsday/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Doomsday/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Doomsday/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Doomsday/thumb.jpg", "actor": [{"@type": "Person", "name": "Rhona Mitra", "url": "/name/nm0593961/"}, {"@type": "Person", "name": "Bob Hoskins", "url": "/name/nm0001364/"}, {"@type": "Person", "name": "Alexander Siddig", "url": "/name/nm0796502/"}, {"@type": "Person", "name": "Caryn Peterson", "url": "/name/nm2944939/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 71029, "ratingValue": "6.0", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Neil Marshall", "url": "/name/nm0551076/"}, {"@type": "Organization", "url": "/company/co0123433/"}, {"@type": "Organization", "url": "/company/co0059753/"}, {"@type": "Organization", "url": "/company/co0004724/"}, {"@type": "Organization", "url": "/company/co0133024/"}, {"@type": "Organization", "url": "/company/co0044704/"}, {"@type": "Organization", "url": "/company/co0239956/"}], "datePublished": "2008-03-14", "description": "Doomsday is a movie starring Rhona Mitra, Bob Hoskins, and Alexander Siddig. A futuristic action thriller where a team of people work to prevent a disaster threatening the future of the human race.", "director": {"@type": "Person", "name": "Neil Marshall", "url": "/name/nm0551076/"}, "duration": "PT1H45M", "genre": ["Action", "Sci-Fi", "Thriller"], "image": "https://m.media-amazon.com/images/M/MV5BMTUwODU2NzE2OF5BMl5BanBnXkFtZTcwMTAwMDA2MQ@@._V1_.jpg", "keywords": "quarantine,virus,wall,britain,contagion", "name": "Doomsday", "review": {"@type": "Review", "author": {"@type": "Person", "name": "Prof-Hieronymos-Grost"}, "dateCreated": "2008-09-10", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0483607/"}, "name": "Crazy plagiaristic fun", "reviewBody": "A deadly virus of unknown origin has spread rapidly through Glasgow, Scotland, killing its victims rapidly. The British government has built a 12 foot steel wall the whole length of the Scottish/English Border in super quick time, so that nobody can get in or out and so the Scots can rot away to their hearts content. 20 years later in London and there is another outbreak and so the government is forced to act, they know that there are still survivors beyond the wall and so they send a crack team of experts in, to find out if they possibly have immunity and to find the mysterious Dr Kane a scientist they believe might have been working on a cure. The leader of this expedition is Maj. Eden Sinclair, a one eyed woman who as a child had been saved by soldiers at the last moment before the wall closed for the last time. her motives are to see her family home and perhaps find her mother.\n\nLike all films by Neil Marshall this latest effort came with a great air of expectancy, so does it deliver?\u0085well it does and it doesn't. Its an apocalyptic tale along the lines of 28 days Later, but it soon spreads its wings and delves into many genres and plucks with its plagiaristic fingers ideas at will from many films. The overall feel of the film is a hotch potch of ideas, one gets the notion that Marshall doesn't have an original idea of his own at all. What is it about the future, that when all law and order has gone and people are struggling to live, find food and drink, some shelter not to mention avoiding a deadly virus etc\u0085rational thoughts desert them and the first thing they want to do is build a car or a hotrod motorcycle with skulls on it?\u0085.well I'll tell you why, because they need transport to the local Cyber Punk Hair Salon, where they all queue for hours with photographs of their favourite member of Sigue Sigue Sputnik and discuss the merits of Adam Ant's Kings of the Wild Frontier, where they also tell the stylist \"I want a Mohican like that...oh and could I have it in bright pink please? damn all out of bright pink, How about luminous aquamarine or cerise? Not only that, but they also live in Glasgow, I don't know if any of you have been to Glasgow, I have many times and its Effing freezing, so why do they all the men go around bear chested and all the ladies wear leather bikinis or less? Maybe its because they are at war with the devilish Dr Kane, who lives in a big Castle, where all the men wear suits of armour and all the ladies have wee lace bonnets and dress like old hags? One thing about a deadly virus it always gives people bad dress sense.\n\nMarshall has made his own bed here and must take responsibility for a lack of imagination, I believe he has stated he wanted this one to be \"for the fans\", so they could \"guess the films he was homaging\", but it can't take away from the fact that he has single handedly stolen ideas from Mad Max, Escape from New York, 28 days later, Ivanhoe, Gladiator, Indiana Jones and a host of other genre films. So enough of the good things and on to the bad, oh I mean good, Well the film wastes no time in getting going and it goes along at a fair old pace, so fast you don't always have time to turn your eyes to heaven and tut. The special effects are really good, as are the fight scenes and the driving/chase scenes, the acting is a little stilted though, (ooops I'm back on the negatives again...oh well) the dialogue doesn't fare much better. From my comments you might think I hated this film....I didn't, I don't know why but somehow against my better judgement, I actually enjoyed it, its escapism and fantasy on another level, its not great by any means but if you want a mindless entertainment for a couple of hours, this one fit's the bill. 6/10", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "6", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "Doomsday Trailer", "embedUrl": "/video/imdb/vi1269956889", "name": "Doomsday", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjQ1NzM0NjkxOF5BMl5BanBnXkFtZTgwNDYyNzkxMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjQ1NzM0NjkxOF5BMl5BanBnXkFtZTgwNDYyNzkxMzE@._V1_.jpg", "uploadDate": "2008-01-17T21:26:39Z"}, "url": "/title/tt0483607/", "EntryAdded": "2013-02-23"}