{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0133302/", "name": "Frontline", "image": "https://m.media-amazon.com/images/M/MV5BMTYwOTI3NjcwMF5BMl5BanBnXkFtZTgwMDM0MDE1NjM@._V1_.jpg", "genre": "Documentary", "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm0528164/", "name": "Will Lyman"}, {"@type": "Person", "url": "/name/nm4153580/", "name": "Sarah Childress"}, {"@type": "Person", "url": "/name/nm1947669/", "name": "Arun Rath"}, {"@type": "Person", "url": "/name/nm6640272/", "name": "Priyanka Boghani"}], "description": "Frontline is a TV series starring Will Lyman, Sarah Childress, and Arun Rath. Investigative journalist documentaries.", "datePublished": "1983-01-17", "keywords": "united states,public affairs,investigative journalism,military,armed forces", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1519, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0133302/"}, "author": {"@type": "Person", "name": "Blueghost"}, "dateCreated": "2003-12-08", "inLanguage": "English", "name": "The best news documentary program on TV today.", "reviewBody": "I've watched Frontline nearly since its debut in 1983. Specifically I remember watching a program on a clash in Greensboro, North Carolina, between communist labor organizers and white supremacists. That program focused on a white-supremacist informant, and how the police treated and used his information. It was a documentary that, for myself, for the first time didn't take sides. It presented testimony by the participants, and made no attempt to guide the thoughts and feelings of the viewers. It was the first time I'd ever seen a prgram that let me think and feel the way I wanted to about a subject. That was twenty years ago, and Frontline has continued to produce fantastic in-depth documanteries to this day.\n\nFrontline's programs have ranged from geo-politics to so-called \"adult films,\" to equal rights, to the battle in Mogadishu, to whatever intriguing subject one can think of. And it's all done with the aim of informing and educating the viewer on how said subject is treated and perceived by those involved.\n\nUnlike other documentaries Frontline merely reports the facts without pushing an agenda (unlike so many other one shot documentaries). Frontline lets you make up your own mind by presenting testimony of the people involved. It's a program whose narration isn't filled with conclusions worded to sound like fact (again, unlike many other documentaries). Instead it relies heavily on an interview format, where the answer to questions by the people involved are presented without being edited or otherwise spun.\n\nIf you're looking for a program that will inform you on complicated topics by presenting testimony, and not processed narration, then Frontline is the program to watch. Not all of its documentary reports will appeal to everyone, but rest assured each one is as thurough as possible at the time it airs.\n\nFrontline is a great supplement to any news program for those who want more information."}, "trailer": {"@type": "VideoObject", "name": "Storm Over Everest", "embedUrl": "/video/imdb/vi458996761", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2YwMWRjZmMtNGNhMS00MDY3LTg3ZDQtOTViZDhjY2ZkOTk1XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2YwMWRjZmMtNGNhMS00MDY3LTg3ZDQtOTViZDhjY2ZkOTk1XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg", "description": "Storm Over Everest", "uploadDate": "2019-08-06T19:52:51Z"}, "EntryURL": "https://www.imdb.com/title/tt0133302", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Frontline", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Frontline/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Frontline/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Frontline/thumb.jpg", "EntryAdded": "2013-02-23"}