{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2297164/", "name": "In-lyu-myeol-mang-bo-go-seo", "image": "https://m.media-amazon.com/images/M/MV5BMTgyNTA3NjM0MV5BMl5BanBnXkFtZTgwMjUxNzIwMTE@._V1_.jpg", "genre": ["Comedy", "Drama", "Fantasy", "Sci-Fi"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0046277/", "name": "Doona Bae"}, {"@type": "Person", "url": "/name/nm2987479/", "name": "Ji-hee Jin"}, {"@type": "Person", "url": "/name/nm1464070/", "name": "Yun-hie Jo"}, {"@type": "Person", "url": "/name/nm0094435/", "name": "Bong Joon Ho"}], "director": [{"@type": "Person", "url": "/name/nm1941507/", "name": "Pil-sung Yim"}, {"@type": "Person", "url": "/name/nm0453518/", "name": "Jee-woon Kim"}], "creator": [{"@type": "Person", "url": "/name/nm0453518/", "name": "Jee-woon Kim"}, {"@type": "Person", "url": "/name/nm1941507/", "name": "Pil-sung Yim"}, {"@type": "Organization", "url": "/company/co0186817/"}], "description": "In-lyu-myeol-mang-bo-go-seo is a movie starring Doona Bae, Ji-hee Jin, and Yun-hie Jo. The First Chapter of The Anthology Film- In A Brave New World, a mysterious virus brings the city to ruins and zombies flood the streets of...", "datePublished": "2012-04-11", "keywords": "robot,asteroid,artificial intelligence,end of the world,ceo", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 3128, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2297164/"}, "author": {"@type": "Person", "name": "paul_haakonsen"}, "dateCreated": "2013-08-04", "inLanguage": "English", "name": "Three very different tales...", "reviewBody": "I sat down to watch \"Doomsday Book\" without having a single clue what it was about, and decided to give it a go simply because it was a Korean movie. And now having seen this movie, I will have to say that this was a different experience in many ways.\n\nFirst of all, this is not a single movie, but a movie comprised of three different short stories, that are independent upon one another, and dealing with very different subjects.\n\nThe first segment, titled \"A Brave New World\" (8 out of 10 rating) was without a doubt the best of the three segments (in my personal opinion). Both story-wise and also entertainment-wise. It is about a man who contracts a strange disease from eating tainted meat, and ends up turning into a zombie. It was a different approach to the zombie genre, but all together a very good one. I thoroughly enjoyed this segment, because it was nicely made, a fresh new take of the zombie genre, and also proved to be the better of the three segments. Great make-up and great effects, a well worthy Korean addition to the zombie vault.\n\nSegment two, titled \"The Heavenly Creature\" (5 out of 10 rating) is about robots having a major part in the life of humans, to the extend where they are so much integrated part of life and structure that they might start to become a threat to mankind. In a Buddhist monastery, an older robot model have found spiritual and religious enlightenment. Well, I will say that the director here had come up with an interesting concept. However, this particular segment turned out to be a little bit too heavy on the ethics and morals, compared to the other two segments. And as such, it turned out to be somewhat of a hard pill to swallow. Aside from that, then the segment was well constructed and nicely filmed, and the robots were quite amazing.\n\nThe third and final segment, titled \"Happy Birthday\" (4 out of 10 rating) was without a doubt the most odd and bizarre of the three segments. It is about a young girl who orders an 8-ball on the Internet for her father, but as luck would have it a 10 kilometer wide meteor is heading towards Earth, threatening to end life as we know it. It turns out that the meteor is the 8-ball ordered by the girl. Yeah, odd story, isn't it? The segment itself was nicely edited and nicely filmed, but the story was just too strange to fully wrap your head around and embrace it for what it was. It sort of felt a little bit out of place in the segments.\n\nI suppose there is a little bit of something for everybody in these three segments, and we would all individually have our different favorite and least favorite of the segments. However, they all do bring something unique and outstanding to the enjoyment of the movie.\n\nFor an Asian movie, then \"Doomsday Book\" was a bit out of the ordinary. As a collective rating, then I would rate the entire movie a 6 out of 10 stars.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H55M", "trailer": {"@type": "VideoObject", "name": "Doomsday Book", "embedUrl": "/video/imdb/vi3353066009", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGVmYzExMzktMjI5Ny00ZDU2LTkzM2YtNDYzMTZkNjIyMDljXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGVmYzExMzktMjI5Ny00ZDU2LTkzM2YtNDYzMTZkNjIyMDljXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg", "description": "Trailers for Doomsday Book", "uploadDate": "2018-12-04T17:11:04Z"}, "EntryURL": "https://www.imdb.com/title/tt2297164", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Doomsday-Book", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Doomsday-Book/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Doomsday-Book/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Doomsday-Book/thumb.jpg", "EntryAdded": "2013-03-25"}