{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt1758429/", "name": "Spartacus: Gods of the Arena", "image": "https://m.media-amazon.com/images/M/MV5BMTYyMjI4NzYxOF5BMl5BanBnXkFtZTcwNTUwMTc1NA@@._V1_.jpg", "genre": ["Action", "Adventure", "Biography", "Drama", "History", "Romance"], "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm0001314/", "name": "John Hannah"}, {"@type": "Person", "url": "/name/nm0071847/", "name": "Manu Bennett"}, {"@type": "Person", "url": "/name/nm0579795/", "name": "Peter Mensah"}, {"@type": "Person", "url": "/name/nm1967109/", "name": "Dustin Clare"}], "creator": [{"@type": "Person", "url": "/name/nm0215299/", "name": "Steven S. DeKnight"}, {"@type": "Organization", "url": "/company/co0000869/"}], "description": "Spartacus: Gods of the Arena is a TV mini-series starring John Hannah, Manu Bennett, and Peter Mensah. In the time before the arrival of Spartacus, the House of Batiatus faces many challenges from competitors, and within its own...", "datePublished": "2011-01-21", "keywords": "arena,gladiator,warrior,sex,female nudity", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 122658, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1758429/"}, "author": {"@type": "Person", "name": "NateS8"}, "dateCreated": "2011-01-22", "inLanguage": "English", "name": "Spartacus, without Spartacus?", "reviewBody": "There were many skeptics leading into this new season (not technically season 2) of \"Spartacus: Gods of the Arena\", many feared it would not be worth watching without Andy Whitfield. For those with concerns, here is some advice: watch it! The major antagonist was lost from the previous season, but the character depth/story of the new leading actor is building AND new depths of past characters from \"Spartacus: Blood and Sand\" are unveiled. The history of how they developed is fascinating. The relationship differences between the two season are significant, thus there is a huge void of curiosity leftover to reveal how they developed to become the personalities they portrayed in season 1.\n\nIt would be remiss to leave out the absolute, succulent gratuity that peaks our senses! The world is enriched with beautiful people, outstanding wardrobes cast in a time that fascinates most, the Roman Empire. Did I mention that many of these beautiful people are quite revealing? Nudity! It is with taste I might add! Of course, references to porn are made, but no porn has the character depth and sophistication that gives the sexual scenes the passion that is conveyed in this series. The necessity to produce these scenes is important in fostering the time-period's stance of sexual openness. The costume range is great; the rich are adorned with lavish jewelry and a colorful, flowing wardrobe which is artistically chosen, and for the poor, well sometimes they are left with nothing. The gladiators are especially left without much clothing, but the armor they do wear is often demonic, intimidating and everything you would naturally expect to find on a person when they are fighting to the DEATH! \n\nThe fight scenes are well choreographed and blood is everywhere! The array of weapons to choose from, the differences in fighting styles, the varying levels of fighting skill all make for interesting battles in the arena. Also, bear in mind that the arena is not only for physical fighting, but the political fold is the pressing force behind the fights. Basically, it is more than just a fight, what you see is not entirely what you get. The fight's value is difference for the gladiator, than it is for the crowd, than it is for the owner's of the gladiators; and, these differences are excellently contrasted. The graphics are not top-notch, but it adds a stylistic element to the show. The blood is vibrant and sometimes seems to defy physics--it's great! The acting is intense and the director seems to strive away from being \"natural\" which is good. The intensity is not monochromatic and individual to each characters personality.\n\nIn a short and sweet summary, this gratuitous mash of beautiful people, fight scenes, political undertones is nothing short of brilliant. Watch it for what it is and you will not be disappointed."}, "trailer": {"@type": "VideoObject", "name": "Spartacus: Gods of the Arena", "embedUrl": "/video/imdb/vi3829700889", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTc2NDQwNTg3OF5BMl5BanBnXkFtZTcwNjk4NjExNA@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTc2NDQwNTg3OF5BMl5BanBnXkFtZTcwNjk4NjExNA@@._V1_.jpg", "description": "A preview trailer for the Starz original series \"Spartacus: Gods of the Arena,\" premiering January 21, 2011.", "uploadDate": "2010-11-20T13:01:34Z"}, "EntryURL": "https://www.imdb.com/title/tt1758429", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Spartacus-Gods-of-the-Arena", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Spartacus-Gods-of-the-Arena/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Spartacus-Gods-of-the-Arena/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Spartacus-Gods-of-the-Arena/thumb.jpg", "EntryAdded": "2011-10-18"}