{"name": "FINAL FANTASY VI", "slug": "final-fantasy-vi", "EntryURL": "https://rawg.io/games/final-fantasy-vi", "description": "<p>FINAL FANTASY VI first debuted in 1994 as the sixth instalment in the iconic FINAL FANTASY series. Innovations included the ability to play all the main characters as the game&#39;s protagonist, and to this day, its epic story intertwining each of their fates is still highly rated and wildly popular.<br />\nWith plenty of abilities available and the magicite system for controlling spells/summoning, players can develop their characters any way they want. This was also the first FINAL FANTASY game to include the Ultima Weapon, the most powerful sword of all and a recurring item in subsequent titles within the series.<br />\nStory<br />\nThe War of Magi left little but ashes and misery in its wake. Even magic itself had vanished from the world. Now, a thousand years later, humankind has remade the world through the power of iron, gunpowder, steam engines, and other machines and technologies.<br />\nBut there is one who possesses the lost power of magic--a young girl name Terra whom the evil Empire has kept enslaved in an effort to harness her power as weapon. This leads to a fateful meeting between Terra and a young man named Locke. Their harrowing escape from the Empire&#39;s clutches sets in motion a series of events that touches countless lives and leads to one inevitable conclusion.<br />\nKey Features<br />\nVeteran character designer Kazuko Shibuya has painstakingly recreated the graphics, bringing the world of FINAL FANTASY VI to your PC for the very first time!<br />\nUpdated controls and active-time battle system are optimized for fluid combat for PC<br />\nIncludes Steam achievements and Trading cards.</p>", "added": 643, "background_image": "https://media.rawg.io/media/games/98c/98c87b286cd2a2ba942167df384a9bd3.jpg", "genres": ["RPG"], "platforms": ["iOS", "Android", "PC", "PlayStation 3", "Wii", "Wii U", "SNES", "PlayStation", "Game Boy Advance", "PSP", "PS Vita"], "developers": ["Sony Interactive Entertainment", "Square Enix", "Square"], "publishers": ["Electronic Arts", "Square Enix", "Sony Computer Entertainment", "Nintendo", "Square"], "released": "1994-04-02", "EntryPath": "Favorites/Games/snapshot/Final-Fantasy-Vi", "Entry_py": "Favorites/Games/snapshot/Final-Fantasy-Vi/info.py", "Entry_json": "Favorites/Games/snapshot/Final-Fantasy-Vi/entry.json", "Entry_thumb": "Favorites/Games/snapshot/Final-Fantasy-Vi/thumb.jpg", "EntryAdded": "06-05-2020"}