{"@context": "http://schema.org", "@type": "TVSeries", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Expanse", "EntryURL": "https://www.imdb.com/title/tt3230854", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Expanse/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Expanse/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Expanse/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Expanse/thumb.jpg", "actor": [{"@type": "Person", "name": "Steven Strait", "url": "/name/nm1711829/"}, {"@type": "Person", "name": "Cas Anvar", "url": "/name/nm0031679/"}, {"@type": "Person", "name": "Dominique Tipper", "url": "/name/nm4625680/"}, {"@type": "Person", "name": "Wes Chatham", "url": "/name/nm1434871/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 91952, "ratingValue": "8.5", "worstRating": "1.0"}, "contentRating": "TV-14", "creator": [{"@type": "Person", "name": "Mark Fergus", "url": "/name/nm1318843/"}, {"@type": "Person", "name": "Hawk Ostby", "url": "/name/nm1319757/"}, {"@type": "Organization", "url": "/company/co0054452/"}, {"@type": "Organization", "url": "/company/co0007038/"}], "datePublished": "2015-11-23", "description": "The Expanse is a TV series starring Steven Strait, Cas Anvar, and Dominique Tipper. A police detective in the asteroid belt, the first officer of an interplanetary ice freighter, and an earth-bound United Nations executive slowly...", "genre": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "image": "https://m.media-amazon.com/images/M/MV5BNGJlNzU1OTEtZDRmNy00YTM3LTgxNDgtMWEwNTg2OGI1YzYwXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg", "keywords": "asteroid belt,false flag operation,space opera,dead girlfriend,shootout", "name": "The Expanse", "review": {"@type": "Review", "author": {"@type": "Person", "name": "jeffrey-46"}, "dateCreated": "2018-04-04", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3230854/"}, "name": "Best \"hard\" sci fi I've seen since Battlestar Galactica", "reviewBody": "OMG I love this show. I've seen up through S02E03 on Amazon Prime.\n\nI only gave it a 9 because I don't like to give anything a 10.\n\nOthers have gone into good detail of what is good about this show so I'll just add some bullet points that I didn't see covered (although with 250+ reviews I probably just missed 'em)\n\nIn no particular order other than stream-of-consciousness:\n\n* Detailed, realistic science fiction * Space behaves like, well, space * Gravity. They did a stellar job with gravity. It isn't perfect. But they emphasize realistic ways to simulate gravity (ships under continuous acceleration, spinning, ring-shaped space stations). And they shut gravity off when appropriate. * Space ship battles are incredibly thoughtfully designed, with an eye for small details. They pump the air out of the ship before a battle, for goodness' sake. I can't think of *any* other scifi space show that goes into these details * Consistency. Characters act consistently. Environments act consistently. * Details. So many details! Mag boots. Ship maneuvers. technology such as computer/handheld devices. All so believable. * Mormons! There are mormons, because, of course there are. And they aren't even the bad guys! (I only state it this way because too often, mysterious religious groups are used as hollywood shorthand for \"bad guys\"). The presence of Mormons just enriches the worldbuilding. * I love the fact that Eros station just looks like a giant potato with a porthole on its butt. It isn't polished. It isn't flashy. It's grimy and utilitarian. * I love that every move made by a spaceship has corresponding thrusters pushing it in that direction. The space ships do not fly like fighter jets, like they do in other typical sci fi shows. They fly like rocks. * I love the fact that space craft tracking screens look like legitimate space object tracking screens, with curved, mathematically drawn projected trajectories.\n\nI can't gush enough about the \"hard\" sci-fi elements. I haven't even gushed about the production yet:\n\n* Story is detailed, in-depth, and engaging. It's basically a political/war drama, but it is very well written. * Acting is great. Seriously. Even the throwaway characters are great. * Anyone can die at any time. Very Game-of-Thrones-y in this regard, in a good way. Builds tension very realistically. * Costumes, sets, graphics, cinematography are all excellent\n\nStar Trek. I used to like Star Trek. Have you seen Star Trek Beyond (2016) though? That was terrible. Everything that is done wrong in Star Trek Beyond is done correctly in The Expanse. In fact, I'm not sure I can watch any Star Trek show or movie again after The Expanse.\n\nUltimately The Expanse feels like a combination of Battlestar Galactica (2005 one) and Firefly, more than any other series I can think of.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "9", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "embedUrl": "/video/imdb/vi4290952985", "name": "Season 4 Trailer", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDRkZmU4N2MtNDFmOC00ZGE0LWFiNDctMzQ5NzUxN2Q1MTYzXkEyXkFqcGdeQWpnYW1i._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDRkZmU4N2MtNDFmOC00ZGE0LWFiNDctMzQ5NzUxN2Q1MTYzXkEyXkFqcGdeQWpnYW1i._V1_.jpg", "uploadDate": "2019-11-15T19:16:02Z"}, "url": "/title/tt3230854/"}