{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/V-for-Vendetta", "EntryURL": "https://www.imdb.com/title/tt0434409", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/V-for-Vendetta/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/V-for-Vendetta/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/V-for-Vendetta/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/V-for-Vendetta/thumb.jpg", "actor": [{"@type": "Person", "name": "Hugo Weaving", "url": "/name/nm0915989/"}, {"@type": "Person", "name": "Natalie Portman", "url": "/name/nm0000204/"}, {"@type": "Person", "name": "Rupert Graves", "url": "/name/nm0001291/"}, {"@type": "Person", "name": "Stephen Rea", "url": "/name/nm0001653/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 997995, "ratingValue": "8.2", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Lilly Wachowski", "url": "/name/nm0905152/"}, {"@type": "Person", "name": "Lana Wachowski", "url": "/name/nm0905154/"}, {"@type": "Person", "name": "David Lloyd", "url": "/name/nm2331222/"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0167271/"}, {"@type": "Organization", "url": "/company/co0019968/"}, {"@type": "Organization", "url": "/company/co0167243/"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0053177/"}, {"@type": "Organization", "url": "/company/co0130575/"}, {"@type": "Organization", "url": "/company/co0038332/"}], "datePublished": "2006-03-15", "description": "V for Vendetta is a movie starring Hugo Weaving, Natalie Portman, and Rupert Graves. In a future British tyranny, a shadowy freedom fighter, known only by the alias of \"V\", plots to overthrow it with the help of a young woman.", "director": {"@type": "Person", "name": "James McTeigue", "url": "/name/nm0574625/"}, "duration": "PT2H12M", "genre": ["Action", "Drama", "Sci-Fi", "Thriller"], "image": "https://m.media-amazon.com/images/M/MV5BOTI5ODc3NzExNV5BMl5BanBnXkFtZTcwNzYxNzQzMw@@._V1_.jpg", "keywords": "fascist,freedom,revolution,dystopia,right wing government", "name": "V for Vendetta", "review": {"@type": "Review", "author": {"@type": "Person", "name": "HiddenVoice"}, "dateCreated": "2006-03-09", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0434409/"}, "name": "Riveting and Exciting.", "reviewBody": "This marks the fantastic return of the Wachowski brothers.Those who were disappointed with their last two efforts will not be disappointed here,there is no doubt that the Brothers are talented.Here they make their comeback.But not as filmmakers,but as producers and writers.And to be honest ,this film thrills you from beginning to end.You'll be blown away with this adrenaline excitement and dramatically intense thriller.\n\nA finely complex storyline about V, a reluctant freedom fighter , a rebellion who fights for freedom against the government in London in another time line.Set against the futuristic landscape of totalitarian Britain,a mild-mannered young woman named Evey who is rescued from a life-and-death situation by\"V.\" Incomparably charismatic and ferociously skilled in the art of combat and deception, V urges his fellow citizens to rise up against tyranny and oppression. As Evey uncovers the truth about V's mysterious background, she also discovers the truth about herself--and emerges as his unlikely ally in the culmination of his plot to bring freedom and justice back to a society fraught with cruelty and corruption.\n\nThis is perhaps the first and fully realized and most successful of all the Moore adaptations.What I liked about this film was the way it balances action and drama.The script is fantastic and directing is equally worth a mention.The assistant director on the Matrix(James McTeigue) movies really has some talent ,and handles the action and drama very well.The film is fast paced and exciting.It is also politically charged and quite controversial but that is the point.It makes you think about the current situation, how well is the government handling the situation of terrorism.V serves as an anti-hero on a quest of freedom.His actions are right but his methods are wrong,he is trying to bring about a message in the wrong way.\n\nThis film focuses on the source material of the book, more on the characters than on the action.More on the emotions and the drama than on the violence.This film doesn't glorify V as a terrorist but shows that under certain circumstances he was tempted to be what he is.The film has an intriguing atmosphere throughout,never once boring,an apocalyptic future setting really heightens the tension with starkly dark set designing and stunning cinematography.The action is striking and the performances in the drama are standout.This is a terrific movie at all points, it has a strong script , impressive directing and commendable performances.But having read the book after the movie,I must confess this film is still nowhere close to being better than the book.No way.It feels incomplete adaptation,leaving a lot of details behind,whereas the book had a more in depth look at V's life and his relationship with Evey.But I guess the filmmakers wanted to take a different approach,to which they succeed completely.\n\nThere is a reference or close resemblance to Guatanamo prison and 9/11 issues echoes throughout the film.And it made the film even more direct.There are several more references to our world dominated by politics and government,regarding terrorism.And what they do to secure their safety.This is one thing that makes V so controversial.His actions will make you think he's insane,but it's just an idea,a notion that alerts us to take actions if our own Government ever try to control us,and inflict fear into our lives. \n\nHidden behind the creepy mask ,Hugo Weaving really proves he is a versatile actor.His character provokes thoughtful questions in a dystopian future ,and every emotion of his character is brought out by Weavings performance.Portman on the other hand also excels,with a convincing accent.She really is the heroine of the film and she handles the role quite well.The scenes between Evey and V are touching and well handled.The rest of the film is superb in its execution.\n\nV is an idea,a symbol,a metaphor that cannot be destroyed.A man can be obliterated but as an idea,an icon he is indestructible and his message becomes more powerful to convey as people look upon this figure ,but not the man beneath it.One man can make a huge difference but united men and women can change something.And that's what made me respond to this film's ideas.It's full of it.Shed with technical and visual brilliance.\n\nA spellbinding adventure , exciting action, superb directing and writing and a Sci-Fi film with a thoughtful message,and the first fully satisfying Moore adaptation.This film is the most controversial and at the same time breathtaking Action/thriller.A terrific achievement produced by the Wachowskis' and Silver.The climax,especially,was uplifting and beautifully executed.And will live on to be one of the most memorable conclusions.It always get me.\n\nIf there's anything out there in the theaters that will blow you away before summer season kicks off ,then this is a blast for you.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "8", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "Trailer for V For Vendetta", "embedUrl": "/video/imdb/vi4276093209", "name": "V for Vendetta", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWVkNmQ2ZjktZTU1My00ZTIyLWIzMTctZmEzNjQ0NTM5YzM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWVkNmQ2ZjktZTU1My00ZTIyLWIzMTctZmEzNjQ0NTM5YzM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "uploadDate": "2008-04-11T17:38:16Z"}, "url": "/title/tt0434409/"}