{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Green-Mile", "EntryURL": "https://www.imdb.com/title/tt0120689", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Green-Mile/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Green-Mile/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Green-Mile/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Green-Mile/thumb.jpg", "actor": [{"@type": "Person", "name": "Tom Hanks", "url": "/name/nm0000158/"}, {"@type": "Person", "name": "Michael Clarke Duncan", "url": "/name/nm0003817/"}, {"@type": "Person", "name": "David Morse", "url": "/name/nm0001556/"}, {"@type": "Person", "name": "Bonnie Hunt", "url": "/name/nm0001372/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 1095336, "ratingValue": "8.6", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Stephen King", "url": "/name/nm0000175/"}, {"@type": "Person", "name": "Frank Darabont", "url": "/name/nm0001104/"}, {"@type": "Organization", "url": "/company/co0040620/"}, {"@type": "Organization", "url": "/company/co0029398/"}, {"@type": "Organization", "url": "/company/co0002663/"}], "datePublished": "1999-12-10", "description": "The Green Mile is a movie starring Tom Hanks, Michael Clarke Duncan, and David Morse. The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift.", "director": {"@type": "Person", "name": "Frank Darabont", "url": "/name/nm0001104/"}, "duration": "PT3H9M", "genre": ["Crime", "Drama", "Fantasy", "Mystery"], "image": "https://m.media-amazon.com/images/M/MV5BMTUxMzQyNjA5MF5BMl5BanBnXkFtZTYwOTU2NTY3._V1_.jpg", "keywords": "death row inmate,good versus evil,1930s,prison guard,murder", "name": "The Green Mile", "review": {"@type": "Review", "author": {"@type": "Person", "name": "Movie-12"}, "dateCreated": "2000-01-25", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0120689/"}, "name": "One of the most penetrating films of the past several years. **** out of ****", "reviewBody": "THE GREEN MILE (1999) ****\n\nStarring: Tom Hanks, David Morse, Michael Clarke Duncan, Bonnie Hunt, James Cromwell, Michael Jeter, Doug Hutchison, and Gary Sinise Written and directed by Frank Darabont. Running Time: 180 minutes. Rated R (for scenes of strong disturbing violence, language, and some sexuality)\n\n By Blake French:\n\n\tIt's not everyday that a movie is able to change an audiences opinion on something. \"The Green Mile\" is a movie that made me think long and hard about supporting the death penalty. The film, based on a novel by  Stephen King, contains such a variety of emotional events that it repels its audience away from its subject rather than glamorizing it. Only a handful of recent productions have been capable of such power. \"The Green Mile\" is truly one of the best films this year and is Oscar Worthy in many categories. It is a unique, three hour experience that must be seen to believe.  \n\nThe story is more of a personal narrative than an actual plot. The film offers an interesting perspective of the events that take place. It is seen through the eyes of a man who is over one hundred years of age, Paul Edgecomb, who is currently living in an old folks home with his friend, Elaine. During a very emotional day for Paul, he tells Elaine of a historical year in his experiences. She listens closely to his story.\n\nHe tells of a particular year in the 1930's. The setting is a beautifully crafted prison hall. Paul explains he used to be a kind prison guard on death row in charge of overseeing the executions. In this year, several significant activities occurred in his life: he had a terribly painful urinary infection, and met a prisoner named John Coffey. This man has been sentenced to the electric chair for the rape and murder of two innocent little girls. This man isn't like anyone else Paul has seen, however. Aside from being massive in size, he is humble, mild mannered, and caring. After several miraculous events take place that may point to the thought that John Coffey might have magical powers from God, Paul begins to doubt the crimes this so called criminal has been convicted of. \n\n\tThroughout the story we witness three executions that in an electric chair. These capital punishment sequences have much power and significance. The electrocutions, one in particular, contain some of the most unsettling, disturbing material in film history. The movie is anti death penalty; we see the sometimes sadistic world from the prisoner guards point of view. It will put you in their shoes--and perhaps, change your opinion on the death penalty. I certainly had to think about my stand on this issue.\n\n I did have questions that were not really answered by the filmmakers. I wanted more on John Coffey's magical powers; the miracles aren't investigated enough to suit our pleas. I think the movie could have also stood on a firmer platform of religion. We assume that Coffey's abilities are a gift from God from the character's dialogue, but religion itself is more of a theme in the film than a message or plot point. I can perfectly see why the writers decided to leave these elements to the audiences imagination, to provoke participation. So I suppose my objections are not really flaws, just personal aspirations.\n\n\"The Green Mile\" contains so many vivid performances, I will not be able to honor everyone who deserves credit in my review. Michael Jeter, Gary Sinise, Doug Hutchison, James Cromwell, Bonnie Hunt, and David Morse are all superior in strength of their characters. Each contributes Oscar worthy performances, and if the Academy leaves these individuals out at Award time, they need to recheck their databases. Michael Clarke Duncan recently received a Golden Globe nomination for his supporting role, and he deserves it. Tom Hanks is just unspeakably brilliant in the leading role. He is right behind Kevin Spacey from \"American Beauty\" in the best performance of 1999. \n\n The message to \"The Green Mile\" is clear and understandable: justice isn't always just and the miracles can happen in the most unexpected of places. This film is one of the most penetrating dramas of the past several years. It will induce your mind to think about its subjects, and gradually build on you. \"The Green Mile\" is a movie that will stick with you long after the ending credits role by. \n\nBrought to you by Warner Bros.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "10", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "Home Video Trailer from Warner Home Video", "embedUrl": "/video/imdb/vi552796441", "name": "The Green Mile", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BODU4NmYyMzEtNzkwNy00NmFlLTk3YWItM2I5NDk3YTUyODFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODU4NmYyMzEtNzkwNy00NmFlLTk3YWItM2I5NDk3YTUyODFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "uploadDate": "2008-04-11T16:45:12Z"}, "url": "/title/tt0120689/"}