{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt5425186/", "name": "Horace and Pete", "image": "https://m.media-amazon.com/images/M/MV5BNjRhOGY5ZmMtYWE5ZC00ZDA2LTk3NDItN2FlOGE5MjQwMjVkXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg", "genre": ["Comedy", "Drama"], "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm0127373/", "name": "Louis C.K."}, {"@type": "Person", "url": "/name/nm0000114/", "name": "Steve Buscemi"}, {"@type": "Person", "url": "/name/nm0004908/", "name": "Edie Falco"}, {"@type": "Person", "url": "/name/nm0942833/", "name": "Steven Wright"}], "creator": [{"@type": "Person", "url": "/name/nm0127373/", "name": "Louis C.K."}, {"@type": "Organization", "url": "/company/co0363979/"}], "description": "Horace and Pete is a TV series starring Louis C.K., Steve Buscemi, and Edie Falco. Louis C.K.'s Eugene O'Neill-esque dramedic web series about two brothers, introverted Horace and mentally ill Pete, the current owners of their...", "datePublished": "2016-01-30", "keywords": "web series,bar,character name in title", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 14242, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt5425186/"}, "author": {"@type": "Person", "name": "fball114"}, "dateCreated": "2016-02-10", "inLanguage": "English", "name": "Quality tragedy", "reviewBody": "It seems to me that one of Louis CK's strengths is the authentic nature of the dialogue. Given the quality of the actors in this thing, it makes for some captivating viewing.\n\nI found the bar-discussion about politics, etc, to be very entertaining and well-paced. It was almost a little Aaron- Sorkinesque and I loved it. Also amazing to see how up-to-date it is?! Talk about fresh material. I thought the accountant-bit was funny.\n\nThe main plot about the family was engaging and managed to pull me in. It was depressing and dark, but still somehow not exhausting to watch. I am not actually a big fan of Louie's darker episodes, I don't have the patience or the inclination to spend my time being challenged and depressed. I want it to be funny and entertaining. But even so, I watch and value the darker Louie episodes, and I watched and enjoyed this. As I said, there is this theater-like presentation and at the same time feels so authentic! When Buscemi says \"and you give our whiskey to this stranger\" (or something), I get the feeling that the characters have had their own thoughts and feelings while our attention was diverted.\n\nIt's fun to see Louis use these very typical, almost cliché transitions (walking down the stairs to change scenes, etc) and making it work? It's very well made. I loved the diegetic music, watching Alda establish his presence by reacting to it.\n\nThere is no laughter-track or audience referencing at all. You are totally left to your own devices as a viewer, to laugh or dislike at your own discretion. It's kind of artistic, in that it challenges you to like it or shove off?\n\nWhile I wasn't enjoying watching it, as it was sad and not my typical kind of thing, I am glad that I did. It's great watching something this well made.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "EntryURL": "https://www.imdb.com/title/tt5425186", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Horace-and-Pete", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Horace-and-Pete/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Horace-and-Pete/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Horace-and-Pete/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Horace-and-Pete/thumb.jpg", "EntryAdded": "2016-03-12"}