{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt4820370/", "name": "Channel Zero", "image": "https://m.media-amazon.com/images/M/MV5BMjExMTMxNjMwNl5BMl5BanBnXkFtZTgwNDA2OTYzNjM@._V1_.jpg", "genre": ["Drama", "Fantasy", "Horror", "Mystery", "Thriller"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm1792900/", "name": "Brandon Scott"}, {"@type": "Person", "url": "/name/nm1011431/", "name": "Marina Stephenson Kerr"}, {"@type": "Person", "url": "/name/nm6786013/", "name": "Abigail Pniowsky"}, {"@type": "Person", "url": "/name/nm4627683/", "name": "Diana Bentley"}], "creator": [{"@type": "Person", "url": "/name/nm4528537/", "name": "Nick Antosca"}, {"@type": "Organization", "url": "/company/co0719556/"}, {"@type": "Organization", "url": "/company/co0242101/"}], "description": "Channel Zero is a TV series starring Brandon Scott, Marina Stephenson Kerr, and Abigail Pniowsky. An anthology series based on popular Internet Creepypastas Candle Cove, The No-End House, Butcher's Block, and The Dream Door.", "datePublished": "2016-10-11", "keywords": "anthology series,2010s,fictional horror series,reference to candle cove,reference to creepypasta", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 8519, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4820370/"}, "author": {"@type": "Person", "name": "cmt571"}, "dateCreated": "2016-11-20", "inLanguage": "English", "name": "Solid, Frightening Experience", "reviewBody": "When I first heard that Syfy was making a show about creepypastas, I was skeptical at best, especially since I never found the story of Candle Cove to be scary; in fact, I viewed it as one of the weaker creepypastas out there. The few promos I saw intrigued me, though, so I gave the show a shot. I'm not sure whether that was the best or worse decision I have made about a TV series.\n\nThis show genuinely disturbed me in ways I honestly didn't know were possible. I'd like to point out that I do not find horror movies even remotely scary--American, Japanese, or otherwise--and \"horror\" shows even less, so I was not expecting that Channel Zero would be the one to freak me out. A huge part of this is due to the production and direction of this series. Considering that the creator/one of the writers/producers of this show was also a writer and co-producer for the show Hannibal, looking back I can see parallels in both storytelling and pacing. Instead of having jump-scares every five seconds, Candle Cove used long, slow, drawn-out shots (sometimes painfully so) to build anticipation and force you to imagine what the heck could possibly be just out of the shot, or what was going to happen. I also have to give major credit to the props, costume, and makeup departments for crafting thoroughly terrifying, organic visuals that never felt clichéd. The acting was believable, even with the child actors, but there wasn't much chemistry between any of the characters. I'm not sure if this was intentional given the main character's backstory and what's going on in the story, but it's what I've elected to believe. While it felt odd, it wasn't distracting, but did make some interactions less intense or grounded than they probably should have been. At times it seemed like there were a lot of plot-points that didn't seem to lead anywhere, but ultimately the story wrapped itself up nicely, and explained nearly everything...albeit in the freakiest, most nerve-wracking way possible.\n\nOverall, the show was not perfect, but it was solid. I appreciated that it didn't resort to cheap horror scare tactics and tropes, and that it made a simple internet-urban-legend a dark, messed up show that got under my skin. If you enjoy traditional horror, this show might seem boring and anti-climactic, but if you can let yourself get sucked in and stick with it, then you'll probably be rewarded with some Grade-A, well-crafted nightmare fuel.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "5"}}, "trailer": {"@type": "VideoObject", "name": "Channel Zero Official Trailer", "embedUrl": "/video/imdb/vi2419570713", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGVkY2Y4MzgtYjY2Yi00YzIxLWE1M2EtNmE4YTY2NzQ2NTE1XkEyXkFqcGdeQXVyNzkyNzc3NjU@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGVkY2Y4MzgtYjY2Yi00YzIxLWE1M2EtNmE4YTY2NzQ2NTE1XkEyXkFqcGdeQXVyNzkyNzc3NjU@._V1_.jpg", "uploadDate": "2018-02-27T21:24:56Z"}, "EntryURL": "https://www.imdb.com/title/tt4820370", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Channel-Zero", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Channel-Zero/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Channel-Zero/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Channel-Zero/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Channel-Zero/thumb.jpg", "EntryAdded": "06-03-2020"}