{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2072230/", "name": "Shingeki no kyojin", "image": "https://m.media-amazon.com/images/M/MV5BZDk5MTcxZmItYWM2Ny00NjIwLWE2YWQtYjczMWFiZThjN2JkXkEyXkFqcGdeQXVyNDQyNzIwNDQ@._V1_.jpg", "genre": ["Action", "Adventure", "Drama", "Fantasy", "Horror", "Sci-Fi"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm3950075/", "name": "Ashly Burch"}, {"@type": "Person", "url": "/name/nm0745310/", "name": "Bryce Papenbrook"}, {"@type": "Person", "url": "/name/nm0722676/", "name": "Monica Rial"}, {"@type": "Person", "url": "/name/nm2743770/", "name": "Brandon Potter"}], "director": {"@type": "Person", "url": "/name/nm0383688/", "name": "Shinji Higuchi"}, "creator": [{"@type": "Person", "url": "/name/nm4697729/", "name": "Hajime Isayama"}, {"@type": "Person", "url": "/name/nm3403795/", "name": "Tomohiro Machiyama"}, {"@type": "Person", "url": "/name/nm2448218/", "name": "Yûsuke Watanabe"}, {"@type": "Person", "url": "/name/nm0121423/", "name": "John Burgmeier"}, {"@type": "Person", "url": "/name/nm2057312/", "name": "J. Michael Tatum"}, {"@type": "Organization", "url": "/company/co0021660/"}, {"@type": "Organization", "url": "/company/co0191791/"}, {"@type": "Organization", "url": "/company/co0022792/"}, {"@type": "Organization", "url": "/company/co0002219/"}, {"@type": "Organization", "url": "/company/co0364911/"}], "description": "Shingeki no kyojin is a movie starring Ashly Burch, Bryce Papenbrook, and Monica Rial. In a world where giant humanoid Titans prey on humans, Eren joins the scouting legion to get revenge on the monsters who killed everyone in his...", "datePublished": "2015-08-01", "keywords": "live action remake of anime,titan,giant,man eating giant,two parts", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 11560, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2072230/"}, "author": {"@type": "Person", "name": "billygoat1071"}, "dateCreated": "2015-08-12", "inLanguage": "English", "name": "Watered Down Humanity", "reviewBody": "Attack on Titan is recently one of the most popular manga/anime in a while, it wasn't nearly as rich as some of the greatest ones out there, however the material tackles a rather mature subtext, otherwise a really fascinating showcase of macabre in a larger scale. It's clearly destined to be a movie, it might as well fit in today's blockbuster trend of post-apocalyptic settings and revolution ordeals. But the movie's approach is rather standard in comparison. While it still wonderfully realizes the most grotesque moments of its source material, the characters are watered down with less interesting plights. Newcomers might find its premise intriguing, but what makes Attack on Titan interesting is hardly existent in this adaptation.\n\nHow the main characters are introduced is painfully contrived. Like every piece of exposition is immediately crammed into that one long scene that is supposed to establish who they are and what their world is. The difference is it's not quite compelling. I personally don't mind changes from its source material; the protagonist, Eren, is basically now a slacker who is tired of living behind the colossal walls from the titans, instead of an aggressive kid with some sociopathic tendencies who vows for revenge. It's not necessarily horrible since they're still represented as unlikely heroes, but Eren's arc is basically just trying to win back his girl and living up to that image, it makes him look lousier. What makes this character originally interesting is the fact that he is a traumatized kid who is too full of himself, which eventually crosses the line of his humanity and morality. It may not be the friendliest role model you'll see from a hero, but it rather makes him more relatable.\n\nAnd that sounds more reasonable since this circumstance would really affect one's senses into insanity or paranoia. But in this movie, they're just verbally expressing their fears, sentiments and humor. The plot is ought to be followed through these characters, but most of them are single noted. They might as well exist in some YA where they're designed to be hormonally appealing. In the end, they're clearly just uninteresting. To its credit, the visuals are pretty cool. It may not be perfect or spectacular, but it's impressive enough to take these exciting moments into live action. There are some scenes that can be count as genuinely awesome, specifically the climax, even though it now seems to be quite senseless since they're taking this story to a different direction. Nevertheless, as long as these Titans and gore are on screen, there is some real pleasure to be taken.\n\nAttack on Titan, in spite of its scale and production, is surprisingly underwhelming. The filmmakers are clearly just following the conventional direction of adapting a popular material, more or less. Visually, it's appropriate to call it a fan service; because it indeed puts these big action where it belongs. But thematically, it is a letdown. Attack on Titan isn't only great for its creepy titans and cool gadgetry, in fact, these things are basically small compared to its surprising complexity within its characters. That is what I personally believe that makes this material great, and yet that's what the movie ended up altering. Therefore it's just a standard B-Movie. It can be mindless fun, but you won't find anything else to like in the end.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "5"}}, "duration": "PT1H38M", "trailer": {"@type": "VideoObject", "name": "U.S. Theatrical Trailer", "embedUrl": "/video/imdb/vi780120857", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjIzMzgxMjE5M15BMl5BanBnXkFtZTgwNjgyMjM5NjE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjIzMzgxMjE5M15BMl5BanBnXkFtZTgwNjgyMjM5NjE@._V1_.jpg", "description": "The story of a world where most of humanity has been destroyed by giants and where the last of mankind fights to survive behind three concentric walls - walls that were once impenetrable to the giants.", "uploadDate": "2015-10-01T09:38:53Z"}, "EntryURL": "https://www.imdb.com/title/tt2072230", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan/thumb.jpg", "EntryAdded": "2015-08-15"}