{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2072230/", "name": "Shingeki no kyojin", "image": "https://m.media-amazon.com/images/M/MV5BZDk5MTcxZmItYWM2Ny00NjIwLWE2YWQtYjczMWFiZThjN2JkXkEyXkFqcGdeQXVyNDQyNzIwNDQ@._V1_.jpg", "genre": ["Action", "Adventure", "Drama", "Fantasy", "Horror", "Sci-Fi"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm3950075/", "name": "Ashly Burch"}, {"@type": "Person", "url": "/name/nm0745310/", "name": "Bryce Papenbrook"}, {"@type": "Person", "url": "/name/nm0722676/", "name": "Monica Rial"}, {"@type": "Person", "url": "/name/nm2743770/", "name": "Brandon Potter"}], "director": {"@type": "Person", "url": "/name/nm0383688/", "name": "Shinji Higuchi"}, "creator": [{"@type": "Person", "url": "/name/nm4697729/", "name": "Hajime Isayama"}, {"@type": "Person", "url": "/name/nm3403795/", "name": "Tomohiro Machiyama"}, {"@type": "Person", "url": "/name/nm2448218/", "name": "Yûsuke Watanabe"}, {"@type": "Person", "url": "/name/nm0121423/", "name": "John Burgmeier"}, {"@type": "Person", "url": "/name/nm2057312/", "name": "J. Michael Tatum"}, {"@type": "Organization", "url": "/company/co0021660/"}, {"@type": "Organization", "url": "/company/co0191791/"}, {"@type": "Organization", "url": "/company/co0022792/"}, {"@type": "Organization", "url": "/company/co0002219/"}, {"@type": "Organization", "url": "/company/co0364911/"}], "description": "Shingeki no kyojin is a movie starring Ashly Burch, Bryce Papenbrook, and Monica Rial. In a world where giant humanoid Titans prey on humans, Eren joins the scouting legion to get revenge on the monsters who killed everyone in his...", "datePublished": "2015-08-01", "keywords": "live action remake of anime,titan,giant,man eating giant,two parts", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 11559, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2072230/"}, "author": {"@type": "Person", "name": "tcampbell76"}, "dateCreated": "2015-08-22", "inLanguage": "English", "name": "It's not as bad as the fan-boys on here are saying...", "reviewBody": "As a non-fan I was mildly entertained. Didn't think it was terrible, didn't think it was the best film ever. I felt it faithfully translated a very convoluted TV series the best way it could within 90 mins while not sacrificing action and Titan screen time.\n\nI don't consider myself a fan of the TV series, but being someone in their late 30's who grew up on they heyday of Japanese animation back in the 80's and 90's--Attack on Titan was the first time in a long while that an animation from there felt fresh, poignant and emotionally compromising for the viewer. The young kid in me would have loved this TV series, but the late 30's me who has been through a lot in life and chooses to seek out more positive and cheerful entertainment felt it got a bit too overly depressing and macabre. That's not saying I felt it was bad, just no longer my taste in entertainment anymore.\n\nFanboys/fan-girls on here rating this film 1's have noticeably a lot of impractical whines concerning the film. They simply are expecting a 600 hour TV animation series to be summed up in 90mins. It doesn't take someone who has worked on a film to realize that is setting up an impractical expectation. Characters and situations ARE to be expectedly retooled in order to give the film proper pacing. Sure, some characters in the film that fans had invested a lot of hours into via the TV series are sometimes sidelined, rewritten or killed off. I expected and knew this would happen and it didn't change my perspective on the overall film because I didn't go in with impractical fan expectations of this \"film adaptation\". Of course a 600 hour TV series has plenty of time for you to become emotionally invested with meat shield fighters that the overall story had every intention of killing off down the line for more emotional impact. But trying to delve into all those characters in a 90 minute film isn't going to happen. Have to be more objective than that within the context of this adaptation.\n\nThat being said the film does suffer from being disjointed and rushing through major plot points towards the final cliffhanger. It's really a film that just gets to the point and does not bores you with exposition that you can pretty much obviously figure out on your own.\n\nThe Titans are absolutely as terrifying as I remembered from the TV series and faithfully depicted. I found myself covering my face in some parts like I did with the TV series, so I think they did their job well in translating the horror and macabre of what the humans went through.\n\nThe action was obviously CGI heavy, but not done in a way that felt tawdry. They perfectly captured the aerial flight and feel of the fights from the TV series well.\n\nAttack on Titan was by no means a 1 rated film. It's no Ed Wood film. It's no Manos the Hands of Fate. It's not Glitter levels of bad. It's not a film that is really that terrible. It's a film that on a baseline captures the terrifying essence of the TV series main concepts, but does suffers a little bit on core characters development.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H38M", "trailer": {"@type": "VideoObject", "name": "U.S. Theatrical Trailer", "embedUrl": "/video/imdb/vi780120857", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjIzMzgxMjE5M15BMl5BanBnXkFtZTgwNjgyMjM5NjE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjIzMzgxMjE5M15BMl5BanBnXkFtZTgwNjgyMjM5NjE@._V1_.jpg", "description": "The story of a world where most of humanity has been destroyed by giants and where the last of mankind fights to survive behind three concentric walls - walls that were once impenetrable to the giants.", "uploadDate": "2015-10-01T09:38:53Z"}, "EntryURL": "https://www.imdb.com/title/tt2072230", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Attack-on-Titan/thumb.jpg"}