{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Eternal-Sunshine-of-the-Spotless-Mind", "EntryURL": "https://www.imdb.com/title/tt0338013", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Eternal-Sunshine-of-the-Spotless-Mind/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Eternal-Sunshine-of-the-Spotless-Mind/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Eternal-Sunshine-of-the-Spotless-Mind/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Eternal-Sunshine-of-the-Spotless-Mind/thumb.jpg", "actor": [{"@type": "Person", "name": "Jim Carrey", "url": "/name/nm0000120/"}, {"@type": "Person", "name": "Kate Winslet", "url": "/name/nm0000701/"}, {"@type": "Person", "name": "Tom Wilkinson", "url": "/name/nm0929489/"}, {"@type": "Person", "name": "Gerry Robert Byrne", "url": "/name/nm0004423/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 878034, "ratingValue": "8.3", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Charlie Kaufman", "url": "/name/nm0442109/"}, {"@type": "Person", "name": "Michel Gondry", "url": "/name/nm0327273/"}, {"@type": "Person", "name": "Pierre Bismuth", "url": "/name/nm1410028/"}, {"@type": "Person", "name": "Charlie Kaufman", "url": "/name/nm0442109/"}, {"@type": "Organization", "url": "/company/co0042399/"}, {"@type": "Organization", "url": "/company/co0017525/"}, {"@type": "Organization", "url": "/company/co0017713/"}], "datePublished": "2004-03-19", "description": "Eternal Sunshine of the Spotless Mind is a movie starring Jim Carrey, Kate Winslet, and Tom Wilkinson. When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories.", "director": {"@type": "Person", "name": "Michel Gondry", "url": "/name/nm0327273/"}, "duration": "PT1H48M", "genre": ["Drama", "Romance", "Sci-Fi"], "image": "https://m.media-amazon.com/images/M/MV5BMTY4NzcwODg3Nl5BMl5BanBnXkFtZTcwNTEwOTMyMw@@._V1_.jpg", "keywords": "memory,loneliness,retrograde narrative,flashback,valentine's day", "name": "Eternal Sunshine of the Spotless Mind", "review": {"@type": "Review", "author": {"@type": "Person", "name": "MovieAddict2016"}, "dateCreated": "2004-06-02", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0338013/"}, "name": "\"Eternal Sunshine of the Spotless Mind\" is a bizarre but wonderful movie, a very strange and remarkably tender experience.", "reviewBody": "\"How happy is the blameless vestal's lot! The world forgetting, by the world forgot. Eternal sunshine of the spotless mind! Each pray'r accepted, and each wish resign'd.\" - Alexander Pope\n\nMichel Gondry's \"Eternal Sunshine of the Spotless Mind\" is a bizarre but wonderful movie, a very strange and remarkably tender experience, which I suppose is only to be expected from screenwriter Charlie Kaufman, the man behind \"Being John Malkovich.\"\n\nThe film was produced by Focus Features (\"Lost in Translation,\" \"21 Grams\"), a company which strives to offer original, quality films to the true cinema lovers. If the company keeps producing films this good, they may become hugely successful in the future, if not already.\n\nThe previews portrayed the movie as a bouncy, cheery comedy in the vein of \"Adaptation,\" the last film written for the big screen by Charlie Kaufman, when it is really a tender movie about love and romance. This is Jim Carrey's best performance to date, and may open the eyes of his prejudiced haters who have only imagined him as Ace Ventura and a certain cable guy for his entire career. No snippy quotes, outrageous humor or bizarre antics in \"Sunshine\" -- Carrey plays a true, realistic, three-dimensional character named Joel Barrish, who plans to have memories of his girlfriend, Clementine (Kate Winslet), erased by a new company called Lacuna, after he discovers that she herself has had the procedure performed only a week before. Joel meets with the company's founder, Dr. Howard Mierzwiak (Tom Wilkinson), and is informed that the procedure -- although \"technically\" brain damage -- is on par with a heavy night of drinking. \"Nothing you'll miss much,\" he is told, as he plunges into a bizarre world of long forgotten memories.\n\nThe entire process of the operation is quite fascinating, really, if a bit reminiscent of an idea founded by none other than one of Kaufman's favorite writers, Philip K. Dick, who wrote the source short story for the Ah-nuld movie \"Total Recall.\" All items relating to the person you want erased from your brain are assembled together, and the technicians at Lacuna (Mark Ruffalo and Elijah Wood) then \"map\" an outline of your memories, which are supposedly stemmed together. I have my doubts about the seriousness and remote possibility of such a procedure being performed, and the explanation is quite simply utter bull, but we don't care because the entire erasing of Joel's memories serves as a backdrop for a deeper meaning: If you could forget about past romances, would you really want to? And if so, would you be willing to sacrifice all the good ones, along with the bad ones?\n\nThe conclusion that \"Sunshine\" arrives at is, to be totally truthful, as honest as can be. During the procedure, Joel's subconscious realizes that it doesn't want to let go of its memories of Clementine, and so begins a strange labyrinth of fragmented memories, constantly changing surroundings, and mental materializations of Clementine. The movie is like a very bizarre dream, when you're trying to interact with people, but they're not responding, and you shout and try to get their attention but they don't seem to notice. Joel's entire odyssey of the interior of his mind makes \"Being John Malkovich\" look normal -- but as I didn't like \"Malkovich\" very much, and thought its strangeness was unjustified, it fits perfectly in \"Sunshine\" -- there are some great special effects, such as when Joel is wandering through his own memories, drifting in and out of sleep, hearing the voices of the technicians erasing his memories and watching as objects and areas around him vanish and deconstruct. It's so bizarre but yet also so beautiful. Gondry was a former music video director (his complete works are available on DVD) and he is the perfect candidate for this project, having worked with Kaufman before on the 2001 flop \"Human Nature.\" It seems that he has finally found a unique directing style that ties in perfectly with the underlying themes of the movie.\n\nThere is a very deep message in \"Sunshine,\" and it is arguably Kaufman's deepest film to date. Love and romance and memories of both have rarely been examined as thought-provokingly and tenderly as they are in this wonderful motion picture. The movie has a very profound message that all viewers should pay attention to. There are many small intricacies in the film, surely picked up on more thoroughly on repeat viewings, and the entire construction of the movie is completely enthralling and intelligent. I saw two people leave the rather empty theater during the screening I attended. It tanked in the US and I predict it will do the same in the UK, which is a shame, because this is the smartest film of 2004 and has the most to say about our lives than any other film this year. While everyone flocks to see the new Denzel Washington action movie, \"Eternal Sunshine of the Spotless Mind\" is forgotten, which is quite depressing -- people would rather spend their money on forgettable entertainment than view something unique that has something important at its core.\n\nI think what the movie finally asks us after its long, emotional journey, is would we want our own memories erased? And if so, what would the consequences be? A lesser film might examine this idea poorly -- \"Sunshine\" is not. It is perfect in almost every conceivable way, and anyone who complains that it is not original must be joking -- in my entire lifetime, this is one of the most unique film experiences I have ever had.\n\n\"Eternal Sunshine of the Spotless Mind\" is a beautiful movie, eloquently voiced by Gondry, firmly constructed and rooted in an eerie nightmarish fantasy land where anything is possible. It's beautiful, it's bizarre, it's exceptional, it's funny, it's lovely, it's touching, it's witty, and it's one of the best movies I have ever seen.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "10", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "Trailer", "embedUrl": "/video/imdb/vi2292515097", "name": "Eternal Sunshine of the Spotless Mind", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTA4YjQ5ZjEtMGQ4Mi00NWExLTkxMGQtNzAwYzVmNTU1ODJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTA4YjQ5ZjEtMGQ4Mi00NWExLTkxMGQtNzAwYzVmNTU1ODJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "uploadDate": "2008-04-11T14:01:47Z"}, "url": "/title/tt0338013/"}