{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0944947/", "name": "Game of Thrones", "image": "https://m.media-amazon.com/images/M/MV5BYTRiNDQwYzAtMzVlZS00NTI5LWJjYjUtMzkwNTUzMWMxZTllXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_.jpg", "genre": ["Action", "Adventure", "Drama", "Fantasy", "Romance"], "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm3592338/", "name": "Emilia Clarke"}, {"@type": "Person", "url": "/name/nm0227759/", "name": "Peter Dinklage"}, {"@type": "Person", "url": "/name/nm3229685/", "name": "Kit Harington"}, {"@type": "Person", "url": "/name/nm0372176/", "name": "Lena Headey"}], "creator": [{"@type": "Person", "url": "/name/nm1125275/", "name": "David Benioff"}, {"@type": "Person", "url": "/name/nm1888967/", "name": "D.B. Weiss"}, {"@type": "Organization", "url": "/company/co0008693/"}, {"@type": "Organization", "url": "/company/co0335036/"}, {"@type": "Organization", "url": "/company/co0167350/"}, {"@type": "Organization", "url": "/company/co0231672/"}, {"@type": "Organization", "url": "/company/co0343278/"}], "description": "Game of Thrones is a TV series starring Emilia Clarke, Peter Dinklage, and Kit Harington. Nine noble families fight for control over the lands of Westeros, while an ancient enemy returns after being dormant for millennia.", "datePublished": "2011-04-17", "keywords": "based on novel,dragon,politics,queen,nudity", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1679428, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "9.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0944947/"}, "author": {"@type": "Person", "name": "Jschool03"}, "dateCreated": "2011-04-18", "inLanguage": "English", "name": "Finally, a Show that stays true to it's written roots", "reviewBody": "As an avid reader, I am often disappointed by what is represented by the silver screen. I initially get excited to see one of my favorite series on the big screen, and eventually walk away disgusted. For whatever reason, most shows and movies that are based on epic book series absolutely butcher the original content. \n\nSo when I saw the preview for \"Game of Thrones\" on HBO, I was immediately skeptical. Oh, I was going to watch it, but I didn't have high expectations. I did hold a little hope because HBO is known for their high quality shows. \n\nI was absolutely shocked to watch the Pilot and realize that it followed the book almost to perfection. The language that is used by the actors is very similar to the way that it was written in the book, and events were not skipped. It stayed very true to the story without adding to it or removing from it. \n\nThe acting is superb and I actually felt like I was looking into Winterfell for the first time. I feel like I've actually got faces to add to the characters that I've been reading about for a long time. \n\nIf you have not read the books, you may feel as though the blatant sexuality is an addition from HBO to add some spice to the series. This is not the case at all. The books contained all of the sexuality that is shown in the Pilot. I am very proud of HBO for producing an amazingly accurate product. I will be watching every week for sure. \n\nIf you enjoyed what you saw in the Pilot, know that there are many other plot twists and action filled evenings to come. \"Game of Thrones\" has a ton of potential to be one of the greatest series that has ever been produced. I would highly recommend it to fans of the series and newcomers alike.\n\nUPDATE:\n\nI have now watched 3 Episodes and I wanted to come back and report some more. Even after 3 Episodes, the series is staying true to the written story. Overall the acting is still very good. I hate to watch a show that makes it look like the actors are reading a script. I don't get this impression with this HBO adaptation. \n\nEach episode of this series leaves me itching for the next weekend. I really hate watching shows in real time because I enjoy absorbing several hours of a show at one time. But, a good show will keep you looking forward to it the whole week. \n\nA special note to viewers that have not read the books... Keep watching! This series has numerous twists and turns and full of epic battles and action. It may seem like it's taking a little while to develop, but the reward is well worth the wait. \n\nEven after 3 episodes, I would still highly recommend this to anyone.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "trailer": {"@type": "VideoObject", "name": "Season 8, Episode 6 Preview", "embedUrl": "/video/imdb/vi3672620057", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWU5YTUzYmQtNWRkOS00MmQyLWEzYzAtN2UyOTA2ZTM3N2EyXkEyXkFqcGdeQXZ3ZXNsZXk@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWU5YTUzYmQtNWRkOS00MmQyLWEzYzAtN2UyOTA2ZTM3N2EyXkEyXkFqcGdeQXZ3ZXNsZXk@._V1_.jpg", "description": "Watch the trailer for the final episode of \"Game of Thrones.\"", "uploadDate": "2019-05-13T03:06:22Z"}, "EntryURL": "https://www.imdb.com/title/tt0944947", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Game-of-Thrones", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Game-of-Thrones/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Game-of-Thrones/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Game-of-Thrones/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Game-of-Thrones/thumb.jpg"}