{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt3619204/", "name": "Human Revolution", "image": "https://m.media-amazon.com/images/M/MV5BM2U1OWNkZjMtZjM4ZC00Y2YwLWE3OWItNGJjOThmNGRkYjVlXkEyXkFqcGdeQXVyNDE4OTY5NzI@._V1_.jpg", "genre": ["Short", "Action"], "actor": [{"@type": "Person", "url": "/name/nm6379108/", "name": "Bayardo Cesar Ampie"}, {"@type": "Person", "url": "/name/nm1282524/", "name": "Juan Bofill"}, {"@type": "Person", "url": "/name/nm4754557/", "name": "Shayna Bofill"}, {"@type": "Person", "url": "/name/nm2546327/", "name": "Liannet Borrego"}], "director": {"@type": "Person", "url": "/name/nm2332084/", "name": "Moe Charif"}, "creator": [{"@type": "Person", "url": "/name/nm2332084/", "name": "Moe Charif"}, {"@type": "Organization", "url": "/company/co0475436/"}], "description": "Human Revolution is a short starring Bayardo Cesar Ampie, Juan Bofill, and Shayna Bofill. Based on the video game Deus Ex: Human Revolution (2011), the film dives into the world of Adam Jensen, a Sarif Industries' security...", "datePublished": "2014-03-25", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 241, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3619204/"}, "author": {"@type": "Person", "name": "bob the moo"}, "dateCreated": "2014-03-27", "inLanguage": "English", "name": "All surface, but it works very well at that level", "reviewBody": "Although I have never played the game on which this is based and am therefore not really target audience, I did look at it when it came out as it looked like my sort of game. So in terms of being able to say how loyal it is to the game in terms of story or experience, I'm not the guy for that since I watched it as a standalone film. As such the film is very much about the superficial aspects as it tells a story about a woman being held while an augmented man tries to rescue her from the tight security around her captors – a large man and a psychotic augmented female assassin.\n\nThe film opens with the striking image of a woman on a table and in a very nicely done set, has a tense standoff between the two. It is very well done and it sets the tone that the rest of the film will follow, which is that the visuals, design and delivery will be the all – the plot and specifics you don't really need to know. As someone not connected to the game, I appreciated that I guess for players the plot will fit well, but for me it still had plenty to offer. Although it is all very much about the surface level qualities, the film makes this work because it does these very well indeed. The sets are crisp and well done, costumes and makeup are very impressive and generally it all looks and feels the part.\n\nThe filming adds to this by being very impressive; OK the action sequences are not groundbreaking in their technique, but for a short fan film it is really good (albeit with Machinima's support). The cast are not great actors but they fit visually, whether it be the punky violence of E'Orio, the striking physique and presence of Borrego or the slickness of Charif (cheeky devil, taking the lead in his own film). The visual effects are very impressive and generally they go on top of everything else to make the short feel much more expensive than it is.\n\nThe running time is about right since the focus is on the superficial and it works very well on this level with great effects, sets, style and tone. It may be a fan-film but there is enough cool slickness here to draw in those who have never touched the game."}, "duration": "PT12M", "EntryURL": "https://www.imdb.com/title/tt3619204", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Human-Revolution", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Human-Revolution/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Human-Revolution/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Human-Revolution/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Human-Revolution/thumb.jpg", "EntryAdded": "2015-02-07"}