{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2545118/", "name": "Blackfish", "image": "https://m.media-amazon.com/images/M/MV5BNTkyNTkwMzkxMl5BMl5BanBnXkFtZTcwMzAwOTE2OQ@@._V1_.jpg", "genre": ["Documentary", "News"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm5747280/", "name": "Tilikum"}, {"@type": "Person", "url": "/name/nm5747284/", "name": "Dave Duffus"}, {"@type": "Person", "url": "/name/nm5747281/", "name": "Samantha Berg"}, {"@type": "Person", "url": "/name/nm5747282/", "name": "Dean Gomersall"}], "director": {"@type": "Person", "url": "/name/nm1363250/", "name": "Gabriela Cowperthwaite"}, "creator": [{"@type": "Person", "url": "/name/nm1363250/", "name": "Gabriela Cowperthwaite"}, {"@type": "Person", "url": "/name/nm1492515/", "name": "Eli B. Despres"}, {"@type": "Person", "url": "/name/nm6041096/", "name": "Tim Zimmermann"}, {"@type": "Organization", "url": "/company/co0397226/"}, {"@type": "Organization", "url": "/company/co0436711/"}], "description": "Blackfish is a movie starring Tilikum, Dave Duffus, and Samantha Berg. A documentary following the controversial captivity of killer whales, and its dangers for both humans and whales.", "datePublished": "2013-10-18", "keywords": "shark attack,sea,footage,marine park,marine", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 59989, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2545118/"}, "author": {"@type": "Person", "name": "thejoshl"}, "dateCreated": "2013-07-20", "inLanguage": "English", "name": "Hearing a harsh critique of SeaWorld only seems right coming from the people it meant the most to.", "reviewBody": "Without a doubt Blackfish is one of the most horrific theatre experiences you'll have this year. Director Gabriela Cowperthwaite presents a very carefully constructed case on the effects of inhumane treatment of Orcas in captivity. The one-sided argument is that the untimely human deaths caused by captive Orcas were not their fault but rather the fault of their captors; SeaWorld, and the evidence proving this point is so disturbing and so shockingly obvious that it's no wonder SeaWorld refused to be interviewed.\n\nThe story centers on Tilikum, a 12,000 lbs. Orca that is directly responsible for the death of 3 people, including Dawn Brancheau the former senior trainer at SeaWorld in Orlando. The film explores the reasoning behind the likely \"psychosis\" Tilikum has experienced in captivity, and the disgusting cover up executives have tried to make.\n\nWhile SeaWorld naturally refused to be interviewed, the films perspective mostly derives from former trainers/employees of SeaWorld and other various experts. Their experience working with Orcas - most having dedicated their lives to it - is truly heart breaking. Presenting the theory, the evidence and finally a solution to the topic at hand, Blackfish is a marvellous story that will have you as tearful as the trainers that sincerely care for the well being of the creatures.\n\nBlackfish doesn't just show a bunch of disgruntled former employees bashing SeaWorld either. The greatest technique employed in this film is its use of footage from shows featuring these trainers when they were younger. There's something so mesmerizing about watching the smiling young trainers play with their best friend while hearing their older self reminisce in voice over. Hearing a harsh critique of SeaWorld only seems right coming from the people it meant the most to.\n\nWhile we've always known Orca's are intelligent creatures Cowperthwaite dedicates a lot of the film to demonstrating their capacity for emotions as well; watching them over time build connections with their trainers and each other. So by the time they show us their capture and captivity and witness the pain felt the whales, Tilikum especially, we know that their violent behavior is a direct result of SeaWorld. Killer Whales having never harmed a human in the wild.\n\nI want to go through every point made by the movie but I won't. You need to see this for yourselves. The facts aren't what drive this film, the emotion behind them do. This is one of those movies you just won't stop talking about, and for the subject matter that's the best compliment it can receive. In the end sharing this information is what's going to help these Orcas.\n\nBetween the gripping footage and the distressing stories Blackfish effectively proves its point. There are very few movies like this; a must-see. There is no way after seeing this movie that you'll ever want to go to SeaWorld again, and for the sake of the animals that's the only thing we can do for them. Since it's made quite clear; the only thing affecting their decision-making is: how many Shamu dolls and tickets they've sold.\n\nOur Rating:10/10\n\nLet me know on Twitter @thejoshl what you thought of Blackfish!", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H23M", "trailer": {"@type": "VideoObject", "name": "Theatrical Trailer", "embedUrl": "/video/imdb/vi3228149273", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTcxOTA0MTk3MF5BMl5BanBnXkFtZTgwMTIzMDcyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTcxOTA0MTk3MF5BMl5BanBnXkFtZTgwMTIzMDcyMzE@._V1_.jpg", "description": "Notorious killer whale Tilikum is responsible for the deaths of three individuals, including a top animal trainer. Blackfish shows the sometimes devastating consequences of keeping such intelligent and sentient creatures in captivity.", "uploadDate": "2013-06-04T14:03:13Z"}, "EntryURL": "https://www.imdb.com/title/tt2545118", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Blackfish", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Blackfish/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Blackfish/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Blackfish/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Blackfish/thumb.jpg"}