{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Don-Jon", "EntryURL": "https://www.imdb.com/title/tt2229499", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Don-Jon/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Don-Jon/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Don-Jon/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Don-Jon/thumb.jpg", "actor": [{"@type": "Person", "name": "Joseph Gordon-Levitt", "url": "/name/nm0330687/"}, {"@type": "Person", "name": "Scarlett Johansson", "url": "/name/nm0424060/"}, {"@type": "Person", "name": "Julianne Moore", "url": "/name/nm0000194/"}, {"@type": "Person", "name": "Tony Danza", "url": "/name/nm0001103/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 224212, "ratingValue": "6.5", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Joseph Gordon-Levitt", "url": "/name/nm0330687/"}, {"@type": "Organization", "url": "/company/co0179337/"}, {"@type": "Organization", "url": "/company/co0301807/"}, {"@type": "Organization", "url": "/company/co0415835/"}, {"@type": "Organization", "url": "/company/co0236721/"}], "datePublished": "2013-09-19", "description": "Don Jon is a movie starring Joseph Gordon-Levitt, Scarlett Johansson, and Julianne Moore. A New Jersey guy dedicated to his family, friends, and church, develops unrealistic expectations from watching porn and works to find...", "director": {"@type": "Person", "name": "Joseph Gordon-Levitt", "url": "/name/nm0330687/"}, "duration": "PT1H30M", "genre": ["Comedy", "Drama", "Romance"], "image": "https://m.media-amazon.com/images/M/MV5BMTQxNTc3NDM2MF5BMl5BanBnXkFtZTcwNzQ5NTQ3OQ@@._V1_.jpg", "keywords": "sex,watching porn,pornography,husband wife relationship,pornography addict", "name": "Don Jon", "review": {"@type": "Review", "author": {"@type": "Person", "name": "eschetic-2"}, "dateCreated": "2013-10-06", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2229499/"}, "name": "Solid, hard to define indie satire which will make some very uncomfortable - EXCELLENT first directorial effort!", "reviewBody": "Defining what kind of film this is had to be the hardest part of getting DON JON made, but ultimately it was worth it! It isn't really a \"guy\" film even though *technically* it tries to look at sex from a guy's perspective. It may actually best be called a \"chick\" flick, but one they would see alone rather than with a date. At the screening I saw, ALL the raucous laughter was coming from very obviously female voices - falling out of their chairs laughing over what they viewed as stereotypical male behavior - and even as the supposed \"10\" played by Scarlett Johansson reveals herself to be the kind of demanding (insert the word for a female canine here) who a very stupid - make that excessively immature - straight boy (like the one played with supreme élan by author/director Gordon-Levitt) would make a fool of himself over! \n\nThe film heavily satirizes stereotypical straight New Jersey Catholics - the easily offended of which should probably stay away along with anyone who expects a slick date night romantic comedy that doesn't require them to THINK - but it IS a beautifully structured and polished first directorial effort and very funny in its way. Man or woman though, it is not your usual DATE film to see with the opposite sex. The litmus scene for the film was probably when Johansson (Barbara) confronts Gordon-Levitt (Jon) over watching porn! Foolishly trying to evoke simple reason, he (accurately) tells her that \"EVERY guy watches porn - and that anyone who says he doesn't is lying.\" The theatre got absolutely quiet there for a moment in any section where dates were sitting, as each side wondered what the other was thinking. What YOU may think in that scene will determine a lot about how you view and react to the film. You may enjoy it regardless of what you think of that (for the film) core issue, but you sure won't want to see it with anyone who you can't comfortably talk about it with.\n\nThe \"home\" scenes with Jon's family and Barbara's are probably excess baggage, but they give the central characters broad context (the broadest performance in a very stylized film is probably Tony Danza's performance as Jon's father) - and set up the one totally human moment in the film when Jon's silent sister defines what a good sibling should be when she finally has a line! Ultimately, there is one unexpected, rational woman (Julianne Moore giving a remarkable imitation of Susan Sarandon!) who Jon meets in the night class Barbara insists he take who not only \"gets\" him but broadens his horizons for the kind of growth any central character in a good film must have.\n\nDon't expect a pat happy ending or a cheap thought-free throw away comedy (and DON'T make it first date material with someone you don't know yet!), and the open minded will have a wonderful time. My take-away image is really of a few years ago at the first Broadway preview of a Tony winning musical called AVENUE Q. Just before it started, a student of mine at the university where I teach came over to introduce his mother who was seeing the show too, sitting in front of each other all the way over at the side. Midway through the show there was a very funny, very outrageous musical number called \"You Can Be As Loud As You Want\" (When You're making Love). I glanced over to see how my student and his mother were taking it and, as you can imagine, my student, sitting in front of his mother, was sinking onto the floor with embarrassment. What he *couldn't see* was his mother rocking with laughter both at the insouciance of the number and her son's embarrassment! I think my mother (who, as far as I know, probably doesn't approve of pornography) or my minister would be howling with laughter at DON JON too - but they probably wouldn't want anyone they knew to see them doing so.\n\nRecommended - but with noted reservations.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "7", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "Watch a TV spot for Don Jon.  A New Jersey guy dedicated to his family, friends, and church, develops unrealistic expectations from watching porn and works to find happiness and intimacy with his potential true love.", "embedUrl": "/video/imdb/vi2483071257", "name": "TV Spot", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjI1ODg1MDI1NV5BMl5BanBnXkFtZTgwOTI5NjkyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjI1ODg1MDI1NV5BMl5BanBnXkFtZTgwOTI5NjkyMzE@._V1_.jpg", "uploadDate": "2013-08-27T03:19:34Z"}, "url": "/title/tt2229499/", "EntryAdded": "2013-12-17"}