{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2229499/", "name": "Don Jon", "image": "https://m.media-amazon.com/images/M/MV5BMTQxNTc3NDM2MF5BMl5BanBnXkFtZTcwNzQ5NTQ3OQ@@._V1_.jpg", "genre": ["Comedy", "Drama", "Romance"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0330687/", "name": "Joseph Gordon-Levitt"}, {"@type": "Person", "url": "/name/nm0424060/", "name": "Scarlett Johansson"}, {"@type": "Person", "url": "/name/nm0000194/", "name": "Julianne Moore"}, {"@type": "Person", "url": "/name/nm0001103/", "name": "Tony Danza"}], "director": {"@type": "Person", "url": "/name/nm0330687/", "name": "Joseph Gordon-Levitt"}, "creator": [{"@type": "Person", "url": "/name/nm0330687/", "name": "Joseph Gordon-Levitt"}, {"@type": "Organization", "url": "/company/co0179337/"}, {"@type": "Organization", "url": "/company/co0301807/"}, {"@type": "Organization", "url": "/company/co0415835/"}, {"@type": "Organization", "url": "/company/co0236721/"}], "description": "Don Jon is a movie starring Joseph Gordon-Levitt, Scarlett Johansson, and Julianne Moore. A New Jersey guy dedicated to his family, friends, and church, develops unrealistic expectations from watching porn and works to find...", "datePublished": "2013-09-19", "keywords": "sex,watching porn,pornography,husband wife relationship,pornography addict", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 224225, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2229499/"}, "author": {"@type": "Person", "name": "MikeM1984"}, "dateCreated": "2013-12-23", "inLanguage": "English", "name": "A 10 for the message if nothing else...", "reviewBody": "(Somewhat Spoiler-y) I've dated an older woman, and in a lot of ways she tried to tell me the same things Esther tells Jon. In fact I remember a few distinctly similar interactions, so on that level the movie really spoke to me.\n\nI imagine one could say the movie relies on some clichés, just enough to satisfy the romance/comedy genre, but it uses them in very unique ways to tell a story that at least seems a little more real. Sort of like 500 Days (of Summer) on steroids. No pun intended. In fact it may be even safe to say that Don Jon is the next chapter in the 500 Days saga, albeit with a different character. Perhaps one made cynical by the events of JGL last romance comedy outing.\n\nDon Jon has graduated beyond puppy love, certainly, and onto full blown adult fun. But the movie is very biting, and sort of tears apart his self-serving agenda.\n\nA lot of people seem to be caught up in the \"porn\" aspect of the movie, but honestly the \"porn\" is a metaphor, no more important to the gym-tan-laundry-sexualized commercials.\n\nThere are only two real female characters in the film: Esther, and Jon's quiet-except-for-one-powerful-line sister. The sister in fact almost makes the movie, as they use her small character to incredible effect.\n\nThe movie does a nice job of tricking the audience into rooting for Jon and Barbara, of course it's all a ploy. They even set up Esther as a sort of antagonist. She is enticing yet feels all wrong for Jon. Older, sort of run down, maybe a bit of a predator of weak men, the movie isn't very clear about her at the start. She runs completely counter to the stereotypes of women as set up by the film. She is far from perfect, but Moore makes her believably beautiful. I truly doubt many other actresses could've sold this role in the way she did. While her age played right into the character she probably was right for the character for mostly other reasons.\n\nI don't think the movie is overall that outstanding. Many of the jokes fall flat, and some of it is tedious. In fact the vast majority of it could be considered filler, but the end is so incredible it does a great job of tying all these scenes together in a way that makes perfect sense and delivers a powerful message. Without completely ruining it the end embraces the typical cliché, but flips it on it's head. What results is a very mature version of what audiences have come to expect from these types of movies. The same, but also very different.\n\nI would expect JGL will have continued success as a Director and actor.\n\nThe guy truly gets it.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H30M", "trailer": {"@type": "VideoObject", "name": "TV Spot", "embedUrl": "/video/imdb/vi2483071257", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjI1ODg1MDI1NV5BMl5BanBnXkFtZTgwOTI5NjkyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjI1ODg1MDI1NV5BMl5BanBnXkFtZTgwOTI5NjkyMzE@._V1_.jpg", "description": "Watch a TV spot for Don Jon.  A New Jersey guy dedicated to his family, friends, and church, develops unrealistic expectations from watching porn and works to find happiness and intimacy with his potential true love.", "uploadDate": "2013-08-27T03:19:34Z"}, "EntryURL": "https://www.imdb.com/title/tt2229499", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Don-Jon", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Don-Jon/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Don-Jon/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Don-Jon/thumb.jpg", "EntryAdded": "2013-12-17"}