{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0354899/", "name": "La science des rêves", "image": "https://m.media-amazon.com/images/M/MV5BMTg3NTcxNzY5NV5BMl5BanBnXkFtZTcwODk5NTQzMQ@@._V1_.jpg", "genre": ["Comedy", "Drama", "Fantasy", "Romance"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0305558/", "name": "Gael García Bernal"}, {"@type": "Person", "url": "/name/nm0001250/", "name": "Charlotte Gainsbourg"}, {"@type": "Person", "url": "/name/nm0591877/", "name": "Miou-Miou"}, {"@type": "Person", "url": "/name/nm0149260/", "name": "Alain Chabat"}], "director": {"@type": "Person", "url": "/name/nm0327273/", "name": "Michel Gondry"}, "creator": [{"@type": "Person", "url": "/name/nm0327273/", "name": "Michel Gondry"}, {"@type": "Organization", "url": "/company/co0309685/"}, {"@type": "Organization", "url": "/company/co0178269/"}, {"@type": "Organization", "url": "/company/co0044140/"}, {"@type": "Organization", "url": "/company/co0028557/"}, {"@type": "Organization", "url": "/company/co0093477/"}, {"@type": "Organization", "url": "/company/co0025719/"}, {"@type": "Organization", "url": "/company/co0106448/"}], "description": "La science des rêves is a movie starring Gael García Bernal, Charlotte Gainsbourg, and Miou-Miou. A man entranced by his dreams and imagination is love-struck with a French woman and feels he can show her his world.", "datePublished": "2006-08-16", "keywords": "dream,dream world,neighbor,boyfriend girlfriend relationship,giant hand", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 66890, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0354899/"}, "author": {"@type": "Person", "name": "oneloveall"}, "dateCreated": "2007-02-04", "inLanguage": "English", "name": "An inventive joy with a wicked undertone", "reviewBody": "Michel Gondry, the visually creative giant behind some of MTV's most stylistically innovative music videos, and more recently the driving force behind his and script writer extraordinare Charlie Kaufman's brilliant Eternal Sunshine of the Spotless Mind, finally makes his solitary debut, choosing to write and direct this surrealist tale of dreams, reality, and the lines some people walk between them. Fans of the visual virtuoso must have been anticipating Gondry's official declaration as auteur for some time, having salivated for a decade now as this French director continually pushed the envelope for lucky musicians.\n\nI'm sure many saw The Science of Sleep as a proving ground that would help fans see if the eccentric director would be able to parlay all of these visually creative aspects into a more cohesive, cinematic experience. By and large, the dangerously imaginative movie succeeds on it's own, though there are a few discrepancies to note. First, it does feel that much of the way the movie is shot, in particular the scenes which stay most grounded in reality, do mimic a lot of the production values that gave Eternal Sunshine such a realistically detached value to it. Ditto with much of the stream-of-consciousness script, at times heavily emulating the flow Gondry and Kaufman helped pioneer the first time around. The actual plot is decidedly low-key, and for good reason, though at times Gondry does struggle to fill all of his microcosms with relevance. To say these values remain derivative and do not completely complement the whimsically dark storytelling taking place here though, would be to forsake the fantastic and singular joy that the Science of Sleep is.\n\nRegardless of it's constant French avant-garde noodling, and despite the obvious parallels to Gondry's previous film, Science remains a near-masterwork, punctuated by the intoxicating rhythm of it's perceptive dream sequences, often edited with the most keen of intentions. Whether viewers will stay immersed throughout the fantasy bleed-in will be up to ones subjective threshold, and ones ability to thrive off of the magically deranged pacing that hints at underlying psychological relevance. Gondry's masterful pacing does not disappoint, culminating with the brilliant evolution of the script's supremely playful tone into something much more serious.\n\nOf course, the sincere material would only be at home when recited by actors of a pure heart, and in this Gondry also excels by casting two leads who do everything they can to involve us in the realist fantasy. Gael García Bernal, always doing well to pick good material, finally slips into an English language role with the ease I would expect, and the luminous yet subdued Charlotte Gainsbourg radiates the earthly kind of magic that this film is all about. People with strict objective agendas stay clear, anyone else who still uses an inkling of their imagination, please dive in. It may not be perfect, but Science is surely one of the most unique and perceptive fantasies to merge with the mass consciousness in years.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H45M", "trailer": {"@type": "VideoObject", "name": "The Science of Sleep", "embedUrl": "/video/imdb/vi4260954393", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjVkNDlkY2YtN2UzMi00NDlkLThhNzUtZDQwZDk1ODg4YWNiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjVkNDlkY2YtN2UzMi00NDlkLThhNzUtZDQwZDk1ODg4YWNiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Home Video Trailer from Warner Home Video", "uploadDate": "2008-04-11T17:09:52Z"}, "EntryURL": "https://www.imdb.com/title/tt0354899", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Science-Of-Sleep", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Science-Of-Sleep/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Science-Of-Sleep/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Science-Of-Sleep/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Science-Of-Sleep/thumb.jpg"}