{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Mind-Job", "EntryURL": "https://www.imdb.com/title/tt2312832", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Mind-Job/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Mind-Job/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Mind-Job/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Mind-Job/thumb.jpg", "actor": [{"@type": "Person", "name": "Matthew Moore", "url": "/name/nm0601599/"}, {"@type": "Person", "name": "Krew Boylan", "url": "/name/nm1812345/"}, {"@type": "Person", "name": "Lorna Lesley", "url": "/name/nm0504047/"}, {"@type": "Person", "name": "Paul Barry", "url": "/name/nm0058124/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 33, "ratingValue": "7.8", "worstRating": "1.0"}, "creator": {"@type": "Person", "name": "JJ Winlove", "url": "/name/nm4142695/"}, "description": "The Mind Job is a short starring Matthew Moore, Krew Boylan, and Lorna Lesley. When nice guy Zac finds his deepest fantasies inadvertently appearing on a computer screen in front of his girlfriend and a policewoman, he has little...", "director": {"@type": "Person", "name": "JJ Winlove", "url": "/name/nm4142695/"}, "duration": "PT16M", "genre": ["Short", "Comedy", "Romance"], "image": "https://m.media-amazon.com/images/M/MV5BNjFkODI2NmYtMGY0MC00M2YwLWFiYzAtODE4OTczNTg4ZGFiXkEyXkFqcGdeQXVyMjEzMDIyMDY@._V1_.jpg", "name": "The Mind Job", "review": {"@type": "Review", "author": {"@type": "Person", "name": "bob the moo"}, "dateCreated": "2014-06-01", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2312832/"}, "name": "A long walk to a rather obvious joke – too little spread too thin", "reviewBody": "A couple witness a crime and, although it all happened so quickly, the police do have new technology which allows memories to be accessed and reviewed on a computer even if the person's actual recollection is shady. Izzy goes first but unfortunately her view is blocked, which means it is Zac's turn. Unfortunately for some reason a lot of his memories of the event appears to have been blocked or moved to some other portion of his mind. As the scientists begin to piece it together, it is clear that Zac is not going to come out of this well at all.\n\nIn case it is not immediately obvious from the plot device of \"accessing the memories of a couple\", the replay of the \"event\" from Izzy's point of view very early in the film will rapidly bring you up to speed since the woman being robbed happens to have an ample chest. So about 2 or 3 minutes into this 16 minute short, we already know that the joke will be that men can't help but perving over other woman and, while innocent, it never looks good when caught. As you expect this joke then gets played out in a way where it really doesn't have much humor to it, nor does it do much clever with it. Ultimately, no matter what part of the film we are in, the joke will be the same and when it was only slightly amusing at the start, this is not a good thing to stretch it out.\n\nThere are interesting ideas in here and I liked the comparison between the content of a man's thoughts and the contents of his porn folder on his computer, but this wasn't really explored or made the most of. Instead the same joke repeats and it does so in a surprisingly flat manner. Moore, Boylan, Lesley and Barry don't really have great comic delivery and the direction doesn't help them as it feels too slow and poorly paced. As a single-sentence pitch the idea sounds okay, but the running time is far, far too much for it and ultimately I found it obvious early on, leaving only boredom to set in as it kept doing the same joke again and again. Perhaps others will love it, but for me it was too simplistic and crude, lacking in actual laughs and a case of too little spread too thinly."}, "url": "/title/tt2312832/", "EntryAdded": "2013-12-25"}