{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0113677/", "name": "Living in Oblivion", "image": "https://m.media-amazon.com/images/M/MV5BN2U2MDdjZjUtMGU1Ni00MzlkLTllZWQtZmJjNzJmYjE5YjAxXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg", "genre": ["Comedy", "Drama"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000114/", "name": "Steve Buscemi"}, {"@type": "Person", "url": "/name/nm0001416/", "name": "Catherine Keener"}, {"@type": "Person", "url": "/name/nm0000551/", "name": "Dermot Mulroney"}, {"@type": "Person", "url": "/name/nm0903272/", "name": "Danielle von Zerneck"}], "director": {"@type": "Person", "url": "/name/nm0001139/", "name": "Tom DiCillo"}, "creator": [{"@type": "Person", "url": "/name/nm0001139/", "name": "Tom DiCillo"}, {"@type": "Organization", "url": "/company/co0066819/"}, {"@type": "Organization", "url": "/company/co0001698/"}], "description": "Living in Oblivion is a movie starring Steve Buscemi, Catherine Keener, and Dermot Mulroney. This ultimate tribute to all independent filmmakers takes place during one day on the set of a non-budget movie.", "datePublished": "1995-07-21", "keywords": "neo screwball comedy,looking at oneself in a mirror,1990s,filmmaking,filmmaker", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 15847, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0113677/"}, "author": {"@type": "Person", "name": "Quinoa1984"}, "dateCreated": "2005-10-05", "inLanguage": "English", "name": "One of the most entertaining films about film-making ever made", "reviewBody": "Steve Buscemi may or may not have been the first choice by writer/director Tom DiCillo for the lead role of Nick, the director behind the three (err, one) film(s) being made within the film Living in Oblivion, but it works so well it's impossible to see anyone else in the role. Buscemi, who is one of the prime character actors of the past fifteen years, has that range of being grounded, of being out of control, of being funny, and of being sincere even in the strangest circumstances. His character, as the quintessential indie film director of the film, tries to keep some control on what goes on, but as is seen, things don't go quite as planned.\n\nLiving in Oblivion is one of those little delights for a film buff to see, or perhaps of a particular film buff. On a personal level I connect with some of this as I was a production assistant on indie films that were not far off from this. DiCillo, whether or not you've been in situations like this (which most of us haven't) brilliantly captures the coldness on a set, the uncomfortableness, the technical difficulties, and just the plain old emotional toll that goes on with the film-making process (notably, when it's under a million dollars being made). That it's a comedy of errors helps a lot, and that you never really know which way the story will turn at times. The film is split up in three acts, the first (for me) being the strongest and most affecting, as Nick tries to direct Catherine Keener's Nicole Springer in a heartfelt talk with her mother. Multiple takes bring on more woes, until Nick finally snaps (one of the funniest scenes perhaps in any film from the 90's). The other two segments come closer to being as great, one being a slick scene involving a buff man and Nicole, and the other being a very strange dream that has some kinks to work out.\n\nI've seen this film now several times, and the first time my enjoyment was more in the surface comedy of it all, and of course the performances. But with each passing view I get more and more what film-making, and what makes 'indie films' or just films in general, so appealing- there's drama, but there has to be some humor to get in the seams; there's romance, but not always in the ways you'd expect; when it's realer, more power to it. The ending also, while maybe the weaker part of the film, is still charming, and gives an idea as to what pleasures can come from such chaos on the set. I love it.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H30M", "trailer": {"@type": "VideoObject", "name": "Living In Oblivion", "embedUrl": "/video/imdb/vi111870233", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BODMxZjg5Y2MtMGZiNS00NzE0LTg1ZDAtN2ZiYzM5OTk5ZGM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODMxZjg5Y2MtMGZiNS00NzE0LTg1ZDAtN2ZiYzM5OTk5ZGM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Theatrical Trailer from Sony Pictures Classics", "uploadDate": "2008-04-11T14:19:55Z"}, "EntryURL": "https://www.imdb.com/title/tt0113677", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Living-in-Oblivion", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Living-in-Oblivion/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Living-in-Oblivion/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Living-in-Oblivion/thumb.jpg", "EntryAdded": "2013-02-25"}