{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt3722332/", "name": "The Nightly Show with Larry Wilmore", "image": "https://m.media-amazon.com/images/M/MV5BMzgxZTE2NDAtMzk4ZC00ZGJkLTgyNTktZDlhYWFmOTM0OTRlXkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_.jpg", "genre": ["Comedy", "News", "Talk-Show"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm0932831/", "name": "Larry Wilmore"}, {"@type": "Person", "url": "/name/nm1526338/", "name": "Mike Yard"}, {"@type": "Person", "url": "/name/nm1088947/", "name": "Rory Albanese"}, {"@type": "Person", "url": "/name/nm2021857/", "name": "Holly Walker"}], "creator": [{"@type": "Person", "url": "/name/nm0829537/", "name": "Jon Stewart"}, {"@type": "Organization", "url": "/company/co0176273/"}], "description": "The Nightly Show with Larry Wilmore is a TV series starring Larry Wilmore, Mike Yard, and Rory Albanese. A late night satirical talk show hosted by Larry Wilmore.", "datePublished": "2015-01-19", "keywords": "satire", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 2805, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3722332/"}, "author": {"@type": "Person", "name": "spacewars"}, "dateCreated": "2015-09-25", "inLanguage": "English", "name": "Awkward, irritating and one-dimensional", "reviewBody": "I really, _really_ wanted to like this show, as a longtime TDS/Colbert viewer who generally enjoyed Wilmore as the TDS \"Chief Black Correspondent\". I think at this point it's fair to say I've given Wilmore's show more than a fair shot, but here's the problem: He just doesn't have today's mandatory combination of comedic brilliance, broad-based political gravitas and plain old charisma to pull off a show of his own in this genre. Granted, the Stewart/Colbert/Maher/Oliver axis have set the bar for this kind of host extremely high. However, the fact remains that Wilmore was a poor choice to fill Colbert's old time slot, as he simply isn't broadly-based or, well, funny enough to carry it off. This fundamental weakness is exacerbated by the fact that his writers and panel guests (who are all too often the same people) range from tiresome to downright terrible, and the sameness of the show's content (\"Black issues! Finally, we're getting a vehicle with which to give them the attention they deserve!\") is so oppressively (sorry) relentless, day in and day out, that the end result is unwatchable. At least in its current incarnation, this is essentially a predictable, one-note show, hosted by a guy who, while clearly a talented writer, just doesn't have enough scope to fill the suit here. I really wish he was better at what he's trying to do than he is, because the truth is, we could really do with the perspective of a truly sophisticated black comedian/writer who genuinely is in the same talent stratum as Stewart/Colbert/Maher/Oliver; it would be refreshing and necessary. Trouble is, Wilmore ain't that guy. Now, I've seen some people jump in here in a very reactionary way, complaining about the torrent of negative reviews, with the basic thesis of \"stop criticizing Larry, it's early days, give him time! Look how Stewart was in the beginning!\" Sorry kids, but this doesn't hold water. Stewart was indeed a bit awkward at the start, but the evidence of his brilliance and sharp intellect was there from the beginning, despite the ill-fitting suits. Wilmore, however, has far more fundamental deficiencies, and sadly, they're of the sort that can't be fixed with superficial mid-season tweaks.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "1"}}, "EntryURL": "https://www.imdb.com/title/tt3722332", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Nightly-Show-with-Larry-Wilmore", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Nightly-Show-with-Larry-Wilmore/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Nightly-Show-with-Larry-Wilmore/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Nightly-Show-with-Larry-Wilmore/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/The-Nightly-Show-with-Larry-Wilmore/thumb.jpg", "EntryAdded": "2015-01-22"}