{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Union-The-Business-Behind-Getting-High", "EntryURL": "https://www.imdb.com/title/tt1039647", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Union-The-Business-Behind-Getting-High/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Union-The-Business-Behind-Getting-High/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Union-The-Business-Behind-Getting-High/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Union-The-Business-Behind-Getting-High/thumb.jpg", "actor": [{"@type": "Person", "name": "Adam Scorgie", "url": "/name/nm1886635/"}, {"@type": "Person", "name": "Chris Bennett", "url": "/name/nm2470901/"}, {"@type": "Person", "name": "Steve Bloom", "url": "/name/nm2295862/"}, {"@type": "Person", "name": "Renee Bojee", "url": "/name/nm5173656/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 7581, "ratingValue": "8.2", "worstRating": "1.0"}, "creator": [{"@type": "Person", "name": "Brett Harvey", "url": "/name/nm1622441/"}, {"@type": "Person", "name": "Adam Scorgie", "url": "/name/nm1886635/"}, {"@type": "Organization", "url": "/company/co0308225/"}], "datePublished": "2007-06-08", "description": "The Union: The Business Behind Getting High is a movie starring Adam Scorgie, Chris Bennett, and Steve Bloom. BC's illegal marijuana trade industry has evolved into a business giant, dubbed by some involved as 'The Union',...", "director": {"@type": "Person", "name": "Brett Harvey", "url": "/name/nm1622441/"}, "duration": "PT1H44M", "genre": "Documentary", "image": "https://m.media-amazon.com/images/M/MV5BMTYyNjk5NDI1NV5BMl5BanBnXkFtZTcwOTk1NDU0NA@@._V1_.jpg", "keywords": "cannabis,business,marijuana,weed,september 11 2001", "name": "The Union: The Business Behind Getting High", "review": {"@type": "Review", "author": {"@type": "Person", "name": "Midnight_Gypsi"}, "dateCreated": "2010-07-29", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1039647/"}, "name": "A real eye-opener", "reviewBody": "I'm not a pot smoker. In fact, I've never even tried it. People tend to always assume I'm a complete pothead; especially when first meeting me. My good friends and I now just all agree that I must have a pothead's personality or something, heh.\n\nJust maybe about a year ago, give or take, I was completely against the good stuff. I still believed what I had \"learned\" in D.A.R.E., telling me that you could overdose from your first puff (seriously, our police guy told us this, lol). I thought it was more likely to cause lung cancer, proved to kill braincells, would make me mentally disabled, become self-destructive, etc. I thought that weed was as bad as heroin, simply because I was constantly hearing about how bad it is and how it'll screw your life up. I mean, I honestly thought that people who wanted medicinal marijuana just wanted to get stoned - thankfully, I know better now.\n\nMy opinion starting changing about about a year ago, when I read an article that suggested that weed could actually help treat a physical disability my mother suffers with. This made me curious, and I quickly began doing a ton of research. Eventually, I decided to watch \"The Union\" after seeing a few people comment about it being a great documentary to get information from.\n\nBy the time I watched it, I was already turning towards pro-marijuana legalization, and this documentary helped me get over any doubt. They give a lot of information, and information that is worth knowing. Looking back to a year ago, before starting my research and before watching the documentary, I can't believe how ignorant I was. I can't believe the stereotypes and judgements I held while completely misinformed.\n\nNow, I know better. I'm not a pot smoker; I've never even touched it, but to me, that just shows that it doesn't take a complete pothead to realize that it should be made legal. Now, when I get the chance, I correct people's statements and misinformations about marijuana and I've provided several people with better information and I've recommended this very documentary to a few people.\n\nI think the main reason I held such hatred towards the plant before being properly informed was because when my older sister was a teen, she became very self-destructive and caused a lot of drama and pain within the family, and at that time she did get caught smoking weed, and I associated her behaviour with it.\n\nMy mom, who also used to be completely dead-set against weed, is not as against it as before since I've given her information. Although she's not willing on trying it yet and still a little sceptical, she's much more open to the possibility of trying to get a doctor's recommendation for it than she would've been otherwise. She would qualify for it, and it's legal here if you've got a doctor's recommendation. I want to get her to watch this (and a couple other documentaries, but mostly this one) in hopes that she'll at least give it a go and hopefully be able of decreasing her medication intake (She needs to take a lot on a daily basis, some of which seem kinda sketchy.)\n\nSo in conclusion, I recommend this to anyone and everyone; it's a real eye-opener and very informative.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "10", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "Trailer for The Union: The Business Behind Getting High", "embedUrl": "/video/imdb/vi327260185", "name": "The Union: The Business Behind Getting High", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGFiNTM5YmYtNGJjMC00NjZjLThmZjMtOGQ5ZWJjODk2NTJkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGFiNTM5YmYtNGJjMC00NjZjLThmZjMtOGQ5ZWJjODk2NTJkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "uploadDate": "2010-12-16T06:31:54Z"}, "url": "/title/tt1039647/"}