{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1124037/", "name": "Free State of Jones", "image": "https://m.media-amazon.com/images/M/MV5BMTA4NTYyMTcwNTFeQTJeQWpwZ15BbWU4MDI0NTg0MDkx._V1_.jpg", "genre": ["Action", "Biography", "Drama", "History", "War", "Western"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000190/", "name": "Matthew McConaughey"}, {"@type": "Person", "url": "/name/nm1813221/", "name": "Gugu Mbatha-Raw"}, {"@type": "Person", "url": "/name/nm0991810/", "name": "Mahershala Ali"}, {"@type": "Person", "url": "/name/nm0005392/", "name": "Keri Russell"}], "director": {"@type": "Person", "url": "/name/nm0002657/", "name": "Gary Ross"}, "creator": [{"@type": "Person", "url": "/name/nm0002657/", "name": "Gary Ross"}, {"@type": "Person", "url": "/name/nm0366989/", "name": "Leonard Hartman"}, {"@type": "Person", "url": "/name/nm0002657/", "name": "Gary Ross"}, {"@type": "Organization", "url": "/company/co0316867/"}, {"@type": "Organization", "url": "/company/co0506124/"}, {"@type": "Organization", "url": "/company/co0235528/"}, {"@type": "Organization", "url": "/company/co0018471/"}], "description": "Free State of Jones is a movie starring Matthew McConaughey, Gugu Mbatha-Raw, and Mahershala Ali. A disillusioned Confederate army deserter returns to Mississippi and leads a militia of fellow deserters and women in an uprising...", "datePublished": "2016-06-24", "keywords": "civil war,american civil war,shot in the head,pocket watch,man carrying a man", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 48964, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1124037/"}, "author": {"@type": "Person", "name": "anthonyleewatkins"}, "dateCreated": "2016-07-04", "inLanguage": "English", "name": "A true story about the muddiness of Southern Bravery and Corruption and the disheartening Truth about Race and Racism", "reviewBody": "FREE STATE OF JONES, A REVIEW AND A COUPLE OF ASIDES\n\nMy father grew up in Soso, Mississippi. My mother passed away in January of this year. So when the movie came out, and he said he thought he would like to see it, I offered to go with him. He liked that, so today, on my parents 62nd wedding anniversary, which we did not mention, but I am certain was on his mind as much as mine, we went.\n\nThe Movies of Lake Worth is in a little strip shopping center out near the Florida Turnpike. It was nice that I could pull up near the curb and let my 84 year old father out with his walker. Nicer still that the walk to the theater where it was showing was the first door inside. The rows were spacious so he could even push the walker in front of him, and we sat.\n\nMy father has often talked about the Knight N___gs, of course being an old white man from Mississippi, he uses the word. Funny thing, he doesn't use the \"N-word\" in conversation, but i guess because the community held the Knights in a \"Special\" place, this was the title he knows to call them by. He recently told me that his mother, born in 1910 was picking black berries or strawberries and she and her family stopped at the Knight house to get water. That was apparently the only time anyone in his family had anything to do with the Knights.\n\nThe movie does a good job of not sugar coating anything, from the battlefield scenes to the trial for interracial marriage (shades of the gay marriage struggle in Mississippi today), to the killings of both white and black folks. The saddest part of the story is how a handful of runaway slaves helped Newton and then many more whites, but in all too common southern white fashion, the white folks, when the war was over and the deserters were safe, they turned on the blacks, even the ones who had saved their lives.\n\nI know the British, the Belgians, the Germans, and 100 other countries, including the US Army has been guilty of equally disappointing human behavior, but this is a story about my people. Some of the people on both sides of the story are probably my ancestors. I know some fought in the Civil War, as confederates. Some probably hid out in the swamp and then betrayed those who helped them when it was time to bring Mississippi out of the dark.\n\nThe movie doesn't shy away, it doesn't spare anybody. There are two things I wonder about though.\n\nKnight comes off as being nearly a saint. Maybe he was. Really, with the exception of Rachel and Moses, the Black folks don't have a lot of leadership. Again, maybe because of the times, they didn't, maybe it was understood the being Black and \"uppity\" was a good way to get killed. I just wonder if it was as much the brave smart white Newt, or if he took a bit of opportunity. Or, more likely, Hollywood has a big bankable white male star and they wanted to give him even more glory than the story had.\n\nI don't know. The whole Free State of Jones is a history so hard to find much truth in. In fact, Mississippi is a place to find much truth in. It is my birth state, but I find more heartache than joy in it. I enjoyed the time with my dad, and it was interesting to see some kind of truth about a bizarre piece of history we have a tangential connection to.\n\nMy father's only comment was, \"Some people say it was so bad back than, but it was.\" I think he is right about that.\n\nI was disappointed the theater 100% white people, and with the exception of a 20 something young man and woman who could have been his young mother or older girlfriend, everybody was closer to my dad's age than even my 56 years.\n\nIf you are interested in an unvarnished view of parts of American history that you may not know much about, go see the movie. It was well done. It might even be close to the truth.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT2H19M", "trailer": {"@type": "VideoObject", "name": "Trailer #2", "embedUrl": "/video/imdb/vi2267132953", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTc3NDQyNTg0NV5BMl5BanBnXkFtZTgwMzI1Mzk5ODE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTc3NDQyNTg0NV5BMl5BanBnXkFtZTgwMzI1Mzk5ODE@._V1_.jpg", "description": "As civil war divides the nation, a poor farmer from Mississippi leads a group of rebels against the Confederate army.", "uploadDate": "2016-05-24T15:22:55Z"}, "EntryURL": "https://www.imdb.com/title/tt1124037", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Free-State-of-Jones", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Free-State-of-Jones/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Free-State-of-Jones/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Free-State-of-Jones/thumb.jpg", "EntryAdded": "2016-09-14"}