{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0072562/", "name": "Saturday Night Live", "image": "https://m.media-amazon.com/images/M/MV5BY2YxODFmOGUtMjY1OC00YTk5LTlkNWEtMzU5MWYxNTgwNzkxXkEyXkFqcGdeQXVyODUxOTU0OTg@._V1_.jpg", "genre": ["Comedy", "Music"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm0661094/", "name": "Don Pardo"}, {"@type": "Person", "url": "/name/nm0681902/", "name": "Lenny Pickett"}, {"@type": "Person", "url": "/name/nm0358669/", "name": "Darrell Hammond"}, {"@type": "Person", "url": "/name/nm0860380/", "name": "Kenan Thompson"}], "creator": [{"@type": "Person", "url": "/name/nm0584427/", "name": "Lorne Michaels"}, {"@type": "Organization", "url": "/company/co0022762/"}, {"@type": "Organization", "url": "/company/co0129175/"}, {"@type": "Organization", "url": "/company/co0013731/"}, {"@type": "Organization", "url": "/company/co0065874/"}, {"@type": "Organization", "url": "/company/co0792689/"}, {"@type": "Organization", "url": "/company/co0098530/"}], "description": "Saturday Night Live is a TV series starring Don Pardo, Lenny Pickett, and Darrell Hammond. A famous guest host stars in parodies and sketches created by the cast of this witty show.", "datePublished": "1975-10-11", "keywords": "20th century,21st century,1970s,2000s,2010s", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 41380, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0072562/"}, "author": {"@type": "Person", "name": "faffadone"}, "dateCreated": "2006-08-25", "inLanguage": "English", "name": "Did the writers go on strike???", "reviewBody": "What was unique about \"NBC's Saturday Night\", in 1975, was that it brought back the ninety minute variety format-except for that now it was late night TV. \"Your Show of Shows\"(1950-54) was the previous comedy-variety 90 minute show. There were other regular 90 minute programs over the years, as well: boxing events in TV's earliest years, and later, late night TV(\"Tonight\", which would eventually become \"The Tonight Show\"), a dramatic anthology(\"Playhouse 90\"), cultural fare(\"Omnibus\"), westerns(\"The Virginian\", \"Cimarron Strip\"), an adventure series(\"Name of the Game\"), other sporting events, & a rotating detective 'movie'(NBC's Sunday Mystery Movie), all running 90 minutes. However, \"NBC's Saturday Night\" was, really, the heir to the Sid Caesar throne, so to speak. Since 1954, there hadn't been another comedy-variety show of such length.\n\nAlso, since the early days of live comedy and theater drama, there hadn't been a live television staple, pretty much since the early sixties. That all changed in October 1975. The writing was a bit biting: besides the standard continuing comedy sketches, there was political satire, too-often seen on the 'Weekend Update' news sketch, which was handled by regular Chevy Chase, and was reminiscent to earlier shows like \"That Was the Week That Was\" and \"The Smothers Brothers Comedy Hour\". There was a musical guest, sometimes a talent act, and a short film(comic filmmaker Albert Brooks started out here, and later, the 'Mr.Bill' shorts were a standard). To give an idea of the multitude of variety format, on the second broadcast, the guest host was singer Paul Simon, Albert Brooks offered one of his film shorts, the musical guests for the evening were Randy Newman and Phoebe Snow-with a special surprise by Simon and Art Garfunkel, and a sketch with Jim Henson's Muppets(Henson was trying to break out from under the weight of the kiddie programs \"Sesame Street\" and several 'family' specials). In that day, the regulars were tagged 'The Not-Ready-for-Primetime Players', and included Dan Aykroyd, John Belushi, and Chase(who were all, eventually, part of the writing staff, as well). The show was definitely unique, a breath of fresh air in the midst of a pop-culture takeover(similar in what was happening to cinema, as well, @ the time). \n\nOver the years, the show has gotten thru some tough times, but has never really seemed as challenging as in those early days. Perhaps this is the norm when something so unique and new becomes the common, but, it seems, that once the originals went their own ways, after having broken thru certain cultural taboos, their followers just seemed to be more set on breaking through the language(four letter words) & innuendo barriers. True, the writing was never perfect, and could be quite silly, in fact, even in those earliest days. However, much of it was satire handled like nothing else on TV at that time. It was often quite innovative and challenging. There have been times, actually, where the writing has gone beyond the late night standard(as in the late 80s-Dana Carvey, Phil Hartman, Jon Lovitz era-and, recently, with Tina Fey, Jimmy Fallon, Chris Parnell, Daryl Hammond, and Horatio Sanz), but, overall, it was more focused on the likes of adult diaper sketches and, like most TV-lots of sex. Now, the show has really never been short of good comics, but when it comes to the actual comedy, it's often been sub par. It's good to see that there actually are some brains behind the show, again, though. Except after so many years, does it really matter anymore? I mean, is it really the same cutting edge broadcast it was so many years ago, now with a vast budget and few surprises? The writing may be better, again, but where's the creativity gone? Ironically, with all the evidence available, maybe 'The Not-Ready-for-Primetime Players' were more ready than ever. -Concerned viewer", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "5"}}, "trailer": {"@type": "VideoObject", "name": "TONIGHT", "embedUrl": "/video/imdb/vi973192985", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjFiNDIwMGMtZWUxOS00Y2Q5LTkzNjEtMjgxMGZjZjU2MTVhXkEyXkFqcGdeQWFybm8@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjFiNDIwMGMtZWUxOS00Y2Q5LTkzNjEtMjgxMGZjZjU2MTVhXkEyXkFqcGdeQWFybm8@._V1_.jpg", "description": "Eddie Murphy returns to \"Saturday Night Live.\" Tonight!", "uploadDate": "2019-12-20T19:11:24Z"}, "EntryURL": "https://www.imdb.com/title/tt0072562", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Saturday-Night-Live", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Saturday-Night-Live/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Saturday-Night-Live/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Saturday-Night-Live/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Saturday-Night-Live/thumb.jpg"}