{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/This-Film-Is-Not-Yet-Rated", "EntryURL": "https://www.imdb.com/title/tt0493459", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/This-Film-Is-Not-Yet-Rated/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/This-Film-Is-Not-Yet-Rated/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/This-Film-Is-Not-Yet-Rated/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/This-Film-Is-Not-Yet-Rated/thumb.jpg", "actor": [{"@type": "Person", "name": "Kirby Dick", "url": "/name/nm0225269/"}, {"@type": "Person", "name": "Kimberly Peirce", "url": "/name/nm0005303/"}, {"@type": "Person", "name": "Darren Aronofsky", "url": "/name/nm0004716/"}, {"@type": "Person", "name": "Atom Egoyan", "url": "/name/nm0000382/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 27131, "ratingValue": "7.5", "worstRating": "1.0"}, "contentRating": "Unrated", "creator": [{"@type": "Person", "name": "Kirby Dick", "url": "/name/nm0225269/"}, {"@type": "Person", "name": "Eddie Schmidt", "url": "/name/nm0772907/"}, {"@type": "Person", "name": "Matt Patterson", "url": "/name/nm1121472/"}, {"@type": "Organization", "url": "/company/co0046530/"}, {"@type": "Organization", "url": "/company/co0144901/"}, {"@type": "Organization", "url": "/company/co0043107/"}, {"@type": "Organization", "url": "/company/co0163927/"}, {"@type": "Organization", "url": "/company/co0187965/"}], "datePublished": "2006-09-01", "description": "This Film Is Not Yet Rated is a movie starring Kirby Dick, Kimberly Peirce, and Darren Aronofsky. Kirby Dick's exposé about the American movie ratings board.", "director": {"@type": "Person", "name": "Kirby Dick", "url": "/name/nm0225269/"}, "duration": "PT1H38M", "genre": "Documentary", "image": "https://m.media-amazon.com/images/M/MV5BMTk0NDIwMDUxNl5BMl5BanBnXkFtZTcwMzY3MzIzMQ@@._V1_.jpg", "keywords": "sexuality,orgasm,homosexuality,mpaa,filmmaker", "name": "This Film Is Not Yet Rated", "review": {"@type": "Review", "author": {"@type": "Person", "name": "MaxBorg89"}, "dateCreated": "2006-08-23", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0493459/"}, "name": "Informative, cheeky and funny as hell!", "reviewBody": "Ever been curious about the American film rating system? Then Kirby Dick's This Film Is Not Yet Rated is perfect. It does to US censorship what Michael Moore has done to others: it makes everyone look like jackasses, mainly because that's what they really are.\n\nThe film explains pretty early on, through South Park-style animation, what kind of rating a movie can get in the USA: G, PG, PG-13, R or NC-17. The last certificate is the most unpleasant one, as a film with that classification won't get a proper distribution. And it's that particular rating that Dick wants to dissect.\n\nThis documentary is divided into three sections: the largest one sees various filmmakers (Kimberly Pierce, John Waters, Kevin Smith) revealing the problems they've experienced because of the American ratings board, the MPAA (Motion Picture Association of America). The second section features the director's efforts to uncover the identities of the film raters. You see, the MPAA is supposedly composed of average American parents, doing a fair job. Then how come no one knows who these people are? As the investigation continues, we learn that one board member doesn't even have kids, while several others' offspring are already adults. So what's really going on?\n\nThe last part of This Film Is Not Yet Rated focuses on Dick's own censorship trouble, a really interesting version of the movie-within-a-movie gimmick: he sent a rough cut of the documentary to the MPAA, receiving the dreaded NC-17 (since there's some footage coming from other NC-rated films), and so we get to see his frustration as he tries to appeal the controversial decision.\n\nThe best part of the film is the first one I mentioned, mainly because we get to know the rules of the game a bit better. Apparently, any kind of \"weird sex\" is not welcome: oral sex (Boys Don't Cry), threesomes(The Dreamers, American Psycho), gay stuff (Mysterious Skin, Where The Truth Lies), female masturbation (Jersey Girl, a PG-13 movie, almost got an R just because Liv Tyler talks about it)... the list is quite long. Of course, you're better off if your film is endorsed by a major studio. That's why a glimpse of Maria Bello's pubic hair got independent film The Cooler an NC-17, while Sharon Stone doing much more in the audience-baiting Basic Instinct was \"appropriate\" enough to receive an R. No wonder most filmmakers hate the MPAA! Hell, we even find out that Trey Parker and Matt Stone deliberately put distasteful material in Team America just to make fun of the ratings board.\n\nAnother \"funny\" thing is, the NC-17 is only used against sex. No one ever says anything about on-screen violence. In fact, any movie can have the highest body count ever, and be rated R. If there's no blood, it might even get a PG-13. As people point out, all other countries have the exact opposite attitude, condemning violence rather than sex (I know, from personal experience, that most films rated NC-17 in the US are usually classified \"15\" or \"16\" in Europe, while excessive violence tends to lead to an \"18\").\n\nAs someone wisely says in this hilarious, poignant opus, ratings don't really matter. If it's a film a lot of people want to see, no rating in the world can damage it. If it's a film few people want to see, then no rating in the world will save it. That might be true (although I don't necessarily agree: the huge success of The Passion of the Christ was largely due to the rating controversies), but this movie also made me realize that I would definitely not want to be a member of the MPAA. Their criteria are too weird for normal people to understand.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "9", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "Theatrical Trailer from IFC", "embedUrl": "/video/imdb/vi3958767897", "name": "This Film Is Not Yet Rated", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzgxYTliZmMtZjk1Zi00NGRkLWExMTgtMGUzMjExNDVmYjdlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzgxYTliZmMtZjk1Zi00NGRkLWExMTgtMGUzMjExNDVmYjdlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "uploadDate": "2008-04-11T16:57:37Z"}, "url": "/title/tt0493459/", "EntryAdded": "2013-06-30"}