{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0119925/", "name": "The Postman", "image": "https://m.media-amazon.com/images/M/MV5BNTAyYTFmYmUtNTFhZS00NGQxLWI0OGEtZDM2NDk1OGE4YzFmL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Action", "Adventure", "Drama", "Sci-Fi"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000126/", "name": "Kevin Costner"}, {"@type": "Person", "url": "/name/nm0001599/", "name": "Will Patton"}, {"@type": "Person", "url": "/name/nm0005478/", "name": "Larenz Tate"}, {"@type": "Person", "url": "/name/nm0931404/", "name": "Olivia Williams"}], "director": {"@type": "Person", "url": "/name/nm0000126/", "name": "Kevin Costner"}, "creator": [{"@type": "Person", "url": "/name/nm0109432/", "name": "David Brin"}, {"@type": "Person", "url": "/name/nm0744839/", "name": "Eric Roth"}, {"@type": "Person", "url": "/name/nm0001338/", "name": "Brian Helgeland"}, {"@type": "Organization", "url": "/company/co0012524/"}, {"@type": "Organization", "url": "/company/co0002663/"}], "description": "The Postman is a movie starring Kevin Costner, Will Patton, and Larenz Tate. A nameless drifter dons a postman's uniform and bag of mail as he begins a quest to inspire hope to the survivors living in post-apocalyptic America.", "datePublished": "1997-12-25", "keywords": "year 2043,year 2013,woman,worst picture razzie winner,character name as title", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 67106, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0119925/"}, "author": {"@type": "Person", "name": "fcfig"}, "dateCreated": "2004-11-30", "inLanguage": "English", "name": "Not as horrible as all that", "reviewBody": "\"The Postman\" is one of those films that has become almost synonymous with the concept of \"lousy, awful, horrible, terrible, stinking mess of a movie.\" Like \"Plan 9 from Outer Space,\" \"Ishtar,\" or \"Gigli,\" it is sometimes invoked in this manner on Internet message boards or in chatter between friends. But is \"The Postman\" truly such a horrible disaster? I would argue that its bad reputation is overdone.\n\nMake no mistake, this movie is no \"Citizen Kane.\" There is no way, by any stretch of the imagination, that this could be called a \"great\" movie. But every week B-movies that are orders of magnitude worse come out. What is it about this one that accounts for its enduring lousy reputation? This in itself is an interesting question.\n\nPart of the answer has to do with Kevin Costner. It is hard to imagine now, but at one time (especially in the wake of \"Dances with Wolves\") his reputation in Hollywood was towering and unassailable. Costner squandered his mega-star status with a series of expensive yet mediocre duds such as this one, and in the end \"The Postman's\" crime is not that it is a truly terrible movie, but that it is simply a not-great movie that deflated the public's hopes and expectations of what Kevin Costner film should be. The curse of too-high expectations. \n\nThe worst aspect of this movie is its occasional pomposity and self-importance, derived from Costner's own enormous mid-90s ego, and it is easy to laugh at the final scene or various dramatic sequences with swirling symphonic music and glistening slo-mo shots. But if you can get beyond this and look at the movie as just a somewhat entertaining way to pass a few hours, it really isn't that bad, especially if you are a fan of the \"dark future\" genre of films. Will Patton in particular provides a good, convincing performance, as do a number of other minor characters.\n\nAnd the world of \"The Postman\" -- a decayed, post-apocalyptic, decentralized\n\nAmerica where the federal government has collapsed -- is interesting in its own right. Remember, this film was borne of the early/mid 1990s, a time that gave us Timothy McVeigh, anti-government sentiment, Waco, and fear about \"militias.\" There was a sense in the air that America could possibly disintegrate and fragment into local areas battling each other in the long run. This world view seems very alien in the post-9-11 era, where there is much more of a consciousness of being an American, \"rallying around the flag,\" and the role of the federal government as a powerful military force, for good or for ill. Nowadays fear of outsiders and terrorism has largely replaced fears of internal anarchy and domestic unraveling. \"The Postman\" reminds us that not so long ago America envisioned its dark possible futures in a very different way than it currently does, and this in itself is instructive and worth pondering."}, "duration": "PT2H57M", "trailer": {"@type": "VideoObject", "name": "The Postman", "embedUrl": "/video/imdb/vi1861746969", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmJkNzUyYWMtMThjNy00NjZkLWIyOWEtYzg5YTk3MzYzODA2XkEyXkFqcGdeQWFybm8@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmJkNzUyYWMtMThjNy00NjZkLWIyOWEtYzg5YTk3MzYzODA2XkEyXkFqcGdeQWFybm8@._V1_.jpg", "description": "Home Video Trailer from Miramax", "uploadDate": "2008-04-11T17:03:30Z"}, "EntryURL": "https://www.imdb.com/title/tt0119925", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Postman", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Postman/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Postman/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Postman/thumb.jpg", "EntryAdded": "2013-02-23"}