{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0393109/", "name": "Brick", "image": "https://m.media-amazon.com/images/M/MV5BMTk4MjQzMzA2N15BMl5BanBnXkFtZTcwMTU2MzIzMQ@@._V1_.jpg", "genre": ["Action", "Crime", "Drama", "Mystery", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0330687/", "name": "Joseph Gordon-Levitt"}, {"@type": "Person", "url": "/name/nm0001305/", "name": "Lukas Haas"}, {"@type": "Person", "url": "/name/nm0211087/", "name": "Emilie de Ravin"}, {"@type": "Person", "url": "/name/nm0328709/", "name": "Meagan Good"}], "director": {"@type": "Person", "url": "/name/nm0426059/", "name": "Rian Johnson"}, "creator": [{"@type": "Person", "url": "/name/nm0426059/", "name": "Rian Johnson"}, {"@type": "Organization", "url": "/company/co0077650/"}], "description": "Brick is a movie starring Joseph Gordon-Levitt, Lukas Haas, and Emilie de Ravin. A teenage loner pushes his way into the underworld of a high school crime ring to investigate the disappearance of his ex-girlfriend.", "datePublished": "2006-04-07", "keywords": "neo noir,alley,cinderblock,neo noirish,hard boiled", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 99101, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0393109/"}, "author": {"@type": "Person", "name": "jaredmobarak"}, "dateCreated": "2006-07-22", "inLanguage": "English", "name": "\"Where do you eat lunch?\"", "reviewBody": "This is a film I have been highly anticipating for over a year. After first hitting the festival circuit in January of 2005 it went through the cycles, finally getting a stateside limited release at the end of March 2006. Buffalo, I ask you now to open your eyes to a masterpiece of cinema as Brick finally debuts at the Amherst Dipson.\n\nBrick is a not a film as much as a symphony where each instrument is tuned to the beat of the conductor. Each frame is carefully orchestrated and composed to perfection. The dialogue is metered and spoken with a contemporary Shakespearean beat. Writer/Director Rian Johnson has created poetry with his first feature length film. It may be tough to understand the lingo and overall speech used, but as the film advances you begin to know the characters and the words just make complete sense.\n\nWe open with the stare of our protagonist\u0097hard and piercing, yet on the verge of tears\u0097eyes slowly welling up as he peers down on a motionless body, facedown in a tunnel's steady, flowing stream. This is film noir at its best: wrong men and notorious women. Our leader into this underbelly of society has recently rolled on his boss to skate clean of a drug deal he was involved with. The cops allow this plea and decide to keep him in their pocket, with what happened as leverage. He stays low, nose clean, until an old love brings him into her world as it's spiraling out of control. Using all his resources around the city, he begins his search to find her and make sure she is OK. He does this for his own means, with a stoicism that hearkens back to Bogart's Sam Spade.\n\nWait\u0085Did I tell you that the city this is set in is a suburban high school? Johnson has flipped the genre on its head to brilliant effect. Brendan, our medium into the story, is played to perfection by Joseph Gordon-Levitt as a senior at the school who has alienated himself by ratting on his drug supplier. The vice-principal is using him to gain intel on the dealings around school, but Brendan will have none of it. He needs to find out what happened to his old flame Emily and see what she got involved in. Enlisting the help of a colleague, Brendan plays his enemies off each other to gain access to the mob boss and dope runner The Pin (\"I hear he's supposed to be old, like 26\"), whom Emily has wronged. The truth must be found at all costs, either to assuage some personal guilt, to rescue love, to do what's right, to get the bad guys, or maybe all the above. The search for answers leads to betrayal and secrets uncovered and I was there for the entire ride.\n\nBrick is not the 21st century's answer to Alan Parker's Bugsy Malone. This isn't a satire on mob life with children playing men. This is a reawakening of the genre, a subversion of what you expect of it, but played straight as a razor. None of these actors break character and lines like this, echoing a hardened criminal telling off an over-zealous officer, \"No more of these informal chats! If you have a disciplinary issue with me, write me up or suspend me and I'll see you at the Parent-Teacher conference,\" are delivered with straight faces and a piercing confidence. The wit is there and you will laugh to the seeming absurdity, but the weight of the story holds strong. Well-placed humor helps you realize the gravity of everything even more. \n\nLevitt shines in the role and proves to be the best up-and-coming actor of his generation. Following pitch-perfect turns as a violent teen in the wonderful Manic and as a teenage hustler, vagrant in Gregg Araki's disturbing yet unforgettable Mysterious Skin, Levitt is making bold choices and continues a great run with Brick. He is flanked with solid support from \"Lost's\" Emilie de Ravin as his lost love; Lukas Hass as The Pin, with loyalty straying muscle Noah Fleiss; Matt O'Leary's The Brain, Brendan's life-line to what's happening as he sinks deeper; and Nora Zehetner flawlessly playing the femme fatale which one can never be sure whether to trust. Also, the accompanying score of piano and brass jazz fits perfectly to the atmosphere, especially on a late scene close-up shot of Levitt and Zehetner\u0097faces close- up, lips with an atom of air between them, and a single tear slowly following down the contours of her face\u0097uncannily mimicking the infamous shot of Bogart and Bergman in Casablanca.\n\nAny cinephile with $8 to spend will regret missing an opportunity to see this film. If you love film noir of the 50's, 60's, and 70's check Brick out while you can. Doubtful that it will stay up more than 2 or 3 weeks, it will be coming to DVD on August 8th, however go out and see this gem. It will not be everyone's cup of tea, but whether you love it or not, it holds a place on the timeline of cinema as an experiment in stripping down the essence of noir and showing it in a new and no longer angelic world of children on the cusp of adulthood. \"Here's looking at you kid.\"", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H50M", "EntryURL": "https://www.imdb.com/title/tt0393109", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Brick", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Brick/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Brick/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Brick/thumb.jpg", "EntryAdded": "2013-03-30"}