{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2752724/", "name": "Money for Nothing: Inside the Federal Reserve", "image": "https://m.media-amazon.com/images/M/MV5BMjEzODY5MzQ4OF5BMl5BanBnXkFtZTgwNTcxMDMwMDE@._V1_.jpg", "genre": ["Documentary", "History", "News"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0000630/", "name": "Liev Schreiber"}, {"@type": "Person", "url": "/name/nm1352862/", "name": "Paul Volcker"}, {"@type": "Person", "url": "/name/nm5908572/", "name": "Janet Yellen"}, {"@type": "Person", "url": "/name/nm5908554/", "name": "Peter Atwater"}], "director": {"@type": "Person", "url": "/name/nm1088762/", "name": "Jim Bruce"}, "creator": {"@type": "Person", "url": "/name/nm1088762/", "name": "Jim Bruce"}, "description": "Money for Nothing: Inside the Federal Reserve is a movie starring Liev Schreiber, Paul Volcker, and Janet Yellen. Nearly 100 years after its creation, the power of the U.S. Federal Reserve has never been greater. Markets and...", "datePublished": "2013-09-06", "keywords": "economic history,economic power,loan,investment,currency", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 866, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2752724/"}, "author": {"@type": "Person", "name": "jasonray-82834"}, "dateCreated": "2015-07-16", "inLanguage": "English", "name": "Essentially the FED made a documentary about the FED", "reviewBody": "This was very disappointing. Every talking head and expert in this \"documentary\" have a vested interest in the continuation of the FED. This does not equate to a well rounded documentary, this is what we call propaganda kids. It's like Monsanto making a \"cutting edge no holds bar\" documentary about...well...Monsanto. \n\nThe blatant fraud of the Fed can be seen in it's name: It's no more federal than Federal Express and it has no reserves, it just prints all the money it wants without any accountability or backing. A federal Reserve note (dollar bill) has no more significance than if I printed a dollar from my computer. This worthless money is then loaned to our government at a 6% interest rate and we pay the bill.! There is no ballot measure that we voted on, there is no say what-so-ever from the people, the government can borrow all they want from the FED and have no accountability to the people. How in the hell does this make it good for the people?! They create money out of thin air and charge interest from it! That's fraud! \n\nThe president of the US does in fact choose who runs the Fed, but guess what the film \"forgot\" to mention? The Fed gives the president a list of people to choose from! Ha! Bet you didn't know that? \n\nThe Federal Reserve is far more harmful than this documentary makes it out to be. \n\nThe FED can single handedly crush our entire system if they wanted to, think about it. Why would this EVER be a good thing. It's no different then the medieval kings back in Europe. \n\n\"If the American people ever allow private banks to control the issue of their currency, first by inflation, then by deflation, the banks and corporations that will grow up around them will deprive the people of all property until their children wake up homeless on the continent their Fathers conquered...I believe that banking institutions are more dangerous to our liberties than standing armies... The issuing power should be taken from the banks and restored to the people, to whom it properly belongs.\" -Thomas Jefferson-\n\nThe Fed also prints money out of thin air then lends it to dozens of counties around the world through organizations such as the International Monetary Fund and the World Bank. This creates a massive inflation cycle and an outrageous bill for the American tax payers children to pay back when other countries default. Inflation is a tax, make no mistake about it. If your dollar is worth 20 cents less than it was it's no different than an increase of income tax by 20%. The only difference is, borrowing from the FED is not out in the open like an income tax, it's in the background and mostly all Americans never catch onto this. Since the creation of the Federal Reserve System, 90%!! of our dollar has been eaten away by inflation! \n\n\"Permit me to issue and control the money of a nation, and I care not who makes its laws!\"\n\nOh and another thing, the 12 member banks of the FED creates no safeguards against centralization. They are simply franchises of the same owner. All rules and regulations are passed down from the top (the Federal Reserve bank of New York). They are only there as an illusion of a non centralized bank, think about it; can the Federal Reserve bank in San Francisco issue a different interest rate than the one in NY? Of course not, they're all attached and they all act in unison. \n\nEveryone should look into The Bank of North Dakota, the only state-owned bank in the nation. They have no debt and have been unbelievably successful. This is the direction we need to head, we should obey and respect the 10th amendment and decentralize almost everything, let states take back what rights they use to have. This is the point of the United STATES was it not? Independent states that can independently succeed on their own. Do we really want this country to turn into The United Federation of America, a country without independent states who's sole rule maker comes from Washington DC? I don't.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "1"}}, "duration": "PT1H44M", "trailer": {"@type": "VideoObject", "name": "Money for Nothing: Inside the Federal Reserve", "embedUrl": "/video/imdb/vi1354349337", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzFjN2ZhYmEtZDg5NS00MTE2LWEzMmEtODE0MTU1MTZmMWE2XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzFjN2ZhYmEtZDg5NS00MTE2LWEzMmEtODE0MTU1MTZmMWE2XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg", "description": "Trailer for Money for Nothing: Inside the Federal Reserve", "uploadDate": "2018-05-16T17:13:27Z"}, "EntryURL": "https://www.imdb.com/title/tt2752724", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve/thumb.jpg", "EntryAdded": "2016-09-14"}