{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2752724/", "name": "Money for Nothing: Inside the Federal Reserve", "image": "https://m.media-amazon.com/images/M/MV5BMjEzODY5MzQ4OF5BMl5BanBnXkFtZTgwNTcxMDMwMDE@._V1_.jpg", "genre": ["Documentary", "History", "News"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0000630/", "name": "Liev Schreiber"}, {"@type": "Person", "url": "/name/nm1352862/", "name": "Paul Volcker"}, {"@type": "Person", "url": "/name/nm5908572/", "name": "Janet Yellen"}, {"@type": "Person", "url": "/name/nm5908554/", "name": "Peter Atwater"}], "director": {"@type": "Person", "url": "/name/nm1088762/", "name": "Jim Bruce"}, "creator": {"@type": "Person", "url": "/name/nm1088762/", "name": "Jim Bruce"}, "description": "Money for Nothing: Inside the Federal Reserve is a movie starring Liev Schreiber, Paul Volcker, and Janet Yellen. Nearly 100 years after its creation, the power of the U.S. Federal Reserve has never been greater. Markets and...", "datePublished": "2013-09-06", "keywords": "economic history,economic power,loan,investment,currency", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 866, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2752724/"}, "author": {"@type": "Person", "name": "classicalsteve"}, "dateCreated": "2015-02-14", "inLanguage": "English", "name": "How the Fed was Also Largely Responsible for the Financial Collapse of 2008", "reviewBody": "One of the best documentaries I've seen demonstrating how the role of the Federal Reserve contributed to the Financial Crisis of 2008. In the wake of the financial collapse of 2008 creating a Recession which could have led to another Great Depression, a lot of blame was leveled against Investment Banks who were vilified as being greedy, particularly Lehman Brothers and Bear-Stearns, and insurance companies like AIG who undertook too many credit default swaps. The financial banks had taken on nearly as much debt as their assets, particularly in sub-prime mortgages, and AIG had insured them against default, i.e. \"default swaps\". When Lehman went bankrupt, AIG owed trillions of dollars in insurance against default, which nearly brought down the financial system.\n\nNow, while Lehman and Bear-Stearns share plenty of the blame in the recent crisis, these bad debts and faulty reliance on sub-prime mortgages were not solely private sector malfeasance. A US department agency also played a crucial role: The US Federal Reserve. The US Federal Reserve (\"The Fed\") since Alan Greenspan became Fed Chairman in the late 1980's under then President Ronald Reagan engaged a more \"hands-off\" policy in terms of financial regulation and at the same time allowed much more loan money to be acquired by these private financial institutions who in turn bought into risky investments. This documentary outlines why the Fed was created in the first place, its role over the years in terms of both regulating and stimulating financial markets and what it did and didn't do to contribute to the recent financial collapse. While I don't believe the Fed was solely responsible for the financial collapse, as suggested by the film, their policy approaches were vital as one of many contributing factors which created a financial \"perfect storm\".\n\nTwo of the leading characters whose roles were crucial in the Fed's policy-making in this unfolding drama were the two Fed Chairmen Alan Greenspan (1987-2006) and Ben Bernanke (2006-2014). Greenspan in particular was touted as a financial guru who understood financial markets better than a Super Bowl winning football coach understands how to get first downs and touchdowns. If Greenspan didn't know the answer to an aspect of the financial market, the question itself must be flawed, or so went the conventional wisdom for nearly 30 years. To his credit, Greenspan had steered the US economy through several storms. What he didn't know was that a financial hurricane was descending upon Wall Street.\n\nOver and over, Greenspan had opportunities to regulate aspects of the financial markets, particularly the so-called credit default swap insurance policies, issued by the likes of AIG and others. He also could have reigned in loose lending practices. Once, early on as Fed Chairman, Greenspan hinted the stock market may be spiraling out of control, but was quickly vilified by Wall Street for his remarks. Since then, during much of his tenure, he took a position of deregulation in which \"the market will figure it out\" approach so prevalent in Conservative politics. Ben Bernanke, who is a self-described scholar of the Great Depression, also didn't see the financial collapse coming. In several interviews prior to the beginning of the collapse, Bernanke iterates the impossibility of a national drop in housing prices. His scholarship for some reason precluded him from seeing the coming crisis, first in terms of the bursting housing bubble, then the ensuing financial crisis which was spawned as a result.\n\nWhile scholars have debated and will continue to do so over the next century over the reasons for the financial crisis, several things are clear about the Recession. The Fed contributed to the collapse with certain policies, greed does not necessarily regulate itself, and no single individual can know everything about every aspect of the market. At the ensuing congressional hearings which Congress called after the collapse, Greenspan admitted the flaws of his policies. He said he assumed that financial institutions would always make the best decisions which would be in the interest of their companies. The reality is, just like everything else in a complex modern world, the private sector cannot always be counted on to make the best of decisions, be it for their companies or the worldwide economy. The Fed has a role to play in at least helping to thwart a possible crisis in the future. That role is always endlessly debated by politicians, congressmen, financiers, advisers and occasionally scholars. Let's hope the financiers won't always get 100% of their desires.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H44M", "trailer": {"@type": "VideoObject", "name": "Money for Nothing: Inside the Federal Reserve", "embedUrl": "/video/imdb/vi1354349337", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzFjN2ZhYmEtZDg5NS00MTE2LWEzMmEtODE0MTU1MTZmMWE2XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzFjN2ZhYmEtZDg5NS00MTE2LWEzMmEtODE0MTU1MTZmMWE2XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg", "description": "Trailer for Money for Nothing: Inside the Federal Reserve", "uploadDate": "2018-05-16T17:13:27Z"}, "EntryURL": "https://www.imdb.com/title/tt2752724", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Money-for-Nothing-Inside-the-Federal-Reserve/thumb.jpg"}