{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt3099498/", "name": "Tusk", "image": "https://m.media-amazon.com/images/M/MV5BNmQyMmUzMmYtMTA4OS00ZmRjLWE0NWYtNjc0ZGM0N2E4YzQ5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Comedy", "Drama", "Horror"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0519043/", "name": "Justin Long"}, {"@type": "Person", "url": "/name/nm0662981/", "name": "Michael Parks"}, {"@type": "Person", "url": "/name/nm0005286/", "name": "Haley Joel Osment"}, {"@type": "Person", "url": "/name/nm1270009/", "name": "Genesis Rodriguez"}], "director": {"@type": "Person", "url": "/name/nm0003620/", "name": "Kevin Smith"}, "creator": [{"@type": "Person", "url": "/name/nm0003620/", "name": "Kevin Smith"}, {"@type": "Organization", "url": "/company/co0326257/"}], "description": "Tusk is a movie starring Justin Long, Michael Parks, and Haley Joel Osment. A brash and arrogant podcaster gets more than he bargained for when he travels to Canada to interview a mysterious recluse... who has a rather disturbing...", "datePublished": "2014-09-19", "keywords": "walrus,canada,search,deception,mansion", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 44448, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3099498/"}, "author": {"@type": "Person", "name": "brando647"}, "dateCreated": "2015-08-20", "inLanguage": "English", "name": "#WalrusYes -- Kevin Smith Has Gone Insane (and it's Wicked Fun)", "reviewBody": "I am biased in the realm of Kevin Smith movies so, for the record, my thoughts on TUSK are probably going to be a little more forgiving that what I believe is the general consensus (this movie gotten beaten down on Rotten Tomatoes). I've been a fan of Kevin Smith for years and I know I'll always give his movies a chance. Since the completion of his Jersey series (the Jay/Silent Bob era), his movies have certainly been hit and miss. None have been able to recapture the same level of fun but many have come close. TUSK is one of them. I love the Smith has reached a point where he's not trying to reach general audiences, opting instead to make movies for his existing fans. He's not afraid to go wild with a bizarre idea if it sounds like it could be fun. TUSK is the first film in what will be a trilogy of films set in Canada and opens with our introduction to Wallace Bryton (Justin Long). Wallace is a podcaster with his best friend Teddy (Haley Joel Osment), living a successful life of producing his zany web show and failing to be faithful to his beautiful long-time girlfriend Ally (Genesis Rodriguez). He sets off alone into a remote area of Manitoba for an interview bit and finds a story in the mysterious Howard Howe (Michael Parks). Howard has lived a life of adventure and wishes to share his tale of sailing the sea, meeting Ernest Hemingway, and forming a friendship with a walrus on a deserted island\u0085.\n\nTUSK is a horror/comedy but it really struggles to fully function in either capacity. It finds a decent balance and I thought it was a weird, fun movie but it's never all that scary or funny enough. This isn't much of an issue for me because the movie's insane premise keeps it interesting and the performances, particularly Michael Parks, are so well done. The biggest problem with TUSK is actually the main character, Wallace. Not the performance; Justin Long does an awesome job. The actual character. Wallace is thoroughly unlikable. He's dismissive of his girlfriend and early scenes show how little he cares about her outside the bedroom. He proudly brags about his infidelities to his best friend/fellow podcaster Teddy, and he's got no moral qualms with taking advantage of others for the sake of producing his show. He's crude, self- centered, and arrogant and, when he finds himself in a horrifying situation, I had zero sympathy for him. Go ahead, Mr. Howe. Wallace deserves it; he already lacks any humanity. So right there, the movie is lacking suspense because I don't care what happens to our protagonist. I care more about Ally and Teddy who, despite how much of a jerk Wallace is, still rush off to Canada to find him when they learn he's in trouble. The real star (and most people seem to agree) is Michael Parks. His raving zealot character in Smith's RED STATE has got nothing on Howard Howe. He gets to go full- blown lunatic in TUSK. He starts off seemingly harmless: an old man in an electric wheelchair with a flair for elegant (if awkward) speech and a desire to share his stories with an interested party. But soon he drops the pretense, reveals his true self, and goes off the chain. It's almost hilarious but you know, if you were trapped alone with this man in the middle of nowhere, you were be scared out of your mind.\n\nWhat I enjoy most about TUSK is that it was done on a super-low budget and has to get creative as a result. That means practical effects. No CG. Any film using practical makeup FX is going to earn bonus points with me. We all know what's coming from the start of the movie and we're waiting anxiously for it. When the suit finally makes its appearance halfway through the film, it does not disappoint. Of course it's going to look fake. I don't care about that. It's a physical prop with presence and weight, it's hideous, it's a little funny, and it works 100% for me. The suit comes out. The walrus training begins. Things get weird. Meanwhile, Ally and Teddy are on the case and, for a while, their story is the more interesting one. Their adventure in Canada to investigate Wallace's disappearance leads them to an encounter late in the film with the film's second strangest character Guy Lapointe. I hated the character the first time I watched TUSK, thinking him too goofy for the film, but he'd grown on me by the second viewing. A former police investigator who's gone solo in his investigation of the weird series of missing persons in Manitoba, he's a surprise cameo (if you've managed to avoid spoilers) that is going to play a larger role in the second film of Smith's Canada film trilogy. I'm annoyed that he shows up so late in the game and it feels like it leads to a rushed conclusion to end the film. The first hour or so of the movie is very slowly paced and then it all gets wrapped up in a quickie of a climax at the finish.\n\nTUSK is a movie for Kevin Smith fans and I'm sure not all of them are going to dig it. It's a movie for people with a taste for the weird. It's got good (some great) performances, awesomely disturbing makeup FX, and Smith's unique style of writing running through it. Smith fans will probably have already sought this movie out, but I recommend others give it a shot as well.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H42M", "trailer": {"@type": "VideoObject", "name": "Trailer #1", "embedUrl": "/video/imdb/vi154446873", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTk0NTE1OTAwOV5BMl5BanBnXkFtZTgwMTE1NzAyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTk0NTE1OTAwOV5BMl5BanBnXkFtZTgwMTE1NzAyMzE@._V1_.jpg", "description": "When his best friend and podcast co-host goes missing in the backwoods of Canada, a young guy joins forces with his friend's girlfriend to search for him.", "uploadDate": "2014-07-27T09:00:11Z"}, "EntryURL": "https://www.imdb.com/title/tt3099498", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk/thumb.jpg", "EntryAdded": "2015-03-08"}