{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt3099498/", "name": "Tusk", "image": "https://m.media-amazon.com/images/M/MV5BNmQyMmUzMmYtMTA4OS00ZmRjLWE0NWYtNjc0ZGM0N2E4YzQ5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Comedy", "Drama", "Horror"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0519043/", "name": "Justin Long"}, {"@type": "Person", "url": "/name/nm0662981/", "name": "Michael Parks"}, {"@type": "Person", "url": "/name/nm0005286/", "name": "Haley Joel Osment"}, {"@type": "Person", "url": "/name/nm1270009/", "name": "Genesis Rodriguez"}], "director": {"@type": "Person", "url": "/name/nm0003620/", "name": "Kevin Smith"}, "creator": [{"@type": "Person", "url": "/name/nm0003620/", "name": "Kevin Smith"}, {"@type": "Organization", "url": "/company/co0326257/"}], "description": "Tusk is a movie starring Justin Long, Michael Parks, and Haley Joel Osment. A brash and arrogant podcaster gets more than he bargained for when he travels to Canada to interview a mysterious recluse... who has a rather disturbing...", "datePublished": "2014-09-19", "keywords": "walrus,canada,search,deception,mansion", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 44448, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3099498/"}, "author": {"@type": "Person", "name": "bowmanblue"}, "dateCreated": "2015-08-06", "inLanguage": "English", "name": "A film of two halves", "reviewBody": "Ah, Kevin Smith – I knew him well (mainly in the nineties during his Clerks, Mallrats and Chasing Amy period). I would always say that he's one hell of a writer of dialogue, whether his work falls straight into the 'comedy' bracket, or he dabbles in other genres, i.e. romance, science-fiction fantasy or horror. And, this time round, he's playing with the 'horror genre.' 'Tusk' tells the tale of a complete idiot (played delightfully by Justin Long). He's a typical product of the modern age – a podcaster with ideas way above his station. Yes, he's a little bit famous, but it appears that a little bit of fame corrupts almost as much as absolute power. He thinks he's 'it' and lets everyone know it, whether it's his co-presenter, his doting girlfriend, or generally anyone he meets along the way.\n\nOne article on his upcoming podcast is an interview with a Canadian 'celebrity' who's also made his name on the internet. Sadly, the 'celebrity' in question is so traumatised with his newfound fame that he kills himself, 'selfishly' leaving our glorious podcaster with nothing to report on while in Canada. That's when he happens upon an interesting offer in a men's restroom. It leads him to a reclusive hermit, played brilliantly by Michael Parks, who offers to tell him his life's story.\n\nThis is the fun part. The interaction between the two is just about as perfect as dialogue can be. The two exchange tales and taken on life in the setting of Park's Gothic mansion. The tension is cranked right up to the max – you know something is going to happen (something bad, obviously), but you just don't know what. This atmosphere is just electrifying when combined with the snappy dialogue. Everything is going great until...\n\n...the film just kind of switches atmosphere and great dialogue for cheap shocks. And shocks that look pretty bad rather than shocking. The second half of the film is everything that the first half isn't, i.e. cheesy. Yeah, there are a few moments of brilliance thrown in there, but, when you realise what's actually happening, you'll probably just shout, 'What... seriously?' It just doesn't work. It feels like someone has tacked a second (lesser) film onto a good one. If I was rating the first half I'd say it was awesome. If I was rating the second half I'd say don't bother. Fans of Kevin Smith may like the dialogue (like I did), but most people will not really go for this on account of the sudden change in mood that doesn't fit where the film was originally heading.\n\nBest to watch this one for free however you can before you invest in actually paying for it. Some people may find the second half as shocking as it was intended. Personally, I just found it a let down and stupid. Pity.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "5"}}, "duration": "PT1H42M", "trailer": {"@type": "VideoObject", "name": "Trailer #1", "embedUrl": "/video/imdb/vi154446873", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTk0NTE1OTAwOV5BMl5BanBnXkFtZTgwMTE1NzAyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTk0NTE1OTAwOV5BMl5BanBnXkFtZTgwMTE1NzAyMzE@._V1_.jpg", "description": "When his best friend and podcast co-host goes missing in the backwoods of Canada, a young guy joins forces with his friend's girlfriend to search for him.", "uploadDate": "2014-07-27T09:00:11Z"}, "EntryURL": "https://www.imdb.com/title/tt3099498", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Tusk/thumb.jpg"}