{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Matrix-Reloaded", "EntryURL": "https://www.imdb.com/title/tt0234215", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Matrix-Reloaded/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Matrix-Reloaded/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Matrix-Reloaded/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Matrix-Reloaded/thumb.jpg", "actor": [{"@type": "Person", "name": "Keanu Reeves", "url": "/name/nm0000206/"}, {"@type": "Person", "name": "Laurence Fishburne", "url": "/name/nm0000401/"}, {"@type": "Person", "name": "Carrie-Anne Moss", "url": "/name/nm0005251/"}, {"@type": "Person", "name": "Hugo Weaving", "url": "/name/nm0915989/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 501125, "ratingValue": "7.2", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Lilly Wachowski", "url": "/name/nm0905152/"}, {"@type": "Person", "name": "Lana Wachowski", "url": "/name/nm0905154/"}, {"@type": "Person", "name": "Lilly Wachowski", "url": "/name/nm0905152/"}, {"@type": "Person", "name": "Lana Wachowski", "url": "/name/nm0905154/"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0108864/"}, {"@type": "Organization", "url": "/company/co0019968/"}, {"@type": "Organization", "url": "/company/co0024939/"}, {"@type": "Organization", "url": "/company/co0190476/"}], "datePublished": "2003-05-15", "description": "The Matrix Reloaded is a movie starring Keanu Reeves, Laurence Fishburne, and Carrie-Anne Moss. Neo and his allies race against time before the machines discover the city of Zion and destroy it. While seeking the truth about the...", "director": [{"@type": "Person", "name": "Lana Wachowski", "url": "/name/nm0905154/"}, {"@type": "Person", "name": "Lilly Wachowski", "url": "/name/nm0905152/"}], "duration": "PT2H18M", "genre": ["Action", "Sci-Fi"], "image": "https://m.media-amazon.com/images/M/MV5BODE0MzZhZTgtYzkwYi00YmI5LThlZWYtOWRmNWE5ODk0NzMxXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg", "keywords": "oracle,cult film,prophecy,alternate reality,three word title", "name": "The Matrix Reloaded", "review": {"@type": "Review", "author": {"@type": "Person", "name": "uds3"}, "dateCreated": "2003-05-30", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0234215/"}, "name": "The Matrix: Deflated!", "reviewBody": "The Wachowskis, having bitten off more than they can digitise in this, the second \"coming\" of so many computer nerd's wet dreams, have over-stepped their dubious talent here - obviously victims of their own hype! THIS is the computer game - THE MATRIX was the movie!\n\nTo be expected, the flick has its die-hard adherents who would happily take a lie-detector test to convince us that they alone can penetrate the bulldust and fathom a master-plan in progress. This armored, but essentially - cranially displaced movie, is, like the sum of Morpheus' spoutings, heavy on pretense, light on significance. Fishburne's Moses-inspired \"address to the nation\" atop Pride Rock, must rank as the most non-sensical piece of dialog ever uttered in a movie. Even HE looks utterly embarrassed to be there, frequently pausing as if wondering \"WHAT did I just say?\" The entire sequence in fact, including the orgiastic rave with a BLADE soundtrack, appears to have been inspired by THE TEN COMMANDMENTS.\n\nAs for THAT completely loopy and sex-less coupling with Carrie Ann Moss, I had to avert my eyes for fear of being rendered sterile! (Talk about LOT's wife!) C'mon....the woman looks old enough to be Reeve's mother and unintentionally cruel though it is, has any love interest ever been less attractive in the history of cinema? Reeves MUST have been wearing shades to do it! (Footnote to Miss Moss: No insult intended Carrie, I'm no better - way past my own use-by date but hey, LOVED the catwoman outfit!)\n\n Reeves in fact appears majorly stilted and wooden throughout proceedings here (yeah, I know that IS par for the course for dear old Keanu, but Hell, couldn't NEO (gosh thats brilliant - anagram of ONE,  Thank you HAL!) have had just a little fun? As for his excruciatingly prolonged brawl with the replicated Agent Smiths....what the HELL was that?.....realistic? meaningful? intellectual? spiritual? None of the above, this was pretentious, laughable, overlong and irritating. Did LESS than nothing for the flick's credibility. One may also well ask, why, with his ability to leap tall buildings and fly at warp factor 10, would he even be bothered with such mundane fisticuffs in the first place? If he can repel bullets and the considerably better equipped aliens simply by holding his hand up, whats the deal here with the army of Weavings?  The sequence of course was not intended for logical contemplation. simply to impart to the popcorn-munching cretins that \"hey, ain't this one FUN movie?\"\n\nQuantum physics, Crane-crap, Zen Buddhism, Armani fashions, Cecil B De Mille, Fritz Lang and Jacke Chan aside, what are we LEFT with here?  A half-decent freeway chase and ONLY the second other intelligent part of the movie - the sequence with the architect. The latter being the greatest, most perceptive and well delivered flurry of meaningful adjectival literacy since Lord Henry gave Dorian a lesson in societal objectivity in THE PICTURE OF DORIAN GRAY. I cannot believe that greater than 2% of the MATRIX RELOADED's entire audience worldwide would have had the slightest idea of what was being said!\n\nThe less said about the ending (and I use the term loosely), the better. You want thought provoking Sci-fi? stick with 2001 or BLADE RUNNER. You want action?  MAD MAX 2: THE ROAD WARRIOR leaves this for dead and WITHOUT CGI. You want superb characterisation? try BILLY BUDD on for size. Maybe gothic brilliance is your thing? THE INNOCENTS awaits you! You wanna be swept along with the crowd?  better catch MATRIX RELOADED (actually a sequel to THE EMPEROR'S NEW CLOTHES) before you actually get a chance to think!"}, "trailer": {"@type": "VideoObject", "description": "Trailer", "embedUrl": "/video/imdb/vi3086352665", "name": "The Matrix Reloaded", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWM3OGI1OTctNDVjNC00NzE1LThkOTYtMDllZGJiOTQ2Mzc4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWM3OGI1OTctNDVjNC00NzE1LThkOTYtMDllZGJiOTQ2Mzc4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "uploadDate": "2008-04-11T16:56:48Z"}, "url": "/title/tt0234215/", "EntryAdded": "2013-02-19"}