{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Pans-Labyrinth", "EntryURL": "https://www.imdb.com/title/tt0457430", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Pans-Labyrinth/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Pans-Labyrinth/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Pans-Labyrinth/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Pans-Labyrinth/thumb.jpg", "actor": [{"@type": "Person", "name": "Ivana Baquero", "url": "/name/nm1419440/"}, {"@type": "Person", "name": "Ariadna Gil", "url": "/name/nm0317725/"}, {"@type": "Person", "name": "Sergi López", "url": "/name/nm0530365/"}, {"@type": "Person", "name": "Maribel Verdú", "url": "/name/nm0893941/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 600872, "ratingValue": "8.2", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Guillermo del Toro", "url": "/name/nm0868219/"}, {"@type": "Organization", "url": "/company/co0016173/"}, {"@type": "Organization", "url": "/company/co0024845/"}, {"@type": "Organization", "url": "/company/co0040776/"}, {"@type": "Organization", "url": "/company/co0164586/"}, {"@type": "Organization", "url": "/company/co0157705/"}, {"@type": "Organization", "url": "/company/co0058749/"}, {"@type": "Organization", "url": "/company/co0115302/"}, {"@type": "Organization", "url": "/company/co0149944/"}], "datePublished": "2006-10-11", "description": "El laberinto del fauno is a movie starring Ivana Baquero, Ariadna Gil, and Sergi López. In the Falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world.", "director": {"@type": "Person", "name": "Guillermo del Toro", "url": "/name/nm0868219/"}, "duration": "PT1H58M", "genre": ["Drama", "Fantasy", "War"], "image": "https://m.media-amazon.com/images/M/MV5BMTU3ODg2NjQ5NF5BMl5BanBnXkFtZTcwMDEwODgzMQ@@._V1_.jpg", "keywords": "fairy,hiding,maze,spain,labyrinth", "name": "El laberinto del fauno", "review": {"@type": "Review", "author": {"@type": "Person", "name": "allan-117"}, "dateCreated": "2006-09-12", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0457430/"}, "name": "The best fantasy of the past decade", "reviewBody": "Everyone's been raving about this. My opinion doesn't differ too much. It did however suffer slightly from the overwhelmingly high expectations I'd developed based on how brilliant everyone said it was, and the whole \"20min ovation at Cannes\" thing. Really, who stands for that long? That said, it's an amazing work.\n\nSkipping the plot recap (find the briefest synopsis you can if you need to be filled in), I'll go straight to the tech specs. I'm not a huge Del Toro fan, Cronos was interesting but lacked something for me. Mimic was dross. Hellboy was enjoyable and Ron Perlman is always great on screen. But here, the director really outdoes himself. By far. He has wrapped together some amazing elements and somehow maintains a balance, that doesn't tip into the mundane or the ridiculous for a moment. And this is no mean feat. The story is part historical drama, part fantasy, part family melodrama. When it dips out of the fantasy, it still enchants.\n\nSergi Lopez and Maribel Verdú really drive the story in the historical drama scenes. I haven't seen Lopez in anything other than a film called Lisbon, in which he played a character so completely opposite from the Captain. He is a fierce and terrifying guy but actually comes across as sympathetic in a couple of scenes. Verdu is incredible as Mercedes, the head housekeeper (or something) who is Ofelia's closest friend in the house. The scenes with these characters and the civil war subplot never fail to hold your attention. Ivana Baquero is excellent as the main character Ofelia, her performance is very mature and believable and she shares some beautiful scenes with her mother and Mercedes.\n\nWhen the fairy tale elements return, it's astounding how naturally they fit into the story. I think that is the real magic of this film. The war drama and the fairy tale stem so naturally from each other.\n\nOne thing that most reviews haven't mentioned is the violence. I think it's been firmly established that this is an adult's fairytale, but at times it is a very intense and brutal film. There are a couple of scenes in particular which are very disturbing and difficult to watch. These do not distract from the tone and theme of the film however so they don't seem exploitative at all. If you are squeamish, it may get a bit much for you.\n\nA final and obvious point I spose I can't get away without making: the set design, costumes and effects are superb. That's all.\n\nI was perhaps expecting a little more fantasy, but the unique blend of genres is absolutely compelling. There wasn't a false note anywhere or a plot hole, which are too often present in fantasy films. I can't recall a good, original fantasy film from recent years. Fortunately this blows MirrorMask out of the water. It doesn't share any of the contrivances, vagueness or ineffectual characters with that film.\n\nI just wish I'd seen it without already having read so much. I've tried very hard to not reveal any plot details at all as it does go to some surprising and unexpected places. Fortunately most of the reviews have done the same. I'd urge anyone with the chance to see it to do so immediately, and try not to read too much more.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "10", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "embedUrl": "/video/imdb/vi1876343321", "name": "Tráiler [OV]", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWQzZWZkMGYtNGZkOC00YzlkLTk5MTEtYjQzNzJmY2NkMGRjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWQzZWZkMGYtNGZkOC00YzlkLTk5MTEtYjQzNzJmY2NkMGRjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg", "uploadDate": "2018-11-30T10:00:04Z"}, "url": "/title/tt0457430/", "EntryAdded": "2013-02-23"}