{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0209958/", "name": "The Cell", "image": "https://m.media-amazon.com/images/M/MV5BMDY1NmVmOTItYWU0NC00OGU2LWIyNTctYTU3NTY3ZjJkOWJjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Horror", "Sci-Fi", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000182/", "name": "Jennifer Lopez"}, {"@type": "Person", "url": "/name/nm0000681/", "name": "Vince Vaughn"}, {"@type": "Person", "url": "/name/nm0000352/", "name": "Vincent D'Onofrio"}, {"@type": "Person", "url": "/name/nm0416381/", "name": "Colton James"}], "director": {"@type": "Person", "url": "/name/nm0802248/", "name": "Tarsem Singh"}, "creator": [{"@type": "Person", "url": "/name/nm0698873/", "name": "Mark Protosevich"}, {"@type": "Organization", "url": "/company/co0046718/"}, {"@type": "Organization", "url": "/company/co0067485/"}, {"@type": "Organization", "url": "/company/co0029540/"}, {"@type": "Organization", "url": "/company/co0017404/"}, {"@type": "Organization", "url": "/company/co0028247/"}], "description": "The Cell is a movie starring Jennifer Lopez, Vince Vaughn, and Vincent D'Onofrio. An F.B.I. Agent persuades a social worker, who is adept with a new experimental technology, to enter the mind of a comatose serial killer in order to...", "datePublished": "2000-08-18", "keywords": "serial killer,race against time,coma,fbi,subconscious", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 93081, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0209958/"}, "author": {"@type": "Person", "name": "kitsenugari"}, "dateCreated": "2000-09-11", "inLanguage": "English", "name": "The Cell: whoa... eww... whoa...", "reviewBody": "The last time I reviewed a film helmed by a music video director, I was very angry at what I'd seen (`Mystery Men'), but Tarsem Singh spares us the fish-eye lenses and commercial overindulgences and decides to concentrate on presenting an astonishing visual and audible journey into the mind of a serial killer in `The Cell'.\n\nCarl Stargher (Vincent D'Onofrio) kills women by drowning them in glass cells, all the while videotaping the event.  Afterwards, he disfigures the bodies to resemble dolls and then tosses the finished `products' off highways into ditches and streams.  Nice guy.  He also likes to suspend himself on chains attached to hooks inserted directly into his back. Lovely.\n\nMeanwhile, FBI agent Peter Novak (Vince Vaughn) is hot on the killer's trail, and although Carl's started to get sloppy, he's just kidnapped another girl and she has 40 hours before her cell fills with water.  Carl is soon apprehended, but only because he enters into a schizophrenic seizure and falls into a coma on his kitchen floor.  A coma?  But how are they going to find out where the last victim is?  Oh, if only they could TRAVEL INSIDE HIS MIND.  Hey, what a coincidence!  Catherine Deane (Jennifer Lopez) is a child psychologist involved in an experimental project that allows her to TRAVEL INSIDE THE MIND of coma victims.\n\nAnd so begins a strange array of visuals and sounds, blended together so unusually that you honestly feel like you're experiencing a dream\u0085 a not so pleasant dream.  Not only is Carl's mind slightly twisted, it's violent, disturbingly sexual, and very graphic.  But, it's also like a train wreck; you can't help but look.  Oddly enough, Mr. Singh clearly had the resources to make his special effects scream out at you with bright color and absurd lavishness, but he chose instead to simplify, placing the terror in the scale and content of the visuals.  I can't even use an example.  All I can say is think about a dream you've had that you couldn't describe to someone, and that's what watching this movie is like.  The photography is so stunning that it virtually eliminates the need for dialogue (only about half the film has discourse), and coupled with the horrifically spooky and scathing soundtrack, the film literally takes on a life of its own.\n\nMy only objection is that when all is said and done, the only character we really understand is the serial killer.  Several clues about the other characters' pasts led me to believe that their lives would come into play and that their own memories would be tested and confronted.  To me, this would have taken this story to yet another psychological level, but perhaps it would have been too much for viewers.\n\nDespite this shortcoming, `The Cell' stills provides a myriad of images that will make you want to watch a lot of cute cartoons before turning in for the night.  Still, I don't know what was more disturbing: the movie, or the parents in the next row over who brought their two small kids to watch it."}, "duration": "PT1H47M", "trailer": {"@type": "VideoObject", "name": "The Cell", "embedUrl": "/video/imdb/vi4235764761", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmU3MWZmZTAtZWYwOC00ODAzLTk0YzktNmM2ODAxODU3Y2FjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmU3MWZmZTAtZWYwOC00ODAzLTk0YzktNmM2ODAxODU3Y2FjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for The Cell", "uploadDate": "2012-10-27T03:34:48Z"}, "EntryURL": "https://www.imdb.com/title/tt0209958", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Cell", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Cell/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Cell/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Cell/thumb.jpg", "EntryAdded": "2013-03-24"}