{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0120382/", "name": "The Truman Show", "image": "https://m.media-amazon.com/images/M/MV5BMDIzODcyY2EtMmY2MC00ZWVlLTgwMzAtMjQwOWUyNmJjNTYyXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg", "genre": ["Comedy", "Drama", "Sci-Fi"], "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm0000120/", "name": "Jim Carrey"}, {"@type": "Person", "url": "/name/nm0000438/", "name": "Ed Harris"}, {"@type": "Person", "url": "/name/nm0001473/", "name": "Laura Linney"}, {"@type": "Person", "url": "/name/nm0001187/", "name": "Noah Emmerich"}], "director": {"@type": "Person", "url": "/name/nm0001837/", "name": "Peter Weir"}, "creator": [{"@type": "Person", "url": "/name/nm0629272/", "name": "Andrew Niccol"}, {"@type": "Organization", "url": "/company/co0023400/"}, {"@type": "Organization", "url": "/company/co0093765/"}], "description": "The Truman Show is a movie starring Jim Carrey, Ed Harris, and Laura Linney. An insurance salesman discovers his whole life is actually a reality TV show.", "datePublished": "1998-06-05", "keywords": "hidden camera,simulated reality,fictional reality show,controlled environment,deception", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 895488, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0120382/"}, "author": {"@type": "Person", "name": "Mark1988"}, "dateCreated": "2007-04-09", "inLanguage": "English", "name": "One of the Most Original Films Ever Made", "reviewBody": "'The Truman Show' epitomizes strong and original storytelling on screen. This film is emotionally engaging, didactic, witty, dramatic and very unique. For those unfamiliar with the concept, Truman Burbank has never left his ideal home town of Sea Haven. What he doesn't know is that his entire environment is a materialized set and he is the ignorant star of a reality TV show of epic proportions.\n\nTaking this entirely original concept, writer Andrew Niccol and director Peter Wier take the viewer into territory uncharted by anything in film history. Thus, the plot is entirely unpredictable but still flows along expertly. The tightness of the screenplay and the immaculate pacing of Peter Wier contribute largely to this film's brilliance.\n\nThe acting performances are amongst the best I've ever seen. Jim Carey is superb as Truman, effortlessly conveying his fears, desires and personality. Ed Harris is excellent as the reclusive creator of the production. In addition, the entire support cast appears synthetic enough to let the audience know they are \"acting\" for Truman but in some scenes let their \"genuine\" feelings shine through. The ensemble simply cannot be faulted. Carey was hardly done by not to get an Oscar nomination for his performance.\n\nThe music and visuals are top notch. The cinematography has a reality TV feel that is clever but never intrusive. The shot selection is of the highest quality, particularly in the movie's final sequence. Muscially, this film is incredible. Phillip Glass is a dream on the piano, perfectly evoking the mood for each section of the narrative. The two combine excellently during the scene in which Truman breaks his routine for the first time. During the sequence, Truman makes subtle changes to the bland routine he follows compliantly every day. The emotion of the music when combined with the apparent simplicity of Truman's actions makes this scene one the most powerful I'v ever experienced.\n\nThis film is an absolute gem. It effortlessly combines everything a classic film should have. It has comedy, drama, strong character development, atmosphere, originality, superb visuals, a superb score, tight writing, raises interesting moral questions as well as providing insight into the human condition. One cannot watch this spectacular film without wondering how a human would react when put in that kind of situation. It touches on our sense of adventure, desire for conformity and the courage we require to question the life we are presented with. 'The Truman Show' does all this in the most accessible and compelling fashion. One of the greatest films of our time.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H43M", "trailer": {"@type": "VideoObject", "name": "The Truman Show", "embedUrl": "/video/imdb/vi1878327577", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjc5MGY5MTctNDE3OS00OWQ4LWFhYWQtNDc0NTBmYjFiNDM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjc5MGY5MTctNDE3OS00OWQ4LWFhYWQtNDc0NTBmYjFiNDM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Theatrical Trailer from Paramount", "uploadDate": "2008-04-11T16:52:43Z"}, "EntryURL": "https://www.imdb.com/title/tt0120382", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Truman-Show", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Truman-Show/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Truman-Show/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Truman-Show/thumb.jpg", "EntryAdded": "2013-02-19"}