{"@context": "http://schema.org", "@type": "TVEpisode", "url": "/title/tt0872938/", "name": "The Tank Man", "image": "https://m.media-amazon.com/images/M/MV5BMTM3MDFlZmEtODE0Ny00NjI5LWE4NmEtYjFjZGJlYTRlMTE4XkEyXkFqcGdeQXVyOTU4Nzg1NTI@._V1_.jpg", "genre": "Documentary", "actor": [{"@type": "Person", "url": "/name/nm2922340/", "name": "T.D. Allman"}, {"@type": "Person", "url": "/name/nm2518716/", "name": "Nicholas Bequelin"}, {"@type": "Person", "url": "/name/nm2921345/", "name": "Timothy Brook"}, {"@type": "Person", "url": "/name/nm2921521/", "name": "Michael Callahan"}], "director": {"@type": "Person", "url": "/name/nm0002793/", "name": "Antony Thomas"}, "creator": {"@type": "Person", "url": "/name/nm0002793/", "name": "Antony Thomas"}, "datePublished": "2006-04-11", "keywords": "beijing china,tiananmen square beijing,economy,china", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 90, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0872938/"}, "author": {"@type": "Person", "name": "Izualizm"}, "dateCreated": "2008-10-05", "inLanguage": "English", "name": "A well presented documentary, even though lacking some details and precisions", "reviewBody": "The Frontline delivers with this inspiring but at the same time depressing documentary on \"The Tiananmen Massacre\", or what many Chinese remembered as, \"June 4th\".\n\nEstablishing the context from which the international icon, \"the tank man\" was originated, the documentary takes us through the event in the past, while notably tackles the issues in the present. Though lacking some details and pending some inaccuracies, it is well emphasized and well presented.\n\nThere are some bits I would like to point out:\n\n1, When the first time troops are deployed to the city, citizens surround trucks and try to talk the soldiers out if it, they are not exactly in a \"this-is-our-city-why-are-you-here-get-out\" mindset as implied by the narrator, instead they try to soften the soldiers with the perception that the people and the army are an inseparable family. Only when you understand this \"fish and water\" mentality with regard to relationship between common people and soldiers, can you understand how much of a shock it was to all Chinese in the ensuing violence showdown.\n\n2, It is a fact that many (or most rather) young people in China today haven't a faintest idea what June 4th incident is, let alone \"the tank man\". But as far as I know many Peking University students know \"June 4th\", and some of them discuss the subject on BBS openly. It seemed \"The tank man\" is a more iconic figure to foreigners than to the Chinese, the censorship on this subject in China certainly contributed mostly to that, but there is more. To Chinese who are well aware of \"June 4th\", the picture of soldiers' head hanging on a tree or a street lamp, or the picture of a chunk of flattened meat on the ground, leaves an infinitely more vivid mark on Chinese hearts. To us, \"June 4th\" is not about \"the tank man\", it was our reality, the only thing left for us is depression.\n\n3, As pointed out in some discussion boards, the search term \"Tiananman Square\" the producer uses on google to prove the point that Google.cn is heavily censored, are actually not effective. Firstly, \"Tiananman Square\" or more precisely \"天安门\" can mean many things other than \"June 4th\" to many Chinese, it is a place where a fair share of the country's significant events took place, it is also a major tourist attraction; Secondly and similarly, the term \"June 4th\" can mean many things other than \"the tank man\" to us. I would think EVEN without any censorship, searching \"Tiananman Square\" in Google.cn will yield very few, if any results with \"the tank man's\" picture on them. \n\nSome simple search on Google.cn can prove that. If anyone interested, you can copy and paste these search term and go to Google.cn to see for yourself: \"89天安门广场事件\" ('89 Tiananmen incident'), \"64事件\" ('64 incident'), and \"六四\" ('64').\n\nAs you can see, even with its heavily censored state, Google.cn would yield results of more specific topics, as indicated by the pictures. \"The tank man\" just has less overall impact on us, compared to other horrifying pictures and stories.\n\nThe documentary has its historical value as well as contemporary social value. Today's China still breeds the problems that can provoke the mass, it still provides the soil on which social unrest continues to spawn. I often quote, \"Those who do not learn from the past, are doomed to repeat it\".\n\nBut have we learned? Would we?", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "EntryURL": "https://www.imdb.com/title/tt0872938", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Tank-Man", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Tank-Man/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Tank-Man/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Tank-Man/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Tank-Man/thumb.jpg", "EntryAdded": "2014-09-16"}