{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0118929/", "name": "Dark City", "image": "https://m.media-amazon.com/images/M/MV5BMGExOGExM2UtNWM5ZS00OWEzLTllNzYtM2NlMTJlYjBlZTJkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Mystery", "Sci-Fi", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0001722/", "name": "Rufus Sewell"}, {"@type": "Person", "url": "/name/nm0000662/", "name": "Kiefer Sutherland"}, {"@type": "Person", "url": "/name/nm0000124/", "name": "Jennifer Connelly"}, {"@type": "Person", "url": "/name/nm0000458/", "name": "William Hurt"}], "director": {"@type": "Person", "url": "/name/nm0001639/", "name": "Alex Proyas"}, "creator": [{"@type": "Person", "url": "/name/nm0001639/", "name": "Alex Proyas"}, {"@type": "Person", "url": "/name/nm0001639/", "name": "Alex Proyas"}, {"@type": "Person", "url": "/name/nm0229644/", "name": "Lem Dobbs"}, {"@type": "Person", "url": "/name/nm0333060/", "name": "David S. Goyer"}, {"@type": "Organization", "url": "/company/co0052515/"}, {"@type": "Organization", "url": "/company/co0046718/"}], "description": "Dark City is a movie starring Rufus Sewell, Kiefer Sutherland, and Jennifer Connelly. A man struggles with memories of his past, which includes a wife he cannot remember, and a nightmarish world, no one else seems to be waking up...", "datePublished": "1998-02-27", "keywords": "neo noir,alien race,memory,experiment,serial killer", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 183566, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0118929/"}, "author": {"@type": "Person", "name": "ChoiBaby"}, "dateCreated": "1999-02-06", "inLanguage": "English", "name": "A fantastic science-fiction masterpiece!", "reviewBody": "An absolutely brilliant and nightmarish production!  DARK CITY is an enriching and surreal experience, full of beautiful images and powerful symbolism.\n\nJohn Murdoch (Rufus Sewell) wakes up one night, resting inside a bathtub. He look around, realizing that he is inside a hotel room.  In a state of shock, he finds a bloody corpse lying near his bed. Then...reality sinks in. He discovers an appalling revelation which he cannot accept. He is wanted for murder on six separate accounts.  How does all of this fit in when he thought of himself as a completely sane person?  He does not believe he was responsible for these murders, but the cops think otherwise as they chase him down... Next, a swarm of humanoid creatures known only as the \"Strangers\" have summon him.  For unknown reasons, Murdoch happens to fit into their intricate schemes for conquest...\n\nThis is just scratching the surface of the premise for Alex Proyas' moody and engaging film, DARK CITY.  DARK CITY is a very vivid film with an original concept. As the story expands and the main character must go into the heart of the matter, he learns that there's a conspiracy going on \"mixing and matching\" different identities together into one whole. The Strangers are the masters...the inhabitants are their puppets...and the city is their playground...\n\nDARK CITY essentially has gorgeous photography, capturing aspects of the entire city where imagination paints the picture and provides the details. This film relies a lot on imagery and the fantastic production values are laced with a perplexing storyline that keeps the viewer's eyes glued to the screen. The eye-catching, stylish future noir designs a visionary world, evinced in the setting of the Big Apple itself, New York City during the time period of the 1940s. Dark City's visual backgrounds enliven a difficult and incomprehensible plot to comprehend and the special effects create an astounding experience, traveling into a vortex of mankind's phantasm.\n\nDARK CITY, in addition to the superb background settings, allows for character development as well. The audiences grows greatly in a moment of eagerness as they want to determine what will happen next to the characters in this film. As always, the cast is wonderful. Rufus Sewell is excellent as John Murdoch, convincing as an ordinary man on the run from both the law and the strangers. Jennifer Connelly is sensuous and appealing as Murdoch's loving and concerned wife. William Hurt plays his cards right as a straitlaced NYPD inspector, Frank Bumstead, who keeps pursuing John Murdoch.  As  an  eccentric   psychiatrist,  Dr. Daniel Paul Schreber, Kiefer Sutherland conveys a confused doctor who shares a frightening connection to these Strangers.\n\nDARK CITY is splendid viewing injected with a theme about the loss of identity and the destruction of individualism in order to create an ideal society.  DARK CITY is an unforgettable, breathtaking visual experience! This film is enriched with layers of characterization, a plot where there is more than meets the eye, and venturous special effects.  DARK CITY is recommended viewing with the lights out!  A  thoroughly  cogent flick which keeps you guessing what is going on.  DARK CITY is a fine treat for the eyes and mind.  This is one journey where you reach the point of no return!\n\nRATING: *** out of ****."}, "duration": "PT1H40M", "trailer": {"@type": "VideoObject", "name": "Dark City", "embedUrl": "/video/imdb/vi2614494745", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BODE0NThjNjktOWFjMy00N2YxLWJlOWEtMDlkOWFiMjAyMzY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODE0NThjNjktOWFjMy00N2YxLWJlOWEtMDlkOWFiMjAyMzY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for Dark City", "uploadDate": "2010-08-17T03:12:21Z"}, "EntryURL": "https://www.imdb.com/title/tt0118929", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Dark-City", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Dark-City/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Dark-City/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Dark-City/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Dark-City/thumb.jpg", "EntryAdded": "2013-02-19"}