{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt1827733/", "name": "How TV Ruined Your Life", "image": "https://m.media-amazon.com/images/M/MV5BM2NiMTE3YjktYWNhMS00NmVkLTk4NjYtZWNlY2Y0OGE1YmZmXkEyXkFqcGdeQXVyNjUwMTQ4NjE@._V1_.jpg", "genre": ["Documentary", "Comedy"], "actor": [{"@type": "Person", "url": "/name/nm0111765/", "name": "Charlie Brooker"}, {"@type": "Person", "url": "/name/nm0108510/", "name": "Liz May Brice"}, {"@type": "Person", "url": "/name/nm0253126/", "name": "Kevin Eldon"}, {"@type": "Person", "url": "/name/nm0179596/", "name": "Beth Cordingly"}], "description": "How TV Ruined Your Life is a TV mini-series starring Charlie Brooker, Liz May Brice, and Kevin Eldon. A comedic documentary series in which Charlie Brooker uses a mix of sketches and jaw-dropping archive footage to explore the gulf...", "datePublished": "2011-01-25", "creator": {"@type": "Organization", "url": "/company/co0104481/"}, "keywords": "tv mini series,reenactment", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1160, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1827733/"}, "author": {"@type": "Person", "name": "bob the moo"}, "dateCreated": "2015-04-19", "inLanguage": "English", "name": "Familiar material at times, but nicely packaged and typically acerbically funny – even if it is a little judgmental at times", "reviewBody": "Those familiar with his old Guardian column Screenburn, or the show Screenwipe and variations that came from it, will already know where they are with this show from the very start. In this show, in picking apart the impact of television, Charlie Brooker shows us how it has ruined our lives in regard to relationships, technological advances, our fear of the outside world, our contentment, our aging process, and how we learn things. And don't say it hasn't, because it has.\n\nWhen I watched this show recently, I wasn't really sure where it fitted into the timeline of Brooker being on television – was it something that led to Screenwipe, or was it after it. As it transpired, this show seems like a companion piece to Screenwipe, where essentially the format is the same, but rather than looking back at the week or so in television and news, there is more of a structured documentary approach. The success of this is mixed, although mostly it works pretty well and fans of Brooker's style will enjoy this because all the usual aspects are here; the acerbic worldview, the imaginative and colorfully grim use of language, the sense of the crushing depressing futility of the majority of television. It doesn't sound funny, but mostly it is, thanks to the writing and the delivery.\n\nThe documentary structure is also interesting, although it doesn't totally sit well with Brooker doing his stuff – the two feel a little at odds even when they are working together. The impact of television and the development of that impact is interestingly portrayed; it is not Adam Smith perhaps, but it is a case reasonably well made. The main problem I had with mixing the two things was that, while normally Brooker is mocking populist television, here the show is about the impact on those who watch it – and the shows and examples given are predominately not shows that people like Brooker would watch – and I think this because I also do not watch them. So there is a general feeling throughout that, while the point is valid, it is one that isn't applied to the makers, or the viewers of the show – instead we watch more high-brow things like HBO's output and get our news from \"proper\" print journalism and more informed comment pieces rather than rolling news networks. It is not a massive issue perhaps, but as a whole show, it did smack a little of elitism – and I say that as one on the inside of that feeling. A smaller problem is that some of the material feels recycled from Screenwipe, so if you have watched that show throughout, then you will feel that aspects of this one are recycled.\n\nStill though, the documentary structure works by being interesting enough to engage, but also allowing for all the usual comedy from Brooker, which is as funny as usual (which will be to personal taste is that is criticism or praise!). Worth a look for Brooker fans even though personally I think the Screenwipe format works better in Screenwipe than it did here."}, "EntryURL": "https://www.imdb.com/title/tt1827733", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/How-TV-Ruined-Your-Life", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/How-TV-Ruined-Your-Life/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/How-TV-Ruined-Your-Life/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/How-TV-Ruined-Your-Life/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/How-TV-Ruined-Your-Life/thumb.jpg", "EntryAdded": "2015-11-17"}