{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Sunshine", "EntryURL": "https://www.imdb.com/title/tt0448134", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Sunshine/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Sunshine/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Sunshine/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Sunshine/thumb.jpg", "actor": [{"@type": "Person", "name": "Cillian Murphy", "url": "/name/nm0614165/"}, {"@type": "Person", "name": "Rose Byrne", "url": "/name/nm0126284/"}, {"@type": "Person", "name": "Chris Evans", "url": "/name/nm0262635/"}, {"@type": "Person", "name": "Cliff Curtis", "url": "/name/nm0193295/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 228043, "ratingValue": "7.2", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Alex Garland", "url": "/name/nm0307497/"}, {"@type": "Organization", "url": "/company/co0103974/"}, {"@type": "Organization", "url": "/company/co0136728/"}, {"@type": "Organization", "url": "/company/co0016492/"}, {"@type": "Organization", "url": "/company/co0104811/"}], "datePublished": "2007-04-05", "description": "Sunshine is a movie starring Cillian Murphy, Rose Byrne, and Chris Evans. A team of international astronauts are sent on a dangerous mission to reignite the dying Sun with a nuclear fission bomb in 2057.", "director": {"@type": "Person", "name": "Danny Boyle", "url": "/name/nm0000965/"}, "duration": "PT1H47M", "genre": ["Sci-Fi", "Thriller"], "image": "https://m.media-amazon.com/images/M/MV5BMTU5Nzg2OTk2NF5BMl5BanBnXkFtZTYwNTc1ODM3._V1_.jpg", "keywords": "spacecraft,sun,spaceship,mission,wtf", "name": "Sunshine", "review": {"@type": "Review", "author": {"@type": "Person", "name": "lozza778"}, "dateCreated": "2007-04-16", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0448134/"}, "name": "Sunshine - rather good..", "reviewBody": "Sunshine cost £20 million. Jerry Bruckheimer and his Hollywood cohorts must be shaking their heads in disbelief. Danny Boyle and Alex Garland, British born and bred, have outdone America's effects laden finest, and at a mere fraction of the price. Armageddon ($140 million) and Pirates of The Caribbean 2 ($225 million) have nothing, nothing on the majestic visuals that Sunshine offers. From the jaw dropping opening sequence to the fantastically realised final moments, Boyle's latest is a mighty treat for the eyes. \n\nBut of course, effects do not make a film. You need only consider the two aforementioned Bruckheimer blowouts for proof. But happily, behind the blinding visuals, Sunshine has a violently beating heart. One that offers absolutely no let up, that gains speed and then gains a little more, before finally threatening cardiac arrest. You can't help but live and breath every moment of the crew's breathless existence. \n\nThe year is 2057 and a select group of astronauts are given that most trifling of tasks. The sun is dying. Drop a bomb in it. Save all of mankind. And to top it all, on a ship rather ominously named 'Icarus II'. Add inevitable inter crewmember tension and you have a rather heated situation. The sweaty crew are played wonderfully by a decidedly un-starry, but talented cast. Cilian Murphy, taking the lead role as the ship's resident physicist Cappa, the only member who has the wherewithal to actually drop the bomb, is coolly enigmatic as ever, the blue orbs of his eyes forming a nice counterpoint to the never far rather redder orb of the sun. You can't help but feel he isn't particularly challenged as an actor, but nevertheless he provides a suitably ambivalent, androgynous and faintly unsettling core to the proceedings. \n\nPerhaps more impressive is Chris Evans. Recently seen in a similarly hot headed role in the undercooked comic book adaptation 'Fantastic Four', he consistently snatches scenes from Murphy as engineer Mace, about as volatile and fiery as Cappa is composed and cool. Without Evan's energetic performance, the film would sink into an anti-libidinal quag. Mace's emotive instability injects pace when it's needed and brings some welcome variety to the otherwise glum faces. Evans is surely on the brink of big things. A small quibble would be that there are perhaps a few too many characters; meaning that a fair share of the cast never really gets a chance for development, which is irritating, as one gets the feeling that there's a lot of wasted potential.\n\nAnother chink in Sunshine's spacesuit, is in many places, Alex Garland's screenplay. Whilst he has a remarkable talent for creating intense psychological tension, of which there is plenty in Sunshine, his philosophising is much less satisfactory. This is not to say he doesn't play with some fascinating ideas. With the crew circling so close to the Sun, to the giver of life, Garland begins ask the biggest of questions. Is there something, something inestimably greater than ourselves, something that could create such a magnificent star, or are we, like the sun, simply dust? It's a great idea, but for the larger part of the film, it seems oddly shoehorned into what is at base a sci-fi pot-boiler. In fact these ideas are better expressed in Boyle's imagery. Time and time again we see members of the crew staring aghast at the immensity of the burning ball of gas and dust in front of them. The relationship between giver and taker is better explored here than in any line of Garland's. \n\nThe structure of his screenplay is also a little unwieldy. The first hour and a half play as an intense psychological study - the pace at times painfully weighty as the tension is ratcheted up ever higher. The film works beautifully here - it may not introduce anything particularly new; claustrophobic stress is certainly nothing new in sci-fi, but it follows genre conventions with such panache and artistry that it's difficult to fault. However, come the final 20 minutes, Sunshine takes a rather abrupt and unwelcome turn. A pretty hammy (not to mention poorly explained) plot twist is ushered in and suddenly we find ourselves in a horror film - a clichéd one at that. To say much more would spoil things, but needless to say, had the filmmakers showed a little restraint in the closing moments, they would have had a real classic on their hands. When the film ditches pretensions, and sticks with the clammy, slow burn thrills it excels at, it's fantastic. When it descends into predictable melodrama, it's still alright, it's just disappointing considering what we know it's capable of. As such it's remarkably well shot, superbly rendered, occasionally poignant and occasionally flawed. Whatever the case, Sunshine is never far from entirely thrilling, and, all said and done, film recommendations don't come much higher than that.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "7", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "Theatrical Trailer from Fox Searchlight Pictures", "embedUrl": "/video/imdb/vi1150026009", "name": "Sunshine", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmU4OTI2YzItYzY4My00NzI3LWJhYjItZDcwMjlhNDMyODc1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmU4OTI2YzItYzY4My00NzI3LWJhYjItZDcwMjlhNDMyODc1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "uploadDate": "2008-04-11T16:20:38Z"}, "url": "/title/tt0448134/"}