{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/John-Dies-at-the-End", "EntryURL": "https://www.imdb.com/title/tt1783732", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/John-Dies-at-the-End/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/John-Dies-at-the-End/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/John-Dies-at-the-End/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/John-Dies-at-the-End/thumb.jpg", "actor": [{"@type": "Person", "name": "Chase Williamson", "url": "/name/nm3311695/"}, {"@type": "Person", "name": "Rob Mayes", "url": "/name/nm2373827/"}, {"@type": "Person", "name": "Paul Giamatti", "url": "/name/nm0316079/"}, {"@type": "Person", "name": "Clancy Brown", "url": "/name/nm0000317/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 35507, "ratingValue": "6.4", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Don Coscarelli", "url": "/name/nm0181741/"}, {"@type": "Person", "name": "David Wong", "url": "/name/nm4200139/"}, {"@type": "Organization", "url": "/company/co0323699/"}, {"@type": "Organization", "url": "/company/co0323671/"}, {"@type": "Organization", "url": "/company/co0323778/"}, {"@type": "Organization", "url": "/company/co0388505/"}, {"@type": "Organization", "url": "/company/co0185917/"}], "datePublished": "2013-01-25", "description": "John Dies at the End is a movie starring Chase Williamson, Rob Mayes, and Paul Giamatti. A new street drug that sends its users across time and dimensions has one drawback: some people return no longer human. Can two college...", "director": {"@type": "Person", "name": "Don Coscarelli", "url": "/name/nm0181741/"}, "duration": "PT1H39M", "genre": ["Comedy", "Fantasy", "Horror", "Sci-Fi"], "image": "https://m.media-amazon.com/images/M/MV5BMTUyNzIyNzc0MV5BMl5BanBnXkFtZTcwOTM5ODg1OA@@._V1_.jpg", "keywords": "multiple dimensions,male friendship,cult film,mind altering drug,bullet time", "name": "John Dies at the End", "review": {"@type": "Review", "author": {"@type": "Person", "name": "andrew-w-christman"}, "dateCreated": "2012-10-21", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1783732/"}, "name": "All of the \"style\" with none of the \"substance\"...", "reviewBody": "Just caught an early screening of JDaTE at the Philly Film Festival... and I can't say I wasn't disappointed.\n\nThe book is one of my favorites, so needless to say I loved the source material and was especially amped for the film having just finished the John and Dave sequel, This Book is Full of Spider. I also really enjoyed Coscarelli's Bubba Ho-Tep and thought he would be a great director for this franchise.\n\nSo where did it all go wrong? And what did it do well enough to still garner a 6 or 6.5 rating?\n\nFor starters, the acting was very good; especially for relying on two unknowns to carry the picture. Both Williamson and Mayes really nailed their roles down to the smallest idiosyncrasies of character. Paul Giamatti was his usual, solid self and everyone else either died quick enough or had their character lobotomized so much, that their performances didn't really matter.\n\nThe film also did a great job of harnessing the bodily humor and slacker hi-jinx that made JDaTE such a hilarious novel. \n\nWhich leads me to where they failed... one of the biggest shortcomings has to do with a deficiency of the novel, which is pacing. JDaTE is really a few stories woven together by a thin overarching plot. Coscarelli stayed almost 100% faithful to the source material, but just lifted different scenes from each segment of the story and patchwork it into one nearly nonsensical film (this is a very apparent problem, since once the movie deviates from the order of the book, things start to really go down the tube.)\n\nBeing a fan of the book, I have to wonder why Coscarelli didn't just stick to the first \"story\" that ends in Las Vegas. Instead we get elements of other parts, including a kind of cheesy and dumbed down version of Korrok. \n\nAlong the way basically all character development aside from Dave get shaved out of the story, the biggest being the awful portrayal of Amy... who was nothing more than eye candy in the film (a fresh feature of the novel was her joyfully written character, who was 1000x more attractive despite being described as looking plain.)\n\nBut plot and character wasn't the only things that Coscarelli short changed. For a horror comedy, there was little to no horror! One of the spectacular qualities of the novel was the ability to scare you one moment and have you laughing out loud the next. The adaptation was really a one trick pony, a comedy with monsters. \n\nSo I'm going to be one of those guys and recommend that you skip the movie and check out the book. If you've already read Wong's work (Jason Pargin) check it out and enjoy it for the fun cheese factor, but don't expect anywhere near the depth that the novel provides.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "6", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "A pair of college dropouts who can barely hold down jobs are enlisted to save humanity from a paranormal, psychoactive drug that promises an out-of-body experience with each hit.", "embedUrl": "/video/imdb/vi643671065", "name": "No. 1", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTcwMTY0ODI5Ml5BMl5BanBnXkFtZTcwNzE3NTg2OA@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTcwMTY0ODI5Ml5BMl5BanBnXkFtZTcwNzE3NTg2OA@@._V1_.jpg", "uploadDate": "2012-11-01T15:47:16Z"}, "url": "/title/tt1783732/"}