{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Matchstick-Men", "EntryURL": "https://www.imdb.com/title/tt0325805", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Matchstick-Men/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Matchstick-Men/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Matchstick-Men/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Matchstick-Men/thumb.jpg", "actor": [{"@type": "Person", "name": "Nicolas Cage", "url": "/name/nm0000115/"}, {"@type": "Person", "name": "Alison Lohman", "url": "/name/nm0517844/"}, {"@type": "Person", "name": "Sam Rockwell", "url": "/name/nm0005377/"}, {"@type": "Person", "name": "Bruce Altman", "url": "/name/nm0022883/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 121284, "ratingValue": "7.3", "worstRating": "1.0"}, "contentRating": "PG-13", "creator": [{"@type": "Person", "name": "Eric Garcia", "url": "/name/nm1201715/"}, {"@type": "Person", "name": "Nicholas Griffin", "url": "/name/nm1206007/"}, {"@type": "Person", "name": "Ted Griffin", "url": "/name/nm0341372/"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0038131/"}, {"@type": "Organization", "url": "/company/co0074212/"}, {"@type": "Organization", "url": "/company/co0102305/"}, {"@type": "Organization", "url": "/company/co0033633/"}, {"@type": "Organization", "url": "/company/co0066003/"}, {"@type": "Organization", "url": "/company/co0010750/"}], "datePublished": "2003-09-12", "description": "Matchstick Men is a movie starring Nicolas Cage, Alison Lohman, and Sam Rockwell. A phobic con artist and his protégé are on the verge of pulling off a lucrative swindle when the former's teenage daughter arrives unexpectedly.", "director": {"@type": "Person", "name": "Ridley Scott", "url": "/name/nm0000631/"}, "duration": "PT1H56M", "genre": ["Comedy", "Crime", "Drama", "Thriller"], "image": "https://m.media-amazon.com/images/M/MV5BMjA3NjMyNjIyMF5BMl5BanBnXkFtZTYwOTgzMDI3._V1_.jpg", "keywords": "criminal,child,man wears a hospital gown,man wears eyeglasses,crying man", "name": "Matchstick Men", "review": {"@type": "Review", "author": {"@type": "Person", "name": "C22Man"}, "dateCreated": "2016-06-27", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0325805/"}, "name": "Plenty of Swagger", "reviewBody": "Matchstick Men represents a pleasant change of pace for Ridley Scott. For a director known for doing films that are both large thematically and in scope, it's nice to see him tackle a film that has a simple premise which allows him to build the themes that he wants to discuss. Matchstick Men is a difficult film to categorise, as is the case for most con films. It has touches of dark comedy and pieces of crime thriller, plenty of drama without losing its quirkiness. It often plays out like a character study of a man who struggles to balance his dirty deeds with his mental issues. All of this delivered in a very free-flowing and vibrant way, much like the majority of Scott's work.\n\nAt its core the film is about con man Roy Waller who suffers from serve OCD which become even worse once he loses his pills, shown in a scene that is both funny and sad where he spends a day cleaning his entire house. He then goes to see doctor who takes an interest in his life and wants to help him defeat his illness. Cage is the star centrepiece of the film. He also provides one of his best performances. In a way it is prefect casting, Cage has always been at his best playing edgy and jittery characters and here he gets a legitimate reason to act that way. His performance provides a surprising amount of sympathy as well as humour, he gets so into the character that his frequent ticks seem natural. \n\nThe story develops further when it turns out Roy has a 14 year-old daughter called Angela who he decides to meet, which leads to him struggling to balance out both sides of his life. Enter Alison Lohman who is fantastic. It's hard to believe that she is playing a character ten years younger than she was at the time given how natural her performance is. She manages to capture the essence of what a character that age would be like, without detracting from the emotional weight and likability that she brings. I also think that Sam Rockwell (who I swear has never put in a subpar performance) deserves some praise for his role as Roy's confident business partner.\n\nIt is tough to reveal much more about the plot without giving away pieces of information that might spoil its ending. Scott's direction is certainly a highlight, as usual with his films. It is possibly his most fluid film and he manages to convey Roy's breakdowns with his subtle use of the camera, whilst the frequent use of blue shade invokes the calmness of water which becomes something of a motif. From a visual standpoint the film reminded a lot of 'Catch Me If You Can' given its vibrancy and colour scheme. Adding to this is both the editing and the transitions which are seamlessly done. Hans Zimmer's score is also worth a mention, trading in his usually bombastic compositions for more jazzy and bass heavy pieces that fit the film perfectly.\n\nThe only part of the film that left me cold was its climax and its eventual twist (which I won't reveal). For me the twist did disrupt a lot of the film's emotional and grounded aspects that had been developed excellently throughout. It brings a jolt that almost pushes you out of the film and instead of feeling that the twist transformed the film into something completely different, it simply felt like an unnecessary addition. I think the film would have been even stronger had it avoided said twist all together.\n\nMatchstick Men ends up feeling exactly like what Ridley Scott wants it to be. It's a film that blends multiple genres together and basically plays them off against the typical con man film style. It does go deeper than the story initially suggests, almost working as a psychological study of Roy and the building of his relationship with the daughter he never knew existed. On a surface level however, the film is constantly entertaining. Whether it is for the excellent acting, the charming central narrative, the tension building con or Scott's wonderful direction it doesn't really matter because all of these aspects blend with and play off of each other so well. I don't think the twist works, but it's a testament to the films strength that it isn't overly damaged by that. For me it's a film that is meant to be enjoyed on the surface, before you start to analyse what is underneath.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "8", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "hv-post", "embedUrl": "/video/imdb/vi3415539993", "name": "Matchstick Men", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDU5ZDdlMTAtYjk1NS00NDgzLTgwNmItYWI5MTYwMzU0ODBlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDU5ZDdlMTAtYjk1NS00NDgzLTgwNmItYWI5MTYwMzU0ODBlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "uploadDate": "2008-04-11T14:59:03Z"}, "url": "/title/tt0325805/"}