{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Up-in-the-Air", "EntryURL": "https://www.imdb.com/title/tt1193138", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Up-in-the-Air/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Up-in-the-Air/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Up-in-the-Air/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Up-in-the-Air/thumb.jpg", "actor": [{"@type": "Person", "name": "George Clooney", "url": "/name/nm0000123/"}, {"@type": "Person", "name": "Vera Farmiga", "url": "/name/nm0267812/"}, {"@type": "Person", "name": "Anna Kendrick", "url": "/name/nm0447695/"}, {"@type": "Person", "name": "Jason Bateman", "url": "/name/nm0000867/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 311662, "ratingValue": "7.4", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Walter Kirn", "url": "/name/nm1174529/"}, {"@type": "Person", "name": "Jason Reitman", "url": "/name/nm0718646/"}, {"@type": "Person", "name": "Sheldon Turner", "url": "/name/nm1417242/"}, {"@type": "Organization", "url": "/company/co0023400/"}, {"@type": "Organization", "url": "/company/co0199880/"}, {"@type": "Organization", "url": "/company/co0040938/"}, {"@type": "Organization", "url": "/company/co0118469/"}, {"@type": "Organization", "url": "/company/co0102305/"}, {"@type": "Organization", "url": "/company/co0280848/"}], "datePublished": "2009-12-23", "description": "Up in the Air is a movie starring George Clooney, Vera Farmiga, and Anna Kendrick. Ryan Bingham enjoys living out of a suitcase for his job, travelling around the country firing people, but finds that lifestyle threatened by the...", "director": {"@type": "Person", "name": "Jason Reitman", "url": "/name/nm0718646/"}, "duration": "PT1H49M", "genre": ["Comedy", "Drama", "Romance"], "image": "https://m.media-amazon.com/images/M/MV5BMTI3MzYxMTA4NF5BMl5BanBnXkFtZTcwMDE4ODg3Mg@@._V1_.jpg", "keywords": "on the road,downsizing,travel,job termination,business trip", "name": "Up in the Air", "review": {"@type": "Review", "author": {"@type": "Person", "name": "ClaytonDavis"}, "dateCreated": "2009-11-28", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1193138/"}, "name": "Breathes New Air...", "reviewBody": "Director Jason Reitman, that has brought us great Indie classics such as Thank You for Smoking and Juno has crafted his most personal and most effective portrait to date, Up in the Air. The film stars George Clooney, also giving his most intimate and beautiful performance of his career, as Ryan, a traveling \"Firing-Man,\" who plans on racking up as much frequent flyer miles as he can. Completely void of human connection and emotion, even from his two sisters, one of which is getting married, Ryan seems completely content with his choice of living. All seems well until he meets his female version in the beautiful and charismatic Alex, played with sexual force and intensity by Vera Farmiga. At the same time, a change at his job makes him acquire a student, Natalie, played with sensitivity and vigor by Anna Kendrick, to learn the ropes of the business before potentially making a devastating change to Ryan's way of life.\n\nThe film, based on the book of the same title, is a moving and witty piece of cinema. The line deliveries given are some of the best liners of the year. The adaptation by Reitman and Sheldon Turner is of beautiful and social importance in today's day and age. There was no better time than now, to bring a film like this to the table. Dana E. Glauberman's crisp and precise editing sets the pace as we travel with Ryan in this beautiful account. Reitman's direction shows he's a force to be reckoned with and should be in full blown force for Oscar consideration along with the adaptation shared with Turner.\n\nGeorge Clooney, who's having one hell of a year along with his other comedic turn in The Men Who Stare at Goats, gains sympathy and emotion from the viewer, which up until now, Clooney had always struggled for. The role is right up Clooney's alley and with humorous strength, conveys the pain and loneliness of an otherwise charming man successfully.\n\nVera Farmiga as Alex, is a beautiful as she is dark, and as sexy as she is ugly. Farmiga has finally landed the right role that, in her years of wrong place at the wrong time, should land her a first-time Oscar nomination. Never showing her hand, Farmiga keeps and earns your trust, attention, and admiration. It's one of the most divisive and structurally brilliant supporting turns of the year. \n\nSeemingly not playing with a full deck is Natalie, played most beautifully by Anna Kendrick, who portrays brains don't equal smart choices. Kendrick earns your care and concern for the character, as she follows Ryan around and constantly badgers him about happiness and love, she naïvely and courageously shows the tenderest parts of youth in today's world. Kendrick will likely be sitting along side Farmiga at Oscar's ceremony.\n\nJason Bateman, playing Craig Gregory, the boss in charge, is amusing in a brief but memorable role. Amy Morton and Melanie Lynsky, who play Ryan's sisters, are valuable and sufficient enough to book end a wonderful tale. Danny McBride, an outstanding comic talent to watch, is as good as ever. And finally, in otherwise cameos, Sam Elliott and the great Zack Galifianakis are uproarious in their respective roles.\n\nThis could very well be the crowd and critical pleaser of the year. It has what the 2004 film Sideways lacked, the emotional edge. Long after the film, you take these characters home with you and remind yourself of its authenticity in delivery, poise, and premise. Up in the Air is one of the best pictures of the year. ****/****", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "9", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "Ryan Bingham is a corporate downsizing expert whose cherished life on the road is threatened just as he is on the cusp of reaching ten million frequent flyer miles and just after he's met the frequent-traveler woman of his dreams.", "embedUrl": "/video/imdb/vi3344040473", "name": "Up in the Air: Trailer #2", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTk3ODI2NjM2Nl5BMl5BanBnXkFtZTgwODkzMTczMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTk3ODI2NjM2Nl5BMl5BanBnXkFtZTgwODkzMTczMzE@._V1_.jpg", "uploadDate": "2009-10-03T13:59:46Z"}, "url": "/title/tt1193138/", "EntryAdded": "2013-02-24"}