{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0346369/", "name": "Penn & Teller: Bullshit!", "image": "https://m.media-amazon.com/images/M/MV5BMTQxMDg0NTkzOV5BMl5BanBnXkFtZTcwNDUxNDcyMQ@@._V1_.jpg", "genre": ["Comedy", "Documentary"], "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm0422710/", "name": "Penn Jillette"}, {"@type": "Person", "url": "/name/nm0854418/", "name": "Teller"}, {"@type": "Person", "url": "/name/nm7278501/", "name": "Shera Pollins"}, {"@type": "Person", "url": "/name/nm0368769/", "name": "Gene Hatcher"}], "creator": [{"@type": "Person", "url": "/name/nm0596462/", "name": "Randall Moldave"}, {"@type": "Person", "url": "/name/nm0806450/", "name": "Eric Small"}, {"@type": "Organization", "url": "/company/co0066107/"}, {"@type": "Organization", "url": "/company/co0181096/"}, {"@type": "Organization", "url": "/company/co0181234/"}, {"@type": "Organization", "url": "/company/co0089381/"}, {"@type": "Organization", "url": "/company/co0227855/"}], "description": "Penn & Teller: Bullshit! is a TV series starring Penn Jillette, Teller, and Shera Pollins. The comedy illusionist duo explore various topics and debunk what they consider misconceptions about them.", "datePublished": "2003-01-24", "keywords": "satire,libertarianism,propaganda,2000s,2010s", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 11337, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0346369/"}, "author": {"@type": "Person", "name": "Buzz Vinard"}, "dateCreated": "2005-02-08", "inLanguage": "English", "name": "Skepticism = Critical Thinking", "reviewBody": "I've been a skeptical atheist for a while, now. It is great to have a show that, at the very least, confirms that I am not alone out here.\n\nPenn and Teller are also skeptical atheists, so no one should be expecting an expose of religion to turn into an episode on the religious conversion of the duo. I don't understand many of the reviews here, suggesting that \"thoughtful debate\" should be the order of the day on this show. The show is called \"Bullshit!\" for a reason. You can count on any topic presented here as being something to be taken apart, limb by bloody limb.\n\nThe methodology they use is appropriate to their subjects. I personally hate PeTA and other extremist groups like them. The show about PeTA focused on the hypocrisy in their actions, since what they essentially offer is an extremist opinion, not science. PeTA euthanizes animals? PeTA gave financial support to convicted arsonist Rodney Cronado? PeTA vice-president Mary Beth Sweetland uses animal-based insulin, despite PeTAs firm stance that animals are \"not ours to use\u0097for food, clothing, entertainment, experimentation, or any other reason\"? Holy cow!\n\nThe show about AA took a hard look at the success rate of the program, as well as focusing on the religious-based nature of the program itself, calling into question whether or not it is right for courts to order folks into it.\n\nThe debate on evolution vs. creationism being taught in public school was fascinating. The point being made, lost on many, was that creationism, \"intelligent design\", or any other theory that involves a divine creator is religious in nature, and therefore has no place being taught in public schools. What was seen as the outrage was that the prevailing majority religious viewpoint was being pushed to the front as a fact that all, regardless of religion, were going to be taught. This is as offensive as bizarre attempts to round off the value of pi by legislative coup.\n\nHolistic/alternative medicine is a huge business in my home state. I know a lady who has used these remedies to help her back. I've known her for ten years, and she's been a strict adherent to these methods for at least that long. Her back has hurt for ten years, and it still does, today. There is no science at all on the side of the vast majority of these remedies. Some were even shown on this show to be aggravating to the conditions they were supposed to treat. Basic anatomy classes will show that there are no chakra points on the body, or any reflexology nerve pathways in the foot.\n\nThe main thing the guys want to get across is to use some common sense. Think critically about these kinds of things. Look at them from all angles. If a group of people offer an extremest and absolute point of view, but make exceptions for themselves, ASK WHY! If science is being trampled by religion, ASK WHY! If someone wanted your money to sell you a car, you'd have it checked out first, right? Do the same with anything holistic and/or psychic. Dig. Find some real answers. ASK WHY! And if someone wants to take your freedoms away, say NO!\n\nWhen it comes to matters of opinion, Penn and Teller are not shy about their own. But they don't condescend the audience, telling what opinions they SHOULD have, just asking them to question the opinions and beliefs they DO have. Opinions and beliefs that can stand up to critical thinking deserve to be held on to. Those that can't are bullshit. That's the whole point of the show.\n\nI do hope that the show returns soon. It's still at the top of my Tivo list, though an episode has not aired in months.\n\nAnd if either of you guys read your own reviews, check it out: The two men who founded \"Exodus International\", a Christian \"gay conversion\" group ended up leaving the organization and their wives for each other. Please do a show about this!"}, "trailer": {"@type": "VideoObject", "name": "Penn & Teller: Bullshit! Season 2", "embedUrl": "/video/imdb/vi1791409433", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTc2NGU3NzktZDQ0OS00MmZjLWI1NDctMWE5ZWEyZmJmNjk5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTc2NGU3NzktZDQ0OS00MmZjLWI1NDctMWE5ZWEyZmJmNjk5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "Penn & Teller: Bullshit! Season 2", "uploadDate": "2019-04-06T10:39:12Z"}, "EntryURL": "https://www.imdb.com/title/tt0346369", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Penn-Teller-Bullshit", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Penn-Teller-Bullshit/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Penn-Teller-Bullshit/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Penn-Teller-Bullshit/thumb.jpg", "EntryAdded": "2015-09-04"}