{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Alien", "EntryURL": "https://www.imdb.com/title/tt0078748", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Alien/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Alien/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Alien/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Alien/thumb.jpg", "actor": [{"@type": "Person", "name": "Sigourney Weaver", "url": "/name/nm0000244/"}, {"@type": "Person", "name": "Tom Skerritt", "url": "/name/nm0000643/"}, {"@type": "Person", "name": "John Hurt", "url": "/name/nm0000457/"}, {"@type": "Person", "name": "Veronica Cartwright", "url": "/name/nm0001021/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 758449, "ratingValue": "8.4", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Dan O'Bannon", "url": "/name/nm0639321/"}, {"@type": "Person", "name": "Dan O'Bannon", "url": "/name/nm0639321/"}, {"@type": "Person", "name": "Ronald Shusett", "url": "/name/nm0795953/"}, {"@type": "Organization", "url": "/company/co0132161/"}], "datePublished": "1979-05-28", "description": "Alien is a movie starring Sigourney Weaver, Tom Skerritt, and John Hurt. After a space merchant vessel receives an unknown transmission as a distress call, one of the crew is attacked by a mysterious life form and they soon realize...", "director": {"@type": "Person", "name": "Ridley Scott", "url": "/name/nm0000631/"}, "duration": "PT1H57M", "genre": ["Horror", "Sci-Fi"], "image": "https://m.media-amazon.com/images/M/MV5BMmQ2MmU3NzktZjAxOC00ZDZhLTk4YzEtMDMyMzcxY2IwMDAyXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg", "keywords": "alien,spaceship,outer space,creature,female protagonist", "name": "Alien", "review": {"@type": "Review", "author": {"@type": "Person", "name": "Patuquitos"}, "dateCreated": "2005-01-31", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0078748/"}, "name": "The mother of all movies", "reviewBody": "Back in early 20th century, Lumière brothers didn't have a clue of what they were playing with. I'm freaking sure that if somebody could have magically told them that thanks to their work, a movie like 'Alien' would have been made in the future, they both would have died of a sudden, shocked by the consequences of their labor, like an honest scientist would if he was shown an evil use of his research. In that sense, but in the best way imaginable, 'Alien' is the atomic bomb.\n\nIn my opinion, 'Alien' is the only perfect movie in the history of cinema. Of course, this could be debatable, but of all the films I've watched since I was born, this is the only one in which I haven't been able to find the slightest flaw. It gets a golden ten out of ten. Bright, solid and massive.\n\nI could go on with a panegyric, but I'll try to be short and accurate:\n\nThe direction is just perfect. Every shot is marvellous, every movement of the camera is breathtaking. There is absolutely nothing you could add or subtract. Touch it, and you spoil it. Seriously.\n\nThe acting is splendid. The performances build a credible world centuries away. I don't know about you, but this take on the future was unveliabably acceptable. Sigourney Weaver is more than a revelation, John Hurt is a master, and the rest are nothing short of marvellous.\n\nThe script is a work of art, the story is mesmerizing, well-constructed, well-developed, and free of absurd twists. Its simplicity and efectiveness are yet, 25 years after, to be matched.\n\nThe atmosphere is pure genius. Gothic, claustrophobic and sometimes baroque. The use of light and dark is beyond description, the use of sound is as creepy as it gets.\n\nThe FX are the best possible for 1979. In the time of the release, some scenes were stomach churning.\n\nThe score. Jerry Goldsmith's work matches the images so perfectly it seems to bleed from them. It is and will be the best soundtrack for a sci-fi flick in space ever.\n\nThe tagline. \"In space, no one can hear you scream\". THIS is a tagline.\n\nAnd, of course... the alien. The only alive creature that can steal Weaver the movie. Its design is the most innovative I've seen. It has spawned dozens of disgraceful imitations. This is the real deal. Not only the look, but the complete design of a life form, including biological features. Acid instead of blood. Jaws inside jaws. What more could you possibly want? This is how a movie is done.\n\nA very good sign of a movie that has gone down in history is the amount of collectively well remembered scenes. Well, 'Alien' has so many that I won't go into it. This movie contains so many iconic scenes that has become an icon itself.\n\nSo, what else? I urge all young directors to watch this movie a zillion times, as I've already done, and take notes all along. But not in order to rip off from it, as many others have done, but to learn, learn, learn, learn and learn how a movie should be done. 'Casablanca'? You must be joking.\n\nOh, I almost forget! There's a lovable cat in it.\n\nRATING: 10", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "10", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "A mining ship, investigating a suspected SOS, lands on a distant planet. The crew discovers some strange creatures and investigates.", "embedUrl": "/video/imdb/vi1497801241", "name": "Theatrical Version", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTc4OTYzNjc2MV5BMl5BanBnXkFtZTgwNDA2MzIzMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTc4OTYzNjc2MV5BMl5BanBnXkFtZTgwNDA2MzIzMzE@._V1_.jpg", "uploadDate": "2012-06-22T10:09:58Z"}, "url": "/title/tt0078748/"}