{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt1844624/", "name": "American Horror Story", "image": "https://m.media-amazon.com/images/M/MV5BODZlYzc2ODYtYmQyZS00ZTM4LTk4ZDQtMTMyZDdhMDgzZTU0XkEyXkFqcGdeQXVyMzQ2MDI5NjU@._V1_.jpg", "genre": ["Drama", "Horror", "Thriller"], "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm3078932/", "name": "Lady Gaga"}, {"@type": "Person", "url": "/name/nm0000870/", "name": "Kathy Bates"}, {"@type": "Person", "url": "/name/nm0000291/", "name": "Angela Bassett"}, {"@type": "Person", "url": "/name/nm0005299/", "name": "Sarah Paulson"}], "creator": [{"@type": "Person", "url": "/name/nm1004299/", "name": "Brad Falchuk"}, {"@type": "Person", "url": "/name/nm0614682/", "name": "Ryan Murphy"}, {"@type": "Organization", "url": "/company/co0060381/"}, {"@type": "Organization", "url": "/company/co0314634/"}, {"@type": "Organization", "url": "/company/co0156994/"}, {"@type": "Organization", "url": "/company/co0056447/"}], "description": "American Horror Story is a TV series starring Lady Gaga, Kathy Bates, and Angela Bassett. An anthology series centering on different characters and locations, including a house with a murderous past, an insane asylum, a witch coven,...", "datePublished": "2011-10-05", "keywords": "anthology,serial killer,male objectification,supernatural,hotel", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 265984, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1844624/"}, "author": {"@type": "Person", "name": "dcscribe8860"}, "dateCreated": "2011-10-15", "inLanguage": "English", "name": "\"AMERICAN BEAUTY\" - With A Faceful of Acid...", "reviewBody": "If we have absorbed the lessons of what independent family dramas have taught us in the past few decades, what have we learned? That Father Has Never \"Known Best\", that the \"Dreams of The Everyday Housewife\" can be laced with resentment, disillusionment, fear and madness? That the placid, peaceful, tranquil picture of the all-American family we have believed in (and taught to uphold and emulate) by our own parents, has always been a facade for all kinds of dementia and dysfunction? \n\nIf this is true, then what Ryan Murphy has done is taken the clichés of everything from chief competitor Alan Ball's award-winning American BEAUTY and Stephen King's THE SHINING, put them on steroids and blended them together in his word processor. The result? American HORROR STORY, where the only thing more terrifying than a haunted house laden with secrets that rip people to shreds, are the secrets and lies infesting the lives of one family that threaten to rip THEM to shreds.\n\nWhen a tragic miscarriage and an even more shattering act of infidelity threaten to tear apart their tenuous marriage, Ben Harmon (THE PRACTICE'S Dylan McDermott) and his wife Vivien (FRIDAY NIGHT LIGHTS' Connie Britton) take their teenage daughter, Violet (Taissa Farmiga) and move away from their \"house of horrors\" to find a new start somewhere...ANYWHERE that they can put the noxious past behind them and at least try to have a go at tending to their gaping emotional wounds.\n\nThe place they choose - or maybe that chooses THEM - a run-down manse on the outskirts of L.A., turns out to be a real bargain, and though irredeemably creepy, does have an antiquated charm...if you're into murals that would give even Hieronymous Bosch nightmares.\n\nIn no short order, unsettling and strange characters - as much as the house itself is - begin to materialize and insinuate themselves into the Harmons' lives, whether they want them to or not: next-door neighbor Constance (Jessica Lange in a brilliant turn), whose demeanor suggests a deadly combo of Blanche DuBois, Norma Desmond and Gale Sondergaard's Black Widow; Frances Conroy (Ruth Fisher from SIX FEET UNDER) as the mysterious housekeeper, Moira, who appears to the rest of the family as one persona, while tempting Ben's weakness for \"a taste of strange\" with another more lascivious presence, (played by Alexandra Breckenridge); Larry Harvey (TRUE BLOOD alum Denis O'Hare), a horribly burned man who seems to be stalking Ben, and who has his own deadly history with the house and what lives there, and Constance's daughter, Adelaide, (Jamie Brewer), with Downs' Syndrome, yet who seems to have it more together - and knows more about the house - than anyone else around her.\n\nEven Ben's practice as a psychologist is fraught with peril, with the introduction of a teen patient named Tate Langdon (Evan Peters), who has an easier time picking apart and savaging the weaknesses in Ben's emotional armor than Ben does in probing his inscrutable and infuriating new charge's troubled mind. Not to mention that his growing fascination/infatuation with Violet doesn't help things one little bit.\n\nMany people have cried fowl about the show's penchant for relying heavily on old horror tropes and clichés, without even paying attention to how it has been taking said clichés and twisting them into newer and even more unsettling shapes than today's average hot mess passing itself off as a 'horror film.' Leave it to FX to allow Murphy and his team - much as they did with NIP/TUCK - the freedom to push the boundaries of where a horror-infused series can go, without the constraints that hog-tied many of the like-minded series that came before it, such as the ground-breaking TWIN PEAKS or American Gothic, (which wasn't anywhere near as well-written as this).\n\nTwo episodes in and I am already intrigued, grossed-out and frankly spooked by what I have seen so far. I just hope that the quality continues to get even better as plot lines and characters get darker and more deadly secrets are unearthed..."}, "trailer": {"@type": "VideoObject", "name": "\"AHS: 1984\" Official Trailer", "embedUrl": "/video/imdb/vi3484729113", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTc4NWU3YmEtODc5NC00NGRjLWEyYjUtNTcwMTk0YWQyMTVkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTc4NWU3YmEtODc5NC00NGRjLWEyYjUtNTcwMTk0YWQyMTVkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "The ninth season of \"American Horror Story\" travels back to 1984 to celebrate slasher genre.", "uploadDate": "2019-08-26T19:19:55Z"}, "EntryURL": "https://www.imdb.com/title/tt1844624", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/American-Horror-Story", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/American-Horror-Story/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/American-Horror-Story/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/American-Horror-Story/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/American-Horror-Story/thumb.jpg", "EntryAdded": "06-03-2020"}