{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0810988/", "name": "The Nines", "image": "https://m.media-amazon.com/images/M/MV5BMTI5ODI5MTUzN15BMl5BanBnXkFtZTcwOTIwMTE1MQ@@._V1_.jpg", "genre": ["Drama", "Fantasy", "Mystery", "Sci-Fi", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0005351/", "name": "Ryan Reynolds"}, {"@type": "Person", "url": "/name/nm0204706/", "name": "Hope Davis"}, {"@type": "Person", "url": "/name/nm0565250/", "name": "Melissa McCarthy"}, {"@type": "Person", "url": "/name/nm1102577/", "name": "Elle Fanning"}], "director": {"@type": "Person", "url": "/name/nm0041864/", "name": "John August"}, "creator": [{"@type": "Person", "url": "/name/nm0041864/", "name": "John August"}, {"@type": "Organization", "url": "/company/co0017834/"}, {"@type": "Organization", "url": "/company/co0021095/"}], "description": "The Nines is a movie starring Ryan Reynolds, Hope Davis, and Melissa McCarthy. A troubled actor, a television show runner, and an acclaimed videogame designer find their lives intertwining in mysterious and unsettling ways.", "datePublished": "2007-11-30", "keywords": "house arrest,screenwriter,fictional tv show,actress playing multiple roles,actor playing multiple roles", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 32291, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0810988/"}, "author": {"@type": "Person", "name": "standeman1984"}, "dateCreated": "2007-12-07", "inLanguage": "English", "name": "A predictable 9 for The Nines", "reviewBody": "I wrote this without reading any of the other reviews, mostly cos i didn't want them to influence my own, and partly cos i'm lazy. This was a very interesting film that left some to the imagination and a lot to interpretation (but not too much).\n\nThe film consists of 3 stories: the first about a house-arrested destructive TV star, the second a TV show writer with a new show in the works and the third a computer game creator stuck in the woods with his family. All three are played expertly by Ryan Reynolds. He is supported by two women, Hope Davis and Melissa McCarthy, who are also very good at enforcing the bizarre yet irresistible vision of John August, who has a good track record of writing screenplays, most notably with Tim Burton (it's worth ignoring the Charlie's Angels jobs though). The three leads play different parts in each. That alone should prepare you for the world he has created in The Nines.\n\nIt is difficult to talk of the story without giving too much away, John August has found a great concept and worked it brilliantly into a interpretable screenplay and image. The world he has created seems very real, with characters that operate in abnormal situations, but ones in which i think we all can relate, given our excessive access to reality TV and celebrity.\n\nThe direction is good, you know from the very start that the green woollen wristband holds significance, and the witty, experienced, inflective screen writing is a joy (though at times August gives a little more away than is necessary).\n\nThe film is a fantasy and the nines are a mystery, both collaborating in a way that captures the imagination. The three stories intersect and overlap with themes that confuse and inspire, which will leave many audiences pondering for awhile. But it is not as confusing as it may appear as the plot unfolds fairly intricately to those paying attention. All of the stories hold explanations, and the last explains it all.\n\nI saw this with a friend who i wasn't expecting to enjoy it, but surprisingly they did. I giggled, guffawed and gasped, while we exchanged plot ideas and interpretations, throughout. Sometimes it became a little dry, but on the whole this a very well thought out drama mystery thriller with an excellent philosophy.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H40M", "trailer": {"@type": "VideoObject", "name": "The Nines Trailer", "embedUrl": "/video/imdb/vi3014721817", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTQ2MDkxMDk5OV5BMl5BanBnXkFtZTgwMTg1NDczMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTQ2MDkxMDk5OV5BMl5BanBnXkFtZTgwMTg1NDczMzE@._V1_.jpg", "description": "A troubled actor, a television show runner, and an acclaimed videogame designer find their lives intertwining in mysterious and unsettling ways.", "uploadDate": "2007-09-05T11:23:00Z"}, "EntryURL": "https://www.imdb.com/title/tt0810988", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines/thumb.jpg", "EntryAdded": "2013-02-24"}