{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines", "EntryURL": "https://www.imdb.com/title/tt0810988", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Nines/thumb.jpg", "actor": [{"@type": "Person", "name": "Ryan Reynolds", "url": "/name/nm0005351/"}, {"@type": "Person", "name": "Hope Davis", "url": "/name/nm0204706/"}, {"@type": "Person", "name": "Melissa McCarthy", "url": "/name/nm0565250/"}, {"@type": "Person", "name": "Elle Fanning", "url": "/name/nm1102577/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 32287, "ratingValue": "6.3", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "John August", "url": "/name/nm0041864/"}, {"@type": "Organization", "url": "/company/co0017834/"}, {"@type": "Organization", "url": "/company/co0021095/"}], "datePublished": "2007-11-30", "description": "The Nines is a movie starring Ryan Reynolds, Hope Davis, and Melissa McCarthy. A troubled actor, a television show runner, and an acclaimed videogame designer find their lives intertwining in mysterious and unsettling ways.", "director": {"@type": "Person", "name": "John August", "url": "/name/nm0041864/"}, "duration": "PT1H40M", "genre": ["Drama", "Fantasy", "Mystery", "Sci-Fi", "Thriller"], "image": "https://m.media-amazon.com/images/M/MV5BMTI5ODI5MTUzN15BMl5BanBnXkFtZTcwOTIwMTE1MQ@@._V1_.jpg", "keywords": "house arrest,screenwriter,fictional tv show,actress playing multiple roles,actor playing multiple roles", "name": "The Nines", "review": {"@type": "Review", "author": {"@type": "Person", "name": "moviewizguy"}, "dateCreated": "2008-04-11", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0810988/"}, "name": "See The Nines", "reviewBody": "The film is divided in to three acts: \"The Prisoner\" tells of a troubled actor, Gary, under house arrest living in another person's house because he burned down his own. While living in the house he is befriended by both a P.R. 'handler', Margaret, and the single mom next door, Sarah, who may or may not be interested in him romantically. Over the course of his house arrest, Gary becomes convinced that he is being haunted by the number nine.\n\n\"Reality Television\" tells of a television writer, Gavin, trying to get his pilot made. The house he lives in is the house Gary later stays in. During the process of post production and the 'upfronts', a television executive, Susan, pushes for Gary to ditch the unconventional lead actress of his project, Melissa. This segment was somewhat inspired by writer/director John August's own experiences in the television industry.\n\n\"Knowing\" tells of an acclaimed video game designer, Gabriel, who is lost when his car breaks down, a situation shown in Gavin's pilot. Gabriel leaves his wife and daughter with the stranded vehicle and meets up with Sierra, a mysterious woman.\n\n\"The Nines\" is a film definitely worth watching, just for the weirdness of it and how thought-provoking and unlike any film you've ever seen. It's in the vein of, let's say, \"Being John Malkovich\" and \"Eternal Sunshine of the Spotless Mind.\" This is the film where you won't stop thinking about it and that you'll talk about it with the people who have seen it.\n\nIt's not a film that you'll forget after the credits start rolling. Now that you get the point, it's time to talk about the movie. Even so, it's hard to describe this movie in words. When you ask people if this movie is good or not, they'll either like it or not, but it's hard to explain their reason and it's hard to explain why I love this.\n\nThe performance by the three main characters from the three stories, Ryan Reynolds, Melissa McCarthy, and Hope Davis, were all fantastic, having themselves to change their personality so much. It's pretty amazing. But of course, the movie will arise more questions than answering them. It's like \"Donnie Darko,\" per se. This should be a cult hit, even though it isn't right now.\n\nThis is a really weird film and it's hard to explain anything, as you can tell. All I can say is watch it because the way the stories are told, the thought put into all of this, and the strong performances are already some reasons to watch it.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "8", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "A troubled actor, a television show runner, and an acclaimed videogame designer find their lives intertwining in mysterious and unsettling ways.", "embedUrl": "/video/imdb/vi3014721817", "name": "The Nines Trailer", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTQ2MDkxMDk5OV5BMl5BanBnXkFtZTgwMTg1NDczMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTQ2MDkxMDk5OV5BMl5BanBnXkFtZTgwMTg1NDczMzE@._V1_.jpg", "uploadDate": "2007-09-05T11:23:00Z"}, "url": "/title/tt0810988/"}