{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Her", "EntryURL": "https://www.imdb.com/title/tt1798709", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Her/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Her/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Her/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Her/thumb.jpg", "actor": [{"@type": "Person", "name": "Joaquin Phoenix", "url": "/name/nm0001618/"}, {"@type": "Person", "name": "Amy Adams", "url": "/name/nm0010736/"}, {"@type": "Person", "name": "Scarlett Johansson", "url": "/name/nm0424060/"}, {"@type": "Person", "name": "Rooney Mara", "url": "/name/nm1913734/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 514597, "ratingValue": "8.0", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Spike Jonze", "url": "/name/nm0005069/"}, {"@type": "Organization", "url": "/company/co0323215/"}], "datePublished": "2014-01-09", "description": "Her is a movie starring Joaquin Phoenix, Amy Adams, and Scarlett Johansson. In a near future, a lonely writer develops an unlikely relationship with an operating system designed to meet his every need.", "director": {"@type": "Person", "name": "Spike Jonze", "url": "/name/nm0005069/"}, "duration": "PT2H6M", "genre": ["Drama", "Romance", "Sci-Fi"], "image": "https://m.media-amazon.com/images/M/MV5BMjA1Nzk0OTM2OF5BMl5BanBnXkFtZTgwNjU2NjEwMDE@._V1_.jpg", "keywords": "loneliness,romance with artificial intelligence,future,artificial intelligence,relationship problems", "name": "Her", "review": {"@type": "Review", "author": {"@type": "Person", "name": "monkyman347"}, "dateCreated": "2013-12-29", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1798709/"}, "name": "Her is Spike Jonze's finest film yet", "reviewBody": "I've been a fan of Spike Jonze's films since I first saw Being John Malkovich. Although the wonderful script deserves some of the credit for making that film so great, it was immediately clear to me that Spike Jonze was a director with a fresh and imaginative perspective. His next film, the 2002 meta-comedy Adaptation, confirmed this with its dry wit and multilayered narrative. Now, after a slightly less successful (but still enjoyable) adaptation of Where The Wild Things Are, Spike Jonze has written and directed his most complete and poignant film yet, Her. \n\nThe story, taking place in a near future when people spend more time talking to their computers than they do to each other, stars Joaquin Phoenix as Theodore Twombly, a lonely man whose job is to write heartfelt personal letters for people not willing to do it themselves. Theodore happens to see an ad for a new computer operating system that is programmed with a personality, and decides to give it a shot. His new operating system Samantha, voiced by Scarlett Johansson, is not only intelligent but also charming and understanding, and she and Theo quickly fall in love.\n\nIt's understandable if that premise sounds bizarre on paper, but in execution Her is far more sweet than creepy. The film radiates warmth and intelligence, and there is a fair amount of witty humor to ensure that it never becomes too self-serious. It has an engaging style similar to that of Sofia Coppola's Lost In Translation. Like in that film, there's a certain poetic yet whimsical quality to the dialogue in Her and both the main characters are plagued by feelings of loneliness.\n\nBeyond the romance though, Her has a lot to say about modern society's obsession with technology. The people in this futuristic vision of Los Angeles walk around talking to their computers and ignoring each other entirely, not unlike people today staring at their cell phones rather than talking to those around them. Needless to say it's not a wildly original message, but it's communicated in a unique enough way that it works.\n\nI've seen Her twice now, and the more I think about it the more I feel that Spike Jonze has crafted the best film of 2013. Her is equally heartfelt and heartbreaking, a deeply personal and thoroughly enjoyable futuristic love story.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "9", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "A lonely writer develops an unlikely relationship with his newly purchased operating system that's designed to meet his every need.", "embedUrl": "/video/imdb/vi4112492569", "name": "Trailer #2", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjI3ODI3Nzg3Ml5BMl5BanBnXkFtZTgwMTY3NzQ3MDE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjI3ODI3Nzg3Ml5BMl5BanBnXkFtZTgwMTY3NzQ3MDE@._V1_.jpg", "uploadDate": "2013-12-06T14:15:10Z"}, "url": "/title/tt1798709/"}