{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0182576/", "name": "Family Guy", "image": "https://m.media-amazon.com/images/M/MV5BODEwZjEzMjAtNjQxMy00Yjc4LWFlMDAtYjhjZTAxNDU3OTg3XkEyXkFqcGdeQXVyOTM2NTM4MjA@._V1_.jpg", "genre": ["Animation", "Comedy"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm0532235/", "name": "Seth MacFarlane"}, {"@type": "Person", "url": "/name/nm0097504/", "name": "Alex Borstein"}, {"@type": "Person", "url": "/name/nm0001293/", "name": "Seth Green"}, {"@type": "Person", "url": "/name/nm0005109/", "name": "Mila Kunis"}], "creator": [{"@type": "Person", "url": "/name/nm0532235/", "name": "Seth MacFarlane"}, {"@type": "Person", "url": "/name/nm0958412/", "name": "David Zuckerman"}, {"@type": "Organization", "url": "/company/co0056447/"}, {"@type": "Organization", "url": "/company/co0065872/"}, {"@type": "Organization", "url": "/company/co0159275/"}], "description": "Family Guy is a TV series starring Seth MacFarlane, Alex Borstein, and Seth Green. In a wacky Rhode Island town, a dysfunctional family strive to cope with everyday life as they are thrown from one crazy scenario to another.", "datePublished": "1999-01-31", "keywords": "sexual reference,sexual innuendo,animal as human,pedophile,derivative", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 296189, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0182576/"}, "author": {"@type": "Person", "name": "Film-Reviewer"}, "dateCreated": "2003-05-25", "inLanguage": "English", "name": "The Smartest Show That Was On TV", "reviewBody": "'Family Guy' is my all time favorite show. But I'm going to admit that the family does bear some personality resemblances to 'The Simpsons' especially mom and dad Peter (Seth MacFarlane) and Lois (Alex Borstein) but when you get past these obvious comparisons, 'Family Guy' is a brilliant show on it's own. Sure, it has toilet humour but that's paid off with a very smart joke soon after. Although on the outside it may look stupid, like the show 'Jackass' the brains behind it are smart and this show especially is the wittiest of satires. The story of this show is the seemingly normal Griffin family. Father Peter is a loud mouthed idiot (Even more so than infamous Homer Simpson) who's racist, sexist and increasingly vulgar. His wife Lois is just trying to relax among all the madness and dreams of becoming a famous piano player. The youngest in the family is adorable baby Stewie (Seth MacFarlane again) who is rather vulgar, speaks with a comical accent and is planning to kill his mother and rule the world. Their son Chris (Seth Green) is, like his father, potty mouthed and has an intense fascination with the opposite sex yet he seems to be very child like underneath and always tries to proves that there's an evil monkey operating in his closet. Daughter Meg (Lacy Chabert) is slightly smarter but hates her family and is the biggest geek in class. To top it off we have talking dog Brian (Seth MacFarlane... yet again) who is the smartest in the family but does get a bit drunk once in a while. Add to that, the former Batman Adam West as a neurotic Mayor who's convinced people are stealing his water in the sink and a whole town filled with dim wits and strange faces including the violent news anchors Tom and Diane. What does that give you? 'Family Guy' of course! Seth MacFarlane is mainly to thank for creating such an accomplished show. The humour is always to do with the moment and there are frequent parodies of current events. Sadly, this show was cancelled way too early mainly because Fox was always changing air dates and never gave it a proper time slot causing it to fade off the radar but as the sales of the new DVD have proved (Most stores were sold out on the first day), there is a huge audience for 'Family Guy' and, as of late, creator MacFarlane has hinted that we may see a big screen adventure in a few years time. R.I.P. Family Guy!"}, "trailer": {"@type": "VideoObject", "name": "#3", "embedUrl": "/video/imdb/vi2124066585", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjM2MDc0NzQ2N15BMl5BanBnXkFtZTgwODUwMDEyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjM2MDc0NzQ2N15BMl5BanBnXkFtZTgwODUwMDEyMzE@._V1_.jpg", "description": "Watch a scene from the \"Family Guy\"/\"Simpsons\" crossover, \"Simpsons Guy\".", "uploadDate": "2014-09-25T12:07:11Z"}, "EntryURL": "https://www.imdb.com/title/tt0182576", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Family-Guy", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Family-Guy/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Family-Guy/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Family-Guy/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Family-Guy/thumb.jpg", "EntryAdded": "2011-08-19"}