{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt4126304/", "name": "Cartel Land", "image": "https://m.media-amazon.com/images/M/MV5BMjE1MzI2MzcxOV5BMl5BanBnXkFtZTgwNTE2Mjk4NTE@._V1_.jpg", "genre": ["Documentary", "News"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm8166127/", "name": "Tim Nailer Foley"}, {"@type": "Person", "url": "/name/nm7858356/", "name": "José Manuel 'El Doctor' Mireles"}, {"@type": "Person", "url": "/name/nm8483522/", "name": "Paco Valencia"}, {"@type": "Person", "url": "/name/nm8483523/", "name": "Chaneque"}], "director": {"@type": "Person", "url": "/name/nm1292648/", "name": "Matthew Heineman"}, "description": "Cartel Land is a movie starring Tim Nailer Foley, José Manuel 'El Doctor' Mireles, and Paco Valencia. Filmmaker Matthew Heineman examines the state of the ongoing drug problem along the U.S.-Mexican border.", "datePublished": "2015-07-03", "creator": [{"@type": "Organization", "url": "/company/co0152564/"}, {"@type": "Organization", "url": "/company/co0299372/"}, {"@type": "Organization", "url": "/company/co0202303/"}, {"@type": "Organization", "url": "/company/co0109361/"}], "keywords": "arizona desert,sonora mexico,arrest,drug,gunfire", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 17445, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4126304/"}, "author": {"@type": "Person", "name": "laweat"}, "dateCreated": "2015-07-13", "inLanguage": "English", "name": "Questionable Point of View", "reviewBody": "This moving and compelling documentary paints a vivid picture of the tragic situation involving the cartels, police, military, government, and citizens of Mexico. This story is too little known north of the border, and that's why this documentary is important and should be seen. The director's bravery in obtaining some amazing footage is to be commended.\n\nHowever, in my opinion the filmmaker has made a serious and even offensive misstep in trying to create a parallel between the vigilantes of the Autodefensas and the vigilantes of the Arizona Border Recon. Quoting from the doc's website, the premise is that these groups \"vie to bring their own brand of justice to a society where institutions have failed.\" \n\nIt's abundantly clear that in Mexico, to put it as neutrally as possible, institutions (government, police, military) have failed to protect citizens from cartel- sponsored violence. The tragic consequences of this failure are made disturbingly real in the film.\n\nHowever, the idea that U.S. government, police, and military have failed to protect the citizens of Arizona from cartel-sponsored violence is just absurd. Worse, by comparing a flawed Mexican leader who is apparently sincerely trying to address a horrific situation to a flawed American \"leader\" who is off on some crackpot right-wing conspiracy theory where the danger is mostly in his head, the film ends up insulting the actual pain and suffering experienced by the people of Mexico. However much the Arizona guy wants to say he's really focusing on the cartel's activity in the Arizona desert (how does that work, again?), his true motive is to stop people from crossing the border because he has an anti-immigration ax to grind. However you feel about immigration, U.S.-based anti- immigrant vigilantism is not analogous to the motives or efforts of the Autodefensas. Comparing the two insults the Mexican people's suffering and the Autodefensas courage, however flawed their leaders and unsuccessful their efforts may be.\n\nIf the filmmaker wanted to bring in important information from the U.S. side of the border, he might have tried providing some information about how our government's \"War on Drugs\" has paralleled the cartel's rise (coincidence?), or the blood that's on our hands because we're the ones buying the drugs.\n\nInstead, he makes a false parallel with a group of anti-immigrant wingnuts. If you want to make a documentary to show that anti- immigrant wingnuts are people too, go ahead, but don't try to compare the Arizona Border Recon to the Autodefensas. That's not an intellectually fascinating parallel, as the filmmaker apparently believes. It's just pretentious and, really, disgusting.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H40M", "trailer": {"@type": "VideoObject", "name": "Cartel Land", "embedUrl": "/video/imdb/vi2916268057", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYThlOWRkN2QtODE4Zi00OWMxLWJhNzgtZmFkMzE2MjNjOTZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYThlOWRkN2QtODE4Zi00OWMxLWJhNzgtZmFkMzE2MjNjOTZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for Cartel Land", "uploadDate": "2018-02-01T17:05:08Z"}, "EntryURL": "https://www.imdb.com/title/tt4126304", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Cartel-Land", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Cartel-Land/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Cartel-Land/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Cartel-Land/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Cartel-Land/thumb.jpg"}