{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt4686844/", "name": "The Death of Stalin", "image": "https://m.media-amazon.com/images/M/MV5BMTcxMDc1NjcyNl5BMl5BanBnXkFtZTgwNDU0NDYxMzI@._V1_.jpg", "genre": ["Comedy", "Drama", "History"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000114/", "name": "Steve Buscemi"}, {"@type": "Person", "url": "/name/nm0750971/", "name": "Simon Russell Beale"}, {"@type": "Person", "url": "/name/nm0001787/", "name": "Jeffrey Tambor"}, {"@type": "Person", "url": "/name/nm2057859/", "name": "Andrea Riseborough"}], "director": {"@type": "Person", "url": "/name/nm0406334/", "name": "Armando Iannucci"}, "creator": [{"@type": "Person", "url": "/name/nm0406334/", "name": "Armando Iannucci"}, {"@type": "Person", "url": "/name/nm0773768/", "name": "David Schneider"}, {"@type": "Person", "url": "/name/nm2254846/", "name": "Ian Martin"}, {"@type": "Person", "url": "/name/nm4397668/", "name": "Peter Fellows"}, {"@type": "Person", "url": "/name/nm1942997/", "name": "Fabien Nury"}, {"@type": "Person", "url": "/name/nm2934300/", "name": "Thierry Robin"}, {"@type": "Person", "url": "/name/nm1942997/", "name": "Fabien Nury"}, {"@type": "Organization", "url": "/company/co0098808/"}, {"@type": "Organization", "url": "/company/co0595884/"}, {"@type": "Organization", "url": "/company/co0178269/"}, {"@type": "Organization", "url": "/company/co0044140/"}, {"@type": "Organization", "url": "/company/co0384091/"}, {"@type": "Organization", "url": "/company/co0244390/"}, {"@type": "Organization", "url": "/company/co0028557/"}, {"@type": "Organization", "url": "/company/co0641111/"}, {"@type": "Organization", "url": "/company/co0354373/"}, {"@type": "Organization", "url": "/company/co0009204/"}, {"@type": "Organization", "url": "/company/co0396761/"}], "description": "The Death of Stalin is a movie starring Steve Buscemi, Simon Russell Beale, and Jeffrey Tambor. Moscow, 1953. After being in power for nearly thirty years, Soviet dictator Joseph Vissarionovich Stalin (Adrian McLoughlin) takes ill...", "datePublished": "2017-10-20", "keywords": "satire,black comedy,soviet union,nikita khrushchev character,based on comic book", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 78945, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4686844/"}, "author": {"@type": "Person", "name": "TheLittleSongbird"}, "dateCreated": "2017-10-22", "inLanguage": "English", "name": "One of the best films of 2017", "reviewBody": "It must have been very daunting to make a film revolving around the period during the death of one of the world's most notorious dictators and mass murderers Joseph Stalin and its aftermath, and make it one that was entertaining, clever and beautifully produced and acted while not trivialising the horrors of the time.\n\n'The Death of Stalin' embraced this challenge and fully succeeded in its goal. 'The Death of Stalin' was one of those films where expectations were high (considering there are some truly great actors here) and those expectations were only met but exceeded. It won't be for the faint hearted, it can be violent in a very gruesome sense. While it is very evocative and well-researched, it is history but not quite as we know it (kind of like a more sophisticated version of Horrible Histories). Some may have a problem with the film not having authentic Soviet accents, and instead a mix of English and US ones, to me this was not a problem as there are many adaptations of Russian literature that mostly don't attempt authentic accents and when they are attempted it has wildly variable results.\n\n2017 has been a very hit and miss year from personal opinion for films. Some very good to great films and also some less than average to rubbish ones, as well as ones that fall somewhere in between. Some may say that for any year in film, but to me 2017 was one of the most hit and miss. 'The Death of Stalin' is a clear highlight. Didn't find that much wrong with it, the character of Svetlana is not as interesting and doesn't have the same depth as the rest of the characters perhaps but this is compensated by Andrea Riseborough still making the most of what she has. The occasional clunker in the writing too but they are vastly out shadowed by the rest of the script being so good.\n\nEven with a couple of minor reservations, 'The Death of Stalin' as said succeeds in achieving a very difficult task and achieving an ideal balance. Despite how it sounds it is not even close to being as offensive as it easily could have been, making something funny out of one of the darkest (maybe the darkest though it's not in a particularly good, if nowhere near as terrible, state now either periods for Russia/The Soviet Union)on paper does not sound tasteful, but 'The Death of Stalin' splendidly works its way around that potential issue.\n\nVisually, 'The Death of Stalin' looks beautiful. The settings and costumes are meticulous in detail and evocative, a lot of homework went into recreating this period, looking both sumptuous and atmospheric. The cinematography is fluid and natural and has the right amount of grit and audaciousness. The music has a mix of the rousing and understated.\n\nArmando Iannucci directs with complete command and control of the subject, his trademark touches of political amorality and dark and sometimes broad but witty and offbeat humour come through loud and clear. He doesn't try to soften reality, nor does he try to make it one big joke, he could easily have done that but he doesn't and he deserves a lot of credit for that.\n\nFurther good things are a clever script that has genuinely funny moments and also some truly thought-provoking ones. As soon as the opening sequence begins and happens one knows they're in for a treat. 'The Death of Stalin' is never dull and is hugely entertaining but also has a darker edge in exploring the full terror of Soviet life during the Great Terror, struggle for power and the purge and not trivialising it, it's actually pretty harrowing and poignant.\n\nOne cannot talk about 'The Death of Stalin' without mentioning the uniformly outstanding cast, the standouts being Simon Russell Beale giving a performance of almost Shakespearean complexity and Steve Buscemi who bags some of the best moments.\n\nJason Isaacs steals scenes when he appears (and Paddy Considine delights in his), Andrea Riseborough makes the most of her role and Rupert Friend being this good was a pleasant surprise. Michael Palin is indeed more subdued form than usual but it suited the character and he does it perfectly, personally like that side to him. Jeffrey Tambor is great fun and Olga Kurylenko is expressive.\n\nSummarising, really great and one of 2017's best films. 9/10 Bethany Cox", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H47M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi1778169881", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzNjYWE2OWUtNWE5Zi00MGFkLTkxNmUtM2JjOGI4MWUzYTBjXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzNjYWE2OWUtNWE5Zi00MGFkLTkxNmUtM2JjOGI4MWUzYTBjXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg", "description": "In the days following Stalin's collapse, his core team of ministers tussle for control; some want positive change in the Soviet Union, others have more sinister motives. Their one common trait? They're all just desperately trying to remain alive.", "uploadDate": "2018-01-17T21:00:25Z"}, "Title": "The Death of Stalin", "EntryURL": "https://www.imdb.com/title/tt4686844", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Death-Of-Stalin", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Death-Of-Stalin/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Death-Of-Stalin/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Death-Of-Stalin/entry.json"}