{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2179136/", "name": "American Sniper", "image": "https://m.media-amazon.com/images/M/MV5BMTkxNzI3ODI4Nl5BMl5BanBnXkFtZTgwMjkwMjY4MjE@._V1_.jpg", "genre": ["Action", "Biography", "Drama", "War"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0177896/", "name": "Bradley Cooper"}, {"@type": "Person", "url": "/name/nm1092227/", "name": "Sienna Miller"}, {"@type": "Person", "url": "/name/nm0973177/", "name": "Kyle Gallner"}, {"@type": "Person", "url": "/name/nm6518675/", "name": "Cole Konis"}], "director": {"@type": "Person", "url": "/name/nm0000142/", "name": "Clint Eastwood"}, "creator": [{"@type": "Person", "url": "/name/nm0355699/", "name": "Jason Hall"}, {"@type": "Person", "url": "/name/nm4881574/", "name": "Chris Kyle"}, {"@type": "Person", "url": "/name/nm6984200/", "name": "Scott McEwen"}, {"@type": "Person", "url": "/name/nm7198520/", "name": "Jim DeFelice"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0108864/"}, {"@type": "Organization", "url": "/company/co0449458/"}, {"@type": "Organization", "url": "/company/co0034487/"}, {"@type": "Organization", "url": "/company/co0373725/"}, {"@type": "Organization", "url": "/company/co0010258/"}, {"@type": "Organization", "url": "/company/co0176310/"}], "description": "American Sniper is a movie starring Bradley Cooper, Sienna Miller, and Kyle Gallner. Navy S.E.A.L. sniper Chris Kyle's pinpoint accuracy saves countless lives on the battlefield and turns him into a legend. Back home with his family...", "datePublished": "2015-01-01", "keywords": "assassin,violence,iraq war,sniper,mercenary", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 424404, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2179136/"}, "author": {"@type": "Person", "name": "Michael_Elliott"}, "dateCreated": "2015-02-10", "inLanguage": "English", "name": "Top-Notch Directing and a Marvelous Lead Performance", "reviewBody": "American Sniper (2014) \n\n**** (out of 4)\n\nThrilling, tense and dramatic telling of Chris Kyle's (Bradley Cooper) rise from a cowboy without much direction in his life to becoming the deadliest sniper in U.S. history.\n\nDirector Clint Eastwood has made countless great movies in his career and even tackled the war drama in brilliant fashion with LETTERS FROM IWO JIMA. This film here could have been clichéd in so many ways but thankfully a director with such masterful direction can take a familiar story like war and its impact on someone and make it feel fresh, tight and original. Since movies began, the war genre has been one of the most popular and they continue to pump them out yearly so trying to find a fresh way to tell a story is always a challenge but Eastwood and company really pull it off.\n\nAmerican SNIPER is certainly about the war but it's main focus is telling the story of this American hero. The main goal of the screenplay is to show people what a special person Kyle was and balancing his personal drama and the war stuff was so wonderfully done that both story lines contained some real drama and one wasn't overshadowed by the other. I think that's the most accomplished thing Eastwood does here. Making sure that the war at home is just as intense as the war in Iraq. Another major plus is that, on a technical level, the film is flawless as it contains some of the year's best cinematography, a touching music score and some of the best sound effects out there.\n\nThe wartime scenes are all shot extremely well and I think the best thing about them is the feeling the director shows in the fact that these men are really in a trap not knowing where the next bullet is going to come from. The scenes of Kyle doing his job were full of tension as were the scenes where we get more gunfire. There's a sequence early on, highlighted in the trailer, were a kid possibly has a bomb and this here is perfectly handled. The ending is also incredibly intense and the terrific editing here really helps build up the tension of the combat zone.\n\nWhat really pushes the movie from the opening scene to the very last is the terrific performance by Cooper who turns in his greatest work to date. I'm not sure how many people could have predicted that Cooper, who was mostly playing comedy roles, would turn into such a fine dramatic actor but he's turning into one of the most dependable actors out there. He's simply wonderful here and manages to really come across as a tortured person. The film shows Kyle from various points in his life. His wild younger days. His rise through the Seals. Of course, some of the most talked about scenes deal with the depression and anxiety that starts to set in. We've seen many actors deal with the \"struggling vet returning home\" and Cooper manages to bring a real depth to the character.\n\nAmerican SNIPER isn't going to end up being the best movie on 2014 but it's certainly a very impressive film. Technically it's quite sound and Eastwood once again proves why he's one of the greatest director's out there. As for Cooper's performance, it's certainly a terrific one and overall this is a great film that leaves the viewer with a lot to think about and be thankful for."}, "duration": "PT2H13M", "trailer": {"@type": "VideoObject", "name": "Theatrical Trailer", "embedUrl": "/video/imdb/vi3484134937", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTg0ODI0NDY5M15BMl5BanBnXkFtZTgwMTc3MTU3MzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTg0ODI0NDY5M15BMl5BanBnXkFtZTgwMTc3MTU3MzE@._V1_.jpg", "description": "Navy SEAL sniper Chris Kyle's pinpoint accuracy saves countless lives on the battlefield and turns him into a legend. Back home to his wife and kids after four tours of duty, however, Chris finds that it is the war he can't leave behind.", "uploadDate": "2014-12-19T10:52:37Z"}, "EntryURL": "https://www.imdb.com/title/tt2179136", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/American-Sniper", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/American-Sniper/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/American-Sniper/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/American-Sniper/thumb.jpg", "EntryAdded": "2015-01-18"}