{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt4382552/", "name": "Hot Girls Wanted", "image": "https://m.media-amazon.com/images/M/MV5BMTcyMjU5NjAwN15BMl5BanBnXkFtZTgwOTM1MTc4NTE@._V1_.jpg", "genre": "Documentary", "actor": [{"@type": "Person", "url": "/name/nm4766272/", "name": "Farrah Laurel Abraham"}, {"@type": "Person", "url": "/name/nm7361618/", "name": "John Anthony"}, {"@type": "Person", "url": "/name/nm6367070/", "name": "Rachel Bernard"}, {"@type": "Person", "url": "/name/nm6844809/", "name": "Carrie Brooks"}], "director": [{"@type": "Person", "url": "/name/nm4991098/", "name": "Jill Bauer"}, {"@type": "Person", "url": "/name/nm4991143/", "name": "Ronna Gradus"}], "creator": [{"@type": "Person", "url": "/name/nm1628158/", "name": "Brittany Huckabee"}, {"@type": "Organization", "url": "/company/co0376609/"}], "description": "Hot Girls Wanted is a movie starring Farrah Laurel Abraham, John Anthony, and Rachel Bernard. A documentary about young women who have been drawn into the sex trade - and how easy it is for a web-savvy generation to end up making...", "datePublished": "2015-05-29", "keywords": "freedom of choice,porn actress,victimization porn,exploring sexuality,independent woman", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 15064, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4382552/"}, "author": {"@type": "Person", "name": "MartinHafer"}, "dateCreated": "2015-06-05", "inLanguage": "English", "name": "Perhaps really, really dumb instead of being exploited in many cases.", "reviewBody": "When I saw that a new documentary just came out and it was gaining a lot of attention in social media, I assumed I knew what the film would be--about countless women being exploited by evil pimp-like guys. Well, the truth for the women in this picture was quite a bit different. Sad, but very different.\n\nA camera crew somehow was allowed into a home owned by a young entrepreneur named Riley. Riley recruits girls 18-25 from Craigslist. However, he doesn't trick them in any way--he offers them airplane tickets to his home in Miami and they move there specifically to make porn. The home is filled with a half dozen or so aspiring 'actresses' and the crew interviews them and follows them on some of their jobs. They are there to have sex on camera and supposedly live an exciting life in the sun.\n\nThe part about all this that surprised me is that the film does NOT show strung-out drug addicts or illegal aliens forced into sex slavery. Instead, the girls seem to come from rather normal backgrounds and they want to be porn stars for fast money--bored girls with no thoughts about tomorrow. And, while I am sure some will find my words harsh, they seem incredibly vacuous and selfish. AIDS, pregnancy and the realities of the industry seemed irrelevant to these stars. They are simply out to have a good time and that's all that matters to them...end of story. This brings us to a major weakness in the film. You really don't care about these ladies because they all seemed to know exactly what they were getting into and they weren't very nice folks. They seem completely amoral and self-absorbed, so it really was hard to find much in the way of meaning to all this. As a father of two daughters, I was horrified by these women and their attitudes...but felt at least in these stories, they were involved with their eyes wide open...at least most of the time. The proliferation of rape and violence porn came as a surprise to me and some of them, as their fun lives (as they put it) stopped being fun when they were deliberately hurt or completely degraded in a few of the films. This part was a bit shocking as well as quite sad--and this was one case where I did feel for a couple of the girls, as they were raped or nearly raped to satisfy some guys' bizarre fantasies.\n\nOverall, this film is mildly interesting but overly long. I really think with some editing, it would have been a more impactful film. As it is, I just found myself a bit bored with some of the girls' stories, though I was at least happy to see that a few of them chose to leave this self-imposed life. Technically, the camera-work was okay and the viewing experience was much like watching a reality TV show as opposed to a typical documentary. Interestingly, the film's executive producer is Rashida Jones--yes, Quincy Jones' daughter and who played Ann on Parks and Recreation. You can watch it streaming on Netflix if you'd like.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H24M", "trailer": {"@type": "VideoObject", "name": "Hot Girls Wanted - Documentary on Netflix", "embedUrl": "/video/imdb/vi87601177", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjQxMjM2NjQwNV5BMl5BanBnXkFtZTgwOTQxOTk4NTE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjQxMjM2NjQwNV5BMl5BanBnXkFtZTgwOTQxOTk4NTE@._V1_.jpg", "description": "Official Trailer", "uploadDate": "2015-06-05T08:01:50Z"}, "EntryURL": "https://www.imdb.com/title/tt4382552", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Hot-Girls-Wanted", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Hot-Girls-Wanted/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Hot-Girls-Wanted/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Hot-Girls-Wanted/thumb.jpg", "EntryAdded": "06-03-2020"}