{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt8005374/", "name": "Explained", "image": "https://m.media-amazon.com/images/M/MV5BNjU1NzYwMmQtMjEzMS00ODEzLWIxNzAtYjI3M2QwYWFmMTIwXkEyXkFqcGdeQXVyNDA4NzUyMzg@._V1_.jpg", "genre": "Documentary", "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm3490204/", "name": "Estelle Caswell"}, {"@type": "Person", "url": "/name/nm0004742/", "name": "Maria Bello"}, {"@type": "Person", "url": "/name/nm0068338/", "name": "Kristen Bell"}, {"@type": "Person", "url": "/name/nm3417385/", "name": "Rachel Bloom"}], "creator": [{"@type": "Person", "url": "/name/nm3438051/", "name": "Joe Posner"}, {"@type": "Person", "url": "/name/nm3831303/", "name": "Ezra Klein"}, {"@type": "Organization", "url": "/company/co0402466/"}], "description": "Explained is a TV series starring Estelle Caswell, Maria Bello, and Kristen Bell. A documentary series that looks to explore the big questions of today.", "datePublished": "2018-05-09", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 5697, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt8005374/"}, "author": {"@type": "Person", "name": "knoxfan2008"}, "dateCreated": "2018-07-19", "inLanguage": "English", "name": "Entertaining, but it's not as informative as you'd expect. Ultimately superfluous", "reviewBody": "Surprise! Turns out that condensing decades or even hundreds of years of history into 15-20 minute chunks with poppy editing is not exactly the best way to learn about a topic. This show is wonderfully entertaining and does what VOX does best, make short videos about topics that most people have heard of but don't exactly understand. \n\nWhen I watched the \"K-Pop\" episode along with others like \"e-sport\" or \"the stock market\" I was absolutely intrigued. They are fiercely interesting 20 minutes that seemingly gave me the gist of what the subject matter was. However, after watching the new episode on \"Cricket\" I realised that the other episodes I loved so much is to be taken with a huge grain of salt. Almost any cricket fan would watch the Cricket episode and be confused with how the episode focuses on India and Twenty20 cricket to the exclusion of almost everything else. Not even The Ashes, Bodyline, the evolution of batting gear, or any of the million interesting factoids about the games' chess-like gameplay are mentioned. \n\nVox dishonestly portrays test cricket as a thing of the past, when in every cricket nation (including India) it is still the most prestigious form of the game. But because T20 is flashier, Vox focuses almost exclusively on it, cheekily implying that T20 is what the majority of the fans are fixated on, which is the exact opposite from the truth. It's frustrating that any laymen interested in learning about cricket is instead going to have 5 minutes of the rules explained to them, and then 10 minutes of a narrative pushed on them that is so over simplified and in the end has more to do with business and marketing than it does the actual sport. In a game that is as universally adored as football, VOX focuses almost entirely on the most narrow of stories. It's not about the subject, it's about a fluffed up narrative that covers less than 1% of the actual narrative. It would be as if VOX released a documentary about football that entirely neglected to mention the EPL or the World Cup. \n\nSo I've watched the show and found it fun and interesting. However, I am not going to take it as anything more than a superficial look at subjects Vox themselves only have a passing knowledge of. There are a million other documentaries on Netflix you can watch that are more in-depth, honest and intelligent. I admire their attempts to branch out, but until Vox stops caring about visuals over facts, they should stick to their short youtube videos, which is where their best work has been done, the best episodes of this show are just normal Vox videos with a bit of filler in them to get them to the 15-20 minute mark.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "trailer": {"@type": "VideoObject", "name": "Explained: Season 2", "embedUrl": "/video/imdb/vi4036542233", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTgxMTk3MzEtNjdiNi00MWZhLTgyZWEtYjU1YWQ0MzlmY2JiXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTgxMTk3MzEtNjdiNi00MWZhLTgyZWEtYjU1YWQ0MzlmY2JiXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg", "description": "Explained: Season 2", "uploadDate": "2019-09-21T13:02:25Z"}, "EntryURL": "https://www.imdb.com/title/tt8005374", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Explained", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Explained/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Explained/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Explained/thumb.jpg", "EntryAdded": "06-03-2020"}