{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1495980/", "name": "The Last Days of Lehman Brothers", "image": "https://m.media-amazon.com/images/M/MV5BN2Q5MDc5YTktNGE2NS00YzQ1LWI1Y2ItMTc1MWVjNjNlNWQ1L2ltYWdlXkEyXkFqcGdeQXVyMDkzOTgyNw@@._V1_.jpg", "genre": "Drama", "actor": [{"@type": "Person", "url": "/name/nm0424819/", "name": "Corey Johnson"}, {"@type": "Person", "url": "/name/nm0000342/", "name": "James Cromwell"}, {"@type": "Person", "url": "/name/nm1507556/", "name": "David Annen"}, {"@type": "Person", "url": "/name/nm0092639/", "name": "James Bolam"}], "director": {"@type": "Person", "url": "/name/nm0760499/", "name": "Michael Samuels"}, "creator": [{"@type": "Person", "url": "/name/nm0912438/", "name": "Craig Warner"}, {"@type": "Organization", "url": "/company/co0043107/"}], "description": "The Last Days of Lehman Brothers is a TV movie starring Corey Johnson, James Cromwell, and David Annen. The heads of Wall Street's biggest investment banks were summoned to an evening meeting by the US Treasury Secretary, Hank...", "datePublished": "2009-09-09", "keywords": "investment bank,ceo,financial crisis,secretary of the treasury", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 460, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1495980/"}, "author": {"@type": "Person", "name": "sol-kay"}, "dateCreated": "2010-06-12", "inLanguage": "English", "name": "This may well mean the end of civilization as we know it!", "reviewBody": "***SPOILERS*** Heart pounding but true story of the collapses of one of the nations major banking intuitions Lehman Brothers. A bank that's been in business since before the American Civil War.\n\nIt's Friday afternoon September 12, 2008 and Lehman's Bros. CEO the by now on the verge of an emotional breakdown Dick Fuld, Corey Johnson, has until the end of this long and nerve wracking weekend to save his beloved company. Thats before it goes bust at the opening of trading on Monday, D-Day, September 15, 2008. With the biggest brains on Wall Street assembled in downtown Manhattan to save Lehman Bros. US Treasury Secretary Henry \"Hank\" Paulsen, James Cromwell, is to see that everything is done to keep Lehman Bros from going under the waves of red ink and toxic assets that it had accumulated over the last five years. That short of declaring a national emergency by the Presidet that would suspend trading that following and fateful Monday morning.\n\nIt's at that meeting that the very unstable and outspoken Fuld wasn't allowed to attend, in order not to make things even worse then they already are, that's it's decided by Secretary Paulsen to bail out Lehman Bros. with private, from the bankers present, not government or tax payer money.\n\nAs the hours tic away with Monday September 15, 2008 about to dawn a ray of hope comes into the boardroom with British bank Barclay willing to buy up Lehman Bros at bargain basement prices. That would keep it from filing bankruptcy the following Monday with it's stock expected to plummet to practically zero per share! With everything going good for both Lehman Bros. and it's by now almost straight jacketed CEO Dick Fuld the deal falls through with the British Government refusing to back the Braclay/Lehman deal thus killing it: As well as Lehman Bros who's very existence depended on it!\n\nThe Lehman Bros. collapse would set off a tidal wave of bankruptcies all throughout the financial world in the coming days weeks and months after its demise. This would not only put 25,000 of Lehman's employees out of work but evaporated its some 650 billion dollars, more then the GDP of many industrialized countries, in stock and real estate assets! The stock market together with Lehman Bros was the first to feel the effects of the Lehman Bros. collapse by it dropping over 500 points on September 15, 2008 the date that Lehman Bros. announced it was failing for bankruptcy. In the coming months millions of people in the financial world as well as in those companies dependent on Lehman Bros. loan and borrowing policies lost their jobs and business with the market dropping an astounding -53.8%, from 14164 to 6547, in just under 18 months! The worst Wall Street stock market drop in such a short period of time since the darkest days of the 1930's Great Depression!\n\nThe sad thing about this major financial disaster that almost destroyed the banking institutions of the entire world is that the same John Paulsen who refused to bail out Lehman Bros. with government money and let It twist on the vine later, in less then two weeks, came up with this plan to save the US economy with almost a trillion dollars in what was mostly money that the government didn't have! In the end, as of now June 2010, Paulsen's and the US National Reserve policies did save and stabilize the US and the world economies but they came a bit too late, some two weeks too late, to save Lehman Bos!", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H", "EntryURL": "https://www.imdb.com/title/tt1495980", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Last-Days-of-Lehman-Brothers", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Last-Days-of-Lehman-Brothers/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Last-Days-of-Lehman-Brothers/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Last-Days-of-Lehman-Brothers/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Last-Days-of-Lehman-Brothers/thumb.jpg", "EntryAdded": "2011-12-31"}