{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0367153/", "name": "Toolbox Murders", "image": "https://m.media-amazon.com/images/M/MV5BYTE5YTUyNmMtNGFiOS00YmIyLTkzZjYtMWUyN2E3NGIzOWQxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Horror", "Mystery", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0079374/", "name": "Angela Bettis"}, {"@type": "Person", "url": "/name/nm0730099/", "name": "Brent Roam"}, {"@type": "Person", "url": "/name/nm0735424/", "name": "Marco Rodríguez"}, {"@type": "Person", "url": "/name/nm0397555/", "name": "Rance Howard"}], "director": {"@type": "Person", "url": "/name/nm0001361/", "name": "Tobe Hooper"}, "creator": [{"@type": "Person", "url": "/name/nm0026829/", "name": "Jace Anderson"}, {"@type": "Person", "url": "/name/nm0317368/", "name": "Adam Gierasch"}, {"@type": "Organization", "url": "/company/co0485497/"}, {"@type": "Organization", "url": "/company/co0107106/"}, {"@type": "Organization", "url": "/company/co0003056/"}, {"@type": "Organization", "url": "/company/co0107105/"}], "description": "Toolbox Murders is a movie starring Angela Bettis, Brent Roam, and Marco Rodríguez. A historic Hollywood hotel houses a supernatural evil. It's been subdued for decades, but when renovations start, a series of murders take place.", "datePublished": "2004-09-09", "keywords": "neighbor,toolbox,slasher,elevator,secret entrance", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 7628, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0367153/"}, "author": {"@type": "Person", "name": "RockPortReview"}, "dateCreated": "2013-06-16", "inLanguage": "English", "name": "Good Remake with the great Angela Bettis!", "reviewBody": "In 1974 Tobe Hooper directed the original horror masterpiece \"The Texas Chainsaw Massacre\" and created and instant name for himself. But over the past few decades he really hasn't done anything to write home about. Except that in 2004 he directed Angela Bettis in a remake of the 1978 film \"The Toolbox Murders\".\n\nThis new version stars Bettis as Nell as she and her husband move into the Lusman Arms apartment complex in Los Angeles. The complex in under an extensive renovation and is a complete mess, but they have a doorman. The story feels like a lost film from Roman Polanski, drawing a lot from the themes of \"Rosemary's Baby\" and \"The Tenant\". The story also throws in a bit of old Hollywood noir, as the apartment building was the former residence of the infamous Black Dahlia victim Elizabeth Short. The building is a character in itself as a dark and foreboding presence. The movie was shot at the old Ambassador Hotel which has a pretty storied past in itself. The Lusman Arms is the place where young actors come with dreams of making it big. Although Nell is a school teacher and her husband Steve and med student.\n\nFrom the first scene of the movie we know that there is a ski masked maniac in the building who is killing off the resident and things seem to point towards Ned the quiet and creepy young maintenance man who kind of looks like Jack White. Like the original film he kills his victims with various tools in his toolbox, so yeah the title is pretty self explanatory.\n\nNell immediately gets the creeps about the place, but its so affordable since they have to live in a construction zone. We get to know a lot of the residents from an old man who has lived there for 60 years, to the young couple that is always fighting, and the middle aged couple with a teenage son. After hearing a bunch of screaming from next door Nell calls the cops, but they find nothing. She is all alone with her mind allowed to wonder and with the paper thin walls she can't get a moment of silence. As the terror and suspense increases Nell starts to investigate the history of the Lusman Arms. Acting on a tip from the Old Man she find that each floor is missing a room and that something sinister lurks within the walls.\n\nThis is a fun little movie that is all about Angela Bettis and her character Nell as she fights for not only her life but for her sanity. The \"Toolbox Murders\" DVD is available online or from Netflix and includes a couple of commentary tracks and some deleted scenes. So I guess you should put the Hot Pocket down and go watch this movie."}, "duration": "PT1H35M", "EntryURL": "https://www.imdb.com/title/tt0367153", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Toolbox-Murders", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Toolbox-Murders/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Toolbox-Murders/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Toolbox-Murders/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Toolbox-Murders/thumb.jpg", "EntryAdded": "2013-06-08"}