{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman", "EntryURL": "https://www.imdb.com/title/tt1566648", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman/thumb.jpg", "actor": [{"@type": "Person", "name": "Charles Adam", "url": "/name/nm5653572/"}, {"@type": "Person", "name": "Charles Adams", "url": "/name/nm5653622/"}, {"@type": "Person", "name": "Jonathan Alter", "url": "/name/nm1146602/"}, {"@type": "Person", "name": "Robert Balfanz", "url": "/name/nm5661092/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 10495, "ratingValue": "7.5", "worstRating": "1.0"}, "contentRating": "PG", "creator": [{"@type": "Person", "name": "Davis Guggenheim", "url": "/name/nm0346550/"}, {"@type": "Person", "name": "Billy Kimball", "url": "/name/nm1269014/"}, {"@type": "Organization", "url": "/company/co0247967/"}, {"@type": "Organization", "url": "/company/co0132772/"}, {"@type": "Organization", "url": "/company/co0073388/"}], "datePublished": "2010-10-29", "description": "Waiting for 'Superman' is a movie starring Charles Adam, Charles Adams, and Jonathan Alter. An examination of the current state of education in America today.", "director": {"@type": "Person", "name": "Davis Guggenheim", "url": "/name/nm0346550/"}, "duration": "PT1H51M", "genre": "Documentary", "image": "https://m.media-amazon.com/images/M/MV5BMTI3ODUxODE0M15BMl5BanBnXkFtZTcwODM0NzU0Mw@@._V1_.jpg", "keywords": "education,new york,los angeles california,redwood city california,woodside california", "name": "Waiting for 'Superman'", "review": {"@type": "Review", "author": {"@type": "Person", "name": "DoveFoundation"}, "dateCreated": "2010-09-24", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1566648/"}, "name": "This stirring documentary sends out shock-waves of injustice", "reviewBody": "This stirring documentary sends out shock-waves of injustice and even a bit of a sense of futility when it explores the state of America's public schools. Interviews with education specialists, school superintendents and even Bill Gates add up to an impressive assembly of informed adults who know what the problem is, but haven't figured out a way to fix it on a large scale.\n\nWashington, D.C. schools superintendent Michelle Rhee says it well when she summarizes the basic problem: \"Public schools fail when children's education becomes about the adults.\" The adults who fail these children are not limited to public officials and government bureaucrats, though; a large portion of the blame is reserved for ineffective teachers and the teachers' unions who ensure that those teachers receive tenure and cannot be removed from schools. The documentary focuses on five public school children who represent inner-city kids with broken families and day-to-day financial struggles (except for a student of middle-class parents in the Silicon Valley). With that one exception, all are enrolled in failing public elementary schools and have little chance of graduating high school if they move on to the assigned secondary schools in their districts. The tear-jerking climax sees each of the kids attending a lottery drawing for limited spaces at public charter schools and rare, effective public schools within or outside of their district. Witnessing the academic chances for these kids being decided by such a random, impersonal process is heart-breaking and calls into question the very nature of American values like \"Protestant work ethic,\" \"equality,\" \"freedom\" and \"the ability to pull oneself up by one's bootstraps\" and make the future brighter.\n\nThe language is limited to a few expletives. The film deals with a tangled web of adult issues that make a child's education more difficult, which probably puts it outside the spectrum of interest for most kids under age 12. However, when watched with parents, it could create some valuable family discussions on the importance of education and may even activate a family to become advocates for change. We award \"Waiting for Superman\" the Dove Family-Approved Seal for audiences over age 12 and praise the filmmakers for presenting many teachable moments.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "9", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "This documentary follows a handful of promising kids through a system that inhibits, rather than encourages, academic growth, and undertakes an exhaustive review of public education, surveying \"drop-out factories\" and \"academic sinkholes,\" methodically dissecting the system and its seemingly intractable problems.", "embedUrl": "/video/imdb/vi2518550297", "name": "Waiting for Superman", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjI3NDMyMzE1NF5BMl5BanBnXkFtZTgwMTQ0NDczMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjI3NDMyMzE1NF5BMl5BanBnXkFtZTgwMTQ0NDczMzE@._V1_.jpg", "uploadDate": "2010-05-11T13:31:45Z"}, "url": "/title/tt1566648/"}