{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1566648/", "name": "Waiting for 'Superman'", "image": "https://m.media-amazon.com/images/M/MV5BMTI3ODUxODE0M15BMl5BanBnXkFtZTcwODM0NzU0Mw@@._V1_.jpg", "genre": "Documentary", "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm5653572/", "name": "Charles Adam"}, {"@type": "Person", "url": "/name/nm5653622/", "name": "Charles Adams"}, {"@type": "Person", "url": "/name/nm1146602/", "name": "Jonathan Alter"}, {"@type": "Person", "url": "/name/nm5661092/", "name": "Robert Balfanz"}], "director": {"@type": "Person", "url": "/name/nm0346550/", "name": "Davis Guggenheim"}, "creator": [{"@type": "Person", "url": "/name/nm0346550/", "name": "Davis Guggenheim"}, {"@type": "Person", "url": "/name/nm1269014/", "name": "Billy Kimball"}, {"@type": "Organization", "url": "/company/co0247967/"}, {"@type": "Organization", "url": "/company/co0132772/"}, {"@type": "Organization", "url": "/company/co0073388/"}], "description": "Waiting for 'Superman' is a movie starring Charles Adam, Charles Adams, and Jonathan Alter. An examination of the current state of education in America today.", "datePublished": "2010-10-29", "keywords": "education,new york,los angeles california,redwood city california,woodside california", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 10495, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1566648/"}, "author": {"@type": "Person", "name": "richard-1787"}, "dateCreated": "2010-10-19", "inLanguage": "English", "name": "This movie should be mandatory viewing for all Americans", "reviewBody": "Yes, a 10. This movie is spectacular. I can't remember the last time I got so caught up in a documentary.\n\nThis movie seeks to do two things, 1) to show how bad bad public education in this country is and to suggest some of the reasons (the two teachers unions, the administrative bureaucracy, etc.); 2) to suggest a solution.\n\nIt does 1) in a devastatingly powerful fashion. There are other reasons for the poor quality of some American education that he does not broach, like the stupid training given by mediocre and bad schools of education, low teacher certification standards in some states, the danger of leaving it up to principals to hire teachers when some of them have no interest in or understanding of education, etc. But going into all of that would have made this movie hours and hours long. Still probably very interesting, but impractical as a commercial venture.\n\n2) it does well also, but the viewer needs to sit back afterward and think through exactly what is being proposed as a solution. That solution is a certain sort of education now being offered in certain (not all, by any means) urban charter schools that function free of all the obstacles (bureaucracy, school boards, teachers unions, etc.) that block change in regular public schools. But the students in those charter schools are all there because their parents/guardians made the effort to get them there.\n\nIn other words, superlative teaching works with students who have support at home. This is wonderful, but it's not either a surprise or a miracle. It sounds like a magnificent way of educating the children of caring and concerned parents/guardians who can't flee the inner city to the better schools of the suburbs. But it does not address the problem of what is to be done with all the students who are children/wards of individuals who don't give a damn about their education.\n\nThat is probably the subject of another film.\n\nThis one, meanwhile, is magnificent, from first moment to last. The lottery scenes near the end are perhaps the most enthralling, but it is all very good.\n\nI kid you not. Every American should have to see this movie.\n\nP.S. I notice that there are some scathing reviews of this movie on here. Remember in reading them that WfS pulls no punches: it goes after the AFT and NEA with a vengeance, and those two organizations will no doubt do whatever they can to discredit this movie. Beware anything that comes from them, therefore. Bill Gates has long said that those two organizations are two of the biggest roadblocks to educational reform in this country. This movie documents that, and those unions won't take that lying down.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H51M", "trailer": {"@type": "VideoObject", "name": "Waiting for Superman", "embedUrl": "/video/imdb/vi2518550297", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjI3NDMyMzE1NF5BMl5BanBnXkFtZTgwMTQ0NDczMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjI3NDMyMzE1NF5BMl5BanBnXkFtZTgwMTQ0NDczMzE@._V1_.jpg", "description": "This documentary follows a handful of promising kids through a system that inhibits, rather than encourages, academic growth, and undertakes an exhaustive review of public education, surveying \"drop-out factories\" and \"academic sinkholes,\" methodically dissecting the system and its seemingly intractable problems.", "uploadDate": "2010-05-11T13:31:45Z"}, "EntryURL": "https://www.imdb.com/title/tt1566648", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Waiting-for-Superman/thumb.jpg", "EntryAdded": "2013-06-30"}