{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt3268458/", "name": "The Internet's Own Boy: The Story of Aaron Swartz", "image": "https://m.media-amazon.com/images/M/MV5BMjgwOTgwNjQ5MV5BMl5BanBnXkFtZTgwMzk1NTQ2MTE@._V1_.jpg", "genre": ["Documentary", "Biography", "Crime"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm2290901/", "name": "Aaron Swartz"}, {"@type": "Person", "url": "/name/nm3805083/", "name": "Tim Berners-Lee"}, {"@type": "Person", "url": "/name/nm3981659/", "name": "Cindy Cohn"}, {"@type": "Person", "url": "/name/nm4944031/", "name": "Gabriella Coleman"}], "director": {"@type": "Person", "url": "/name/nm0460534/", "name": "Brian Knappenberger"}, "creator": [{"@type": "Person", "url": "/name/nm0460534/", "name": "Brian Knappenberger"}, {"@type": "Organization", "url": "/company/co0294764/"}, {"@type": "Organization", "url": "/company/co0132772/"}, {"@type": "Organization", "url": "/company/co0319011/"}, {"@type": "Organization", "url": "/company/co0510542/"}], "description": "The Internet's Own Boy: The Story of Aaron Swartz is a movie starring Aaron Swartz, Tim Berners-Lee, and Cindy Cohn. The story of programming prodigy and information activist Aaron Swartz, who took his own life at the age of 26.", "datePublished": "2014-06-27", "keywords": "internet,suicide,child prodigy,internet freedom,internet politics", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 15119, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3268458/"}, "author": {"@type": "Person", "name": "JustCuriosity"}, "dateCreated": "2014-03-08", "inLanguage": "English", "name": "An Important Film about a Complex Internet Pioneer's Short Life and Tragic Death.", "reviewBody": "The Internet's Own Boy was very well-received at its showing in Austin's SXSW Film Festival. The film is simultaneously a biography of the tragic death of internet pioneer Aaron Swartz and at the same time a fascinating history of the development of the online political movements that he devoted his life to. The film tells a fascinating story of young genius deeply involved in the early development of the internet including co-founding of Reddit. His genius is unquestionable. The film really provides a tribute to a talented young man and presents a strong case that he was unjustly and selectively prosecuted and overcharged by an overzealous prosecutor. This prosecution seems to have provoked his suicide.\n\nBut the film is unable to establish any real emotional distance from its subject in order to present an objective full picture of Aaron. Early scenes show home movie pictures of Aaron as an adorable precocious toddler playing with his brothers. From this beginning it is impossible to establish the emotional independence necessary to shine any sort of critical light on Aaron's life or activities. The interviews are all with his family, friends and supporters and don't really critique his efforts. He becomes a victim who despite his incredible genius seems to lose responsibility for his own actions including his own suicide. He becomes purely a victim of government persecution with no real responsibility for his own life decisions including his various hacking activities that ultimately lead to his arrest. \n\nThe film really presents Aaron Swartz as a modern-day martyr for the cause of an open access to the internet that he deeply believed in and dedicated himself to. Perhaps because of his recent and tragic death the filmmaker seems unwilling to question the ethics of Aaron's hacker-like tactics. There really aren't any voices raising serious questions about whether his efforts to take the law into his own hands by downloading millions of documents was truly an appropriate form of civil disobedience. He did, in fact, steal millions of articles and violate intellectual property rights through his actions. He undoubtedly believed that what he was doing was right and just. \n\nThe film is thus more of a tribute to his life and a critique of the criminal justice system than it is a balanced examination of his controversial history which deserves closer examination. The filmmaker seems to be too close to Aaron's legacy to present a truly objective self-critical examination of his legacy and his somewhat radical view of open access to knowledge and information. While it is easy to argue for that view, it overlooks the complexity of case for protecting intellectual property rights.\n\nIronically, Aaron seems more far impressive and righteous when he is fighting successfully to defeat the SOPA bill than when he is stealing copyrighted materials. This showed his remarkable ability to organize online and unify people in a collective action that made a real difference for the future of the internet. The tragedy is that this great young activist self-destructed. The filmmaker turns his heroism into victimization and I think may actually undermine his own effort to pay tribute to Aaron. The best tributes are those that are present a complete picture rather than build-up a myth. Never-the-less, despite its flaws this is a powerful and important film that is highly recommended to begin to understand who Aaron Swartz was and to learn about the important issues of intellectual freedom online that he devoted himself to.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H45M", "trailer": {"@type": "VideoObject", "name": "The Internet's Own Boy: The Story of Aaron Swartz", "embedUrl": "/video/imdb/vi937277977", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzJjMDdjMmMtYTI2NC00ZTc4LWIxYmQtZmRjNDg2YmI1ZWYzXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzJjMDdjMmMtYTI2NC00ZTc4LWIxYmQtZmRjNDg2YmI1ZWYzXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg", "description": "Traile for The Internet's Own Boy: The Story of Aaron Swartz", "uploadDate": "2018-12-04T17:31:47Z"}, "EntryURL": "https://www.imdb.com/title/tt3268458", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Internets-Own-Boy-The-Story-of-Aaron-Swartz", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Internets-Own-Boy-The-Story-of-Aaron-Swartz/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Internets-Own-Boy-The-Story-of-Aaron-Swartz/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Internets-Own-Boy-The-Story-of-Aaron-Swartz/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Internets-Own-Boy-The-Story-of-Aaron-Swartz/thumb.jpg", "EntryAdded": "2014-07-01"}