{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Stanford-Prison-Experiment", "EntryURL": "https://www.imdb.com/title/tt0420293", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Stanford-Prison-Experiment/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Stanford-Prison-Experiment/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Stanford-Prison-Experiment/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Stanford-Prison-Experiment/thumb.jpg", "actor": [{"@type": "Person", "name": "Ezra Miller", "url": "/name/nm3009232/"}, {"@type": "Person", "name": "Tye Sheridan", "url": "/name/nm4446467/"}, {"@type": "Person", "name": "Billy Crudup", "url": "/name/nm0001082/"}, {"@type": "Person", "name": "Olivia Thirlby", "url": "/name/nm1880888/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 35290, "ratingValue": "6.9", "worstRating": "1.0"}, "contentRating": "R", "creator": [{"@type": "Person", "name": "Tim Talbott", "url": "/name/nm0848003/"}, {"@type": "Person", "name": "Philip Zimbardo", "url": "/name/nm1674354/"}, {"@type": "Organization", "url": "/company/co0270596/"}, {"@type": "Organization", "url": "/company/co0171098/"}, {"@type": "Organization", "url": "/company/co0025591/"}, {"@type": "Organization", "url": "/company/co0021497/"}], "datePublished": "2015-07-17", "description": "The Stanford Prison Experiment is a movie starring Ezra Miller, Tye Sheridan, and Billy Crudup. In 1971, twenty-four male students are selected to take on randomly assigned roles of prisoners and guards in a mock prison situated in...", "director": {"@type": "Person", "name": "Kyle Patrick Alvarez", "url": "/name/nm1547859/"}, "duration": "PT2H2M", "genre": ["Biography", "Drama", "History", "Thriller"], "image": "https://m.media-amazon.com/images/M/MV5BMTUyNDIyMTA4NV5BMl5BanBnXkFtZTgwODM2MDMxNjE@._V1_.jpg", "keywords": "prisoner,guard,prison,psychology,university", "name": "The Stanford Prison Experiment", "review": {"@type": "Review", "author": {"@type": "Person", "name": "ivko"}, "dateCreated": "2016-05-29", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0420293/"}, "name": "Chillingly bad science", "reviewBody": "This film is a dramatization of a real psychological experiment that took place at the Stanford University in 1971. The motivation was to study the dynamics of individuals who were arbitrarily placed into roles as prisoners and guards at a simulated prison. Since none of the study participants were actual criminals or correction officers, the idea was to glean insight into the psychology of the power imbalance that arises from the situation, as opposed to the people involved.\n\nThings famously degraded quickly and the experiment was terminated after only six days. Multiple guards displayed sadistic traits and performed acts of psychological and even (to a smaller degree) physical torture, all overseen, permitted, and arguably encouraged by \"superintendent\" Philip Zimbardo, the study's creator.\n\nThe conditions the participants were exposed to were reprehensible, but even worse is that ultimately this was simply bad science, making the whole endeavor a cruel waste of time. The experiment lacked much of the basic rigor required, as highlighted in the film by a verbatim repetition of an actual conversation Mr. Zimbardo had with a colleague who questioned some of the basic scientific methodologies being utilized in the study.\n\nZimbardo himself committed what I would consider borderline criminal acts such as initially denying \"prisoner\" participants the option to leave when requested (to instill in them the belief that their situation was, in fact, real), which came frighteningly close to converting the \"study\" into a criminal act of kidnapping in my opinion.\n\nZimbardo explains this as him getting \"to close\" to the experiment, but personally I'm not particularly sympathetic to that argument. When you watch the actual clips from the study and read the notes, I'm more inclined to think that Mr. Zambardo himself had a sadistic streak that he failed to control for a time. Honestly, I think the man should have faced criminal charges for his role in this fiasco.\n\nIn the end, some good did come out of this experiment in that it created a push for establishing standards and controls for psychological experiments in the future.\n\nDespite knowing the actual outcome, I still felt anxious about the fates of the young men involved, a testament to the power of the acting and directing here. To me, this movie is a chilling and visceral reminder of how easy it is to create conditions that foster cruelty and dehumanization. A rewarding, if somewhat depressing, film to watch.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "7", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "It is the summer of 1971. Dr. Philip Zimbardo launches a study on the psychology of imprisonment. Twenty-four male undergraduates are randomly assigned to be either a guard or a prisoner. Set in a simulated jail, the project unfolds. The participants rapidly embody their roles -- the guards become power-hungry and sadistic, while the prisoners, subject to degradation, strategize as underdogs. It soon becomes clear that, as Zimbardo and team monitor the escalation of action through surveillance cameras, they are not fully aware of how they, too, have become part of the experiment.", "embedUrl": "/video/imdb/vi739618841", "name": "Official Trailer", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjU4MDQwNDc5NF5BMl5BanBnXkFtZTgwODkxMzg5NTE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjU4MDQwNDc5NF5BMl5BanBnXkFtZTgwODkxMzg5NTE@._V1_.jpg", "uploadDate": "2015-06-15T06:13:04Z"}, "url": "/title/tt0420293/", "EntryAdded": "2015-11-08"}