{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1375666/", "name": "Inception", "image": "https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_.jpg", "genre": ["Action", "Adventure", "Sci-Fi", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000138/", "name": "Leonardo DiCaprio"}, {"@type": "Person", "url": "/name/nm0330687/", "name": "Joseph Gordon-Levitt"}, {"@type": "Person", "url": "/name/nm0680983/", "name": "Ellen Page"}, {"@type": "Person", "url": "/name/nm0913822/", "name": "Ken Watanabe"}], "director": {"@type": "Person", "url": "/name/nm0634240/", "name": "Christopher Nolan"}, "creator": [{"@type": "Person", "url": "/name/nm0634240/", "name": "Christopher Nolan"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0159111/"}, {"@type": "Organization", "url": "/company/co0147954/"}], "description": "Inception is a movie starring Leonardo DiCaprio, Joseph Gordon-Levitt, and Ellen Page. A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a...", "datePublished": "2010-07-14", "keywords": "dream,subconscious,ambiguous ending,surprise ending,psycho thriller", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1969591, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.8"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1375666/"}, "author": {"@type": "Person", "name": "naman-avastol"}, "dateCreated": "2010-07-10", "inLanguage": "English", "name": "Insanely Brilliant ! Nolan has outdone himself !!", "reviewBody": "What is the most resilient parasite? An Idea! Yes, Nolan has created something with his unbelievably, incredibly and god- gifted mind which will blow the minds of the audience away. The world premiere of the movie, directed by Hollywood's most inventive dreamers, was shown in London and has already got top notch reviews worldwide and has scored maximum points! Now the question arises what the movie has that it deserve all this?\n\nDom Cobb(Di Caprio) is an extractor who is paid to invade the dreams of various business tycoons and steal their top secret ideas. Cobb robs forcefully the psyche with practiced skill, though he's increasingly haunted by the memory of his late wife, Mal (Marion Cotillard), who has a nasty habit of showing up in his subconscious and wreaking havoc on his missions. Cobb had been involved so much in his heist work that he had lost his love!\n\nBut then, as fate had decided, a wealthy business man Saito( Ken Watanabe) hands over the responsibility of dissolving the empire of his business rival Robert Fischer Jr.(Cillian Murphy). But this time his job was not to steal the idea but to plant a new one: 'Inception'\n\nThen what happens is the classic heist movie tradition. To carry out the the task, Cobb's 'brainiac' specialists team up again with him, Arthur (Joseph Gordon-Levitt), his longtime organizer; Tom Hardy (Eames), a \"forger\" who can shapeshift at will; and Yusuf (Dileep Rao), a powerful sedative supplier. \n\nThere is only one word to describe the cinematography, the set designs and the special effects, and that is Exceptional! You don't just watch the scenes happening, you feel them. The movie is a real thrill ride. The action scenes are well picturised and the music by Hans Zimmer is electronically haunting. Never, in the runtime of the movie, you will get a chance to move your eyes from the screen to any other object.\n\nLeonardo, who is still popularly known for Jack Dawson played by him in Titanic, should be relieved as his role as Dom Cobb will be remembered forever. His performance may or may not fetch him an Oscar but it will be his finest performance till date. The supporting cast too did an extraordinary work. Christopher Nolan, ah! what a man he is. His work is nothing less than a masterpiece and he deserves all the awards in the 'Best Director' category. If \"Inception\" is a metaphysical puzzle, it's also a metaphorical one: It's hard not to draw connections between Cobb's dream-weaving and Nolan's film making, intended to seduce us, mess with our heads and leave an ever-lasting impression.\n\nTo conclude, I would just say before your life ends, do yourself a favor by experiencing this exceptionally lucid classic created by Nolan! \n\nMy Rating: 10/10\n\nThanks & Regards", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT2H28M", "trailer": {"@type": "VideoObject", "name": "Inception -- Characters", "embedUrl": "/video/imdb/vi4219471385", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTdlZGFmMDQtM2RiYi00NzUxLThhZWQtN2M4ZmYwMzllZGYyXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTdlZGFmMDQtM2RiYi00NzUxLThhZWQtN2M4ZmYwMzllZGYyXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg", "description": "Inception -- Characters Trailer", "uploadDate": "2010-07-14T10:17:51Z"}, "EntryURL": "https://www.imdb.com/title/tt1375666", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Inception", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Inception/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Inception/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Inception/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Inception/thumb.jpg", "EntryAdded": "2013-02-23"}