{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0134119/", "name": "The Talented Mr. Ripley", "image": "https://m.media-amazon.com/images/M/MV5BODA3NDhiZjYtYTk2NS00ZWYwLTljYTQtMjU0NzcyMGEzNTU2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Crime", "Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000354/", "name": "Matt Damon"}, {"@type": "Person", "url": "/name/nm0000569/", "name": "Gwyneth Paltrow"}, {"@type": "Person", "url": "/name/nm0000179/", "name": "Jude Law"}, {"@type": "Person", "url": "/name/nm0000949/", "name": "Cate Blanchett"}], "director": {"@type": "Person", "url": "/name/nm0005237/", "name": "Anthony Minghella"}, "creator": [{"@type": "Person", "url": "/name/nm0383604/", "name": "Patricia Highsmith"}, {"@type": "Person", "url": "/name/nm0005237/", "name": "Anthony Minghella"}, {"@type": "Organization", "url": "/company/co0022594/"}, {"@type": "Organization", "url": "/company/co0023400/"}, {"@type": "Organization", "url": "/company/co0038270/"}, {"@type": "Organization", "url": "/company/co0032447/"}], "description": "The Talented Mr. Ripley is a movie starring Matt Damon, Gwyneth Paltrow, and Jude Law. In late 1950s New York, Tom Ripley, a young underachiever, is sent to Italy to retrieve Dickie Greenleaf, a rich and spoiled millionaire playboy....", "datePublished": "1999-12-25", "keywords": "nudity,italy,sociopath,male frontal nudity,neo noir", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 175612, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0134119/"}, "author": {"@type": "Person", "name": "The_Void"}, "dateCreated": "2004-12-19", "inLanguage": "English", "name": "Envigorating and effective masterpiece", "reviewBody": "When it comes to naming the best films of the 1990's, The Talented Mr. Ripley hardly ever gets a mention. This is one of cinema's greatest mysteries; how can a film as well made, constantly intriguing and brilliantly conceived as this one constantly get passed over? And in favour of many under deserving films as well? Really strange. Almost as big a mystery as the one I've just mentioned is the web of intrigue created here. Through deep, complex characters and situations rich with double meaning, Anthony Minghella has turned Patricia Highsmith's original novel into a cinematic masterpiece. The talented Matt Damon stars as the talented man of the title that is offered $1000 to travel to Italy to try and return Dickie; the rich and spoilt son of a millionaire. What follows is a complex, disturbing and fascinating expose of a man ingratiating himself into the lives of Dickie, his girlfriend Marge and high society on the whole...\n\nThe main reason why The Talented Mr. Ripley works so well is that it's central characters are deep labyrinths that beg to explored and analysed. Every scene is rich with double meaning and character interactions that exist under the surface of the drama we are seeing on screen. The character of Tom Ripley is a true masterpiece of characterisation indeed. This sociopath, that would rather be \"a pretend somebody than a real nobody\" is a myriad of contradictions and muddled personalities. His actions are always amoral and through his lies and deception, it is obvious that he doesn't care at all for anyone around him. However, despite this; we are still able to feel for him through his tribulations. The story is told in such a way that it is difficult to feel for any of the other characters and all of our sympathies lie with the talented Tom Ripley. This puts the audience in a strange situation, as we're used to hating the antagonist and feeling for the protagonist, but this film turns that on it's head, and to great effect.\n\nThe film is helped implicitly by the fact that it's one of the most professionally made films ever to make it onto the screen. Every scene, every action, every line uttered is done with the greatest assurance and nothing at all in the film appears to be there by accident or out of place. The way that the characters interact with each other and their surroundings is always believable and we never question anything that is shown on screen. Anthony Minghella's direction is more than solid, and this is helped by the stunning photography, courtesy of 1950's Italy. Many a film has benefited from Italy's landscape, and this is one of them. This is all great, but it's the performances that put the final finishing touch on this amazing masterclass of film-making. As mentioned, the talented Mr Damon takes the lead role and completely makes it his own. He often gets coupled with his friend, Ben Afleck, when it comes to acting; but this is very unfair as Damon is one of today's brightest stars. Jude Law and Gwyneth Paltrow make up the other two leads. I'm not the biggest fan of either of these two stars, but both, like Damon, give performances here that will always be associated with their personalities. Cate Blanchett has a small role, but the real plaudits for the smaller performances go to the brilliant Phillip Seymour Hoffman, who steals every scene he's in.\n\nThe Talented Mr. Ripley is one stunning piece of film. Ignore the people that don't consider this one of the 1990's greatest achievements; they are wrong. The film is a masterpiece of tense situations, great characterisation and professional film-making. And I refuse to hear otherwise.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT2H19M", "EntryURL": "https://www.imdb.com/title/tt0134119", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Talented-Mr-Ripley", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Talented-Mr-Ripley/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Talented-Mr-Ripley/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Talented-Mr-Ripley/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Talented-Mr-Ripley/thumb.jpg", "EntryAdded": "2013-02-19"}