{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1615147/", "name": "Margin Call", "image": "https://m.media-amazon.com/images/M/MV5BMjE5NzkyNDI2Nl5BMl5BanBnXkFtZTcwMTYzNDc2Ng@@._V1_.jpg", "genre": ["Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0704270/", "name": "Zachary Quinto"}, {"@type": "Person", "url": "/name/nm0001804/", "name": "Stanley Tucci"}, {"@type": "Person", "url": "/name/nm0000228/", "name": "Kevin Spacey"}, {"@type": "Person", "url": "/name/nm0079273/", "name": "Paul Bettany"}], "director": {"@type": "Person", "url": "/name/nm1170855/", "name": "J.C. Chandor"}, "creator": [{"@type": "Person", "url": "/name/nm1170855/", "name": "J.C. Chandor"}, {"@type": "Organization", "url": "/company/co0271126/"}, {"@type": "Organization", "url": "/company/co0232586/"}, {"@type": "Organization", "url": "/company/co0092503/"}, {"@type": "Organization", "url": "/company/co0034249/"}], "description": "Margin Call is a movie starring Zachary Quinto, Stanley Tucci, and Kevin Spacey. Follows the key people at an investment bank, over a 24-hour period, during the early stages of the 2008 financial crisis.", "datePublished": "2011-09-29", "keywords": "financial crisis,financial disaster,capital management,investment fraud,21st century", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 112620, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1615147/"}, "author": {"@type": "Person", "name": "mgorman-6"}, "dateCreated": "2011-10-23", "inLanguage": "English", "name": "Quietly gripping morality tale - a near perfect movie", "reviewBody": "Saw this last night. Set at a Wall Street firm on the night in 2008 when the leaders realize that changes in the market will wipe them out if they don't immediately stop selling the products that have been making them all rich, the movie centers on the moral dilemma - recognized by some characters but dismissed by others - that they face in unwinding their positions, saving themselves but shifting the pain to others.\n\nThe movie finds a way to hold the mirror up to our civilization, showing how we are all complicit in a collective 'dream' (one character says at one point, in response to another who says he feels like he is in a 'dream', 'Funny, it seems like I just woke up'). The dream is the illusion of easy, risk-managed wealth that the financial markets manufacture, again and again, since the emergence of capital markets 200 years ago, until the illusion morphs overnight into a panic. Reality intervenes, fear takes over, and the 'survivor' is the guy who first reaches the lifeboat. So there are no villains in this movie, just people, richly drawn, beautifully acted characters realized by some of our best actors who relish the opportunity to show what they can do given a killer script and enough screen time between lines to actually be the people they are portraying. \n\nCentral to the movie's success: \n\n1) It gets across the essence of what is going on in the financial markets without bogging us down or dumbing it down\n\n2) finding a moral question that can be resolved in a night, yet which is nevertheless a perfect allegory for the whole set of moral questions raised by an economy that works the way ours does, rewarding false confidence, recklessness, and deceit as often as industry, skill, and integrity\n\n3) the placement of young, innocent but perceptive characters at the center of the drama, who function as our eyes and ears, who are like stand-ins for all of us who weren't there, at the heart of the dream machine, when the latest fantasy of easy wealth was exposed as a collective delusion\n\n4) really 'gets' the trader ethos and manner - they are a kind of warrior caste, foul-mouthed, impulsive, deeply selfish, surviving by their ability to outplay their counterparts, and yet living by a warrior code that sets boundaries on what they will and will not do to one another (having spent three years on Wall Street several panics ago, it rang as true as any movie I have seen on the subject)\n\nIt's like Mamet, except you don't have to work as hard to figure out what everyone's up to. It's like Chinatown, except the 'crime' is something far worse than molesting a single young girl. These guys f****d the entire planet, for Ch*****sake. It's like the best movie I've seen in a little while.\n\nWhat an incredibly sure hand from a director on his maiden voyage! Who is this guy? Whoever you are, please don't stop. I would pay a lot to see what he could do with topics like 'the decision to go to war', or 'the emergence of China/India/Brazil/Indonesia from poverty to global player'. Hell I would go see him revive Mother Goose, after this debut.\n\nI'll calm down now. Enjoy.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H47M", "trailer": {"@type": "VideoObject", "name": "Trailer #1", "embedUrl": "/video/imdb/vi1070504985", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjIzMTQ0MDE1MF5BMl5BanBnXkFtZTcwNzEyMjYxNg@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjIzMTQ0MDE1MF5BMl5BanBnXkFtZTcwNzEyMjYxNg@@._V1_.jpg", "description": "A thriller that revolves around the key people at a investment bank over a 24-hour period during the early stages of the financial crisis.", "uploadDate": "2011-08-02T10:40:13Z"}, "EntryURL": "https://www.imdb.com/title/tt1615147", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call/thumb.jpg"}