{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1615147/", "name": "Margin Call", "image": "https://m.media-amazon.com/images/M/MV5BMjE5NzkyNDI2Nl5BMl5BanBnXkFtZTcwMTYzNDc2Ng@@._V1_.jpg", "genre": ["Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0704270/", "name": "Zachary Quinto"}, {"@type": "Person", "url": "/name/nm0001804/", "name": "Stanley Tucci"}, {"@type": "Person", "url": "/name/nm0000228/", "name": "Kevin Spacey"}, {"@type": "Person", "url": "/name/nm0079273/", "name": "Paul Bettany"}], "director": {"@type": "Person", "url": "/name/nm1170855/", "name": "J.C. Chandor"}, "creator": [{"@type": "Person", "url": "/name/nm1170855/", "name": "J.C. Chandor"}, {"@type": "Organization", "url": "/company/co0271126/"}, {"@type": "Organization", "url": "/company/co0232586/"}, {"@type": "Organization", "url": "/company/co0092503/"}, {"@type": "Organization", "url": "/company/co0034249/"}], "description": "Margin Call is a movie starring Zachary Quinto, Stanley Tucci, and Kevin Spacey. Follows the key people at an investment bank, over a 24-hour period, during the early stages of the 2008 financial crisis.", "datePublished": "2011-09-29", "keywords": "financial crisis,financial disaster,capital management,investment fraud,21st century", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 112627, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1615147/"}, "author": {"@type": "Person", "name": "JvH48"}, "dateCreated": "2011-10-17", "inLanguage": "English", "name": "Perfect visualization of recent financial crisis, showing how people on all levels in the financial industry act and think", "reviewBody": "I saw this film as part of the Ghent filmfestival 2011. Its announcement promised an inside view in the financial industry, and particularly how it could cause the recent financial crisis. And precisely this is what it did splendidly. I gave it a \"very good\"mark (5 out of 5) for the public prize competition when leaving the theater.\n\nI particularly liked the way they avoided the techno babble about financial products, from which we all learned the hard way to be paper constructs only, none of these related with things in the real world. The story also clearly illustrates that higher echelons in the financial industry do not under­stand those technicalities either, something we assumed all along but didn't dare to ask for confirmation.\n\nDeparting from the very different purposes and backgrounds of the main characters, the story line got us involved in the attempts of each of them to cope with the situation at hand. Though their job motivations may drastically differ from yours and mine, this film had no really distinct good and bad guys.\n\nThe main characters were properly introduced in the time-line when logically needed. We got the chance to know each of them, with their own coping behavior in this volatile environ­meant, yet every­one bringing along his own human characteristics. In the process we also saw the golden chains to attach each of them to the company, making it virtually impossible to cut themselves loose from this line of work. We may call it greed, but it is a fact of life that everyone gets used to incoming cash flow, however large and unnecessary it may seem in our eyes. Once being there, it is logical to buy a bigger house and to send kids to expensive schools. After that there is no easy way back, and each one smoothly grows into a life style that is difficult to escape from.\n\nThe story line as such is not that important, apart from the fact that it succeeds very well in tying all the above together. It also maintains a constant tension all the time. I consider both aspects an achievement in itself, since nothing really happens in terms of dead bodies, physical fights, and chasing cars. Only a few short scenes were shot outside, but all the rest happened in a standard office building. The final outdoor scene was a bit unexpected (I won't spoil it for you), but it shows that even bankers are human after all."}, "duration": "PT1H47M", "trailer": {"@type": "VideoObject", "name": "Trailer #1", "embedUrl": "/video/imdb/vi1070504985", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjIzMTQ0MDE1MF5BMl5BanBnXkFtZTcwNzEyMjYxNg@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjIzMTQ0MDE1MF5BMl5BanBnXkFtZTcwNzEyMjYxNg@@._V1_.jpg", "description": "A thriller that revolves around the key people at a investment bank over a 24-hour period during the early stages of the financial crisis.", "uploadDate": "2011-08-02T10:40:13Z"}, "EntryURL": "https://www.imdb.com/title/tt1615147", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Margin-Call/thumb.jpg", "EntryAdded": "2011-10-22"}