{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0069280/", "name": "Slaughterhouse-Five", "image": "https://m.media-amazon.com/images/M/MV5BNjE5MzE4ODAyMV5BMl5BanBnXkFtZTgwMTU3NTk4MDE@._V1_.jpg", "genre": ["Comedy", "Drama", "Sci-Fi", "War"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0755310/", "name": "Michael Sacks"}, {"@type": "Person", "url": "/name/nm0500038/", "name": "Ron Leibman"}, {"@type": "Person", "url": "/name/nm0733929/", "name": "Eugene Roche"}, {"@type": "Person", "url": "/name/nm0304535/", "name": "Sharon Gans"}], "director": {"@type": "Person", "url": "/name/nm0001351/", "name": "George Roy Hill"}, "creator": [{"@type": "Person", "url": "/name/nm0903361/", "name": "Kurt Vonnegut Jr."}, {"@type": "Person", "url": "/name/nm0312409/", "name": "Stephen Geller"}, {"@type": "Organization", "url": "/company/co0005073/"}, {"@type": "Organization", "url": "/company/co0061989/"}], "description": "Slaughterhouse-Five is a movie starring Michael Sacks, Ron Leibman, and Eugene Roche. A man named Billy Pilgrim tells the story of how he became unstuck in time and was abducted by aliens.", "datePublished": "1972-03-15", "keywords": "prisoner of war camp,alien abduction,nonlinear timeline,time travel,world war two", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 11815, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0069280/"}, "author": {"@type": "Person", "name": "mstomaso"}, "dateCreated": "2007-06-14", "inLanguage": "English", "name": "Vonnegut's Classic Through Roy Hill's Lens", "reviewBody": "The film Slaughterhouse 5 is a brilliantly portrayed interpretation of a great but typically multilinear novel by science fiction author Kurt Vonnegut. With all due respect to the literary critics, sci fi really is what Vonnegut most often wrote - whether or not it is viewed as allegory or even 'serious literature'. As such, it was not really made to convey the same messages,nor even the aesthetics of the book, but rather to convey the director's (and others on the creative team) impressions of the book.\n\nThe book is also brilliant, but none of Vonnegut's work is easily adapted to the medium of film. Not quite the task Cronenberg took on when he directed Burrough's Naked Lunch, but very similar in method.\n\nS-5 exposes us to the life of Billy Pilgrim (Michael Sacks) and his many loves (his dog spot, his wife played by Holly Near and an actress played by Valerie Perrine), as he either blacks out and travels into the deep recesses of his memory experiencing the delusion of time travel or (as indicated by his occasional leaps forward in time), he actually has become 'unstuck in time.' Between trips back to Dresden during its WWII bombing and trips forward to the planet Tralfamador, it seems that Billy is constantly tripping. Yet he manages to build a successful and very normal American life despite his bizarre and uncontrollable time-travel habit. \n\nThe film illustrates the non-linear manner in which the book is written by skipping from time to time in a seemingly random manner, but it manages to do so without losing focus on Pilgrim, who is, in fact always living in the present regardless of what time he happens to be experiencing. Fantastic directoral method!\n\nThe film makes a lot of subtle, simple and very good points by making Billy - a quiet simple guy with an extraordinary set of circumstances in his life - a true hero simply because he is relatively nice, somewhat aloof, happy, and quite normal. Sacks' performance is spot-on.\n\nThis film is beautifully photographed, very well paced, perfectly directed and edited. The acting is all quite good, and comes from a well appointed cast mostly consisting of character actors. I was particularly impressed with Eugene Roche's excellent portrayal of Edgar Derby.\n\nHighly recommended for the art-house crowd and friends of intelligent sci fi.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H44M", "EntryURL": "https://www.imdb.com/title/tt0069280", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Slaughterhouse-Five", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Slaughterhouse-Five/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Slaughterhouse-Five/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Slaughterhouse-Five/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Slaughterhouse-Five/thumb.jpg", "EntryAdded": "2013-02-23"}