{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1068680/", "name": "Yes Man", "image": "https://m.media-amazon.com/images/M/MV5BMzBmZTMzYmItNzhhMC00M2FkLWIxMGEtMjIxMjAwNmQ2ZmM4XkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg", "genre": ["Comedy", "Romance"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000120/", "name": "Jim Carrey"}, {"@type": "Person", "url": "/name/nm0221046/", "name": "Zooey Deschanel"}, {"@type": "Person", "url": "/name/nm0177896/", "name": "Bradley Cooper"}, {"@type": "Person", "url": "/name/nm0383422/", "name": "John Michael Higgins"}], "director": {"@type": "Person", "url": "/name/nm0715636/", "name": "Peyton Reed"}, "creator": [{"@type": "Person", "url": "/name/nm0831557/", "name": "Nicholas Stoller"}, {"@type": "Person", "url": "/name/nm0666871/", "name": "Jarrad Paul"}, {"@type": "Person", "url": "/name/nm2361949/", "name": "Andrew Mogel"}, {"@type": "Person", "url": "/name/nm0991245/", "name": "Danny Wallace"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0108864/"}, {"@type": "Organization", "url": "/company/co0159772/"}, {"@type": "Organization", "url": "/company/co0093750/"}], "description": "Yes Man is a movie starring Jim Carrey, Zooey Deschanel, and Bradley Cooper. A man challenges himself to say \"yes\" to everything.", "datePublished": "2008-12-17", "keywords": "dvd,the beatles song,music gig,character appears on tv,harry potter costume", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 326450, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.8"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1068680/"}, "author": {"@type": "Person", "name": "saarvardi"}, "dateCreated": "2008-12-15", "inLanguage": "English", "name": "Carrey is back with a bang. Yes! Yes! Yes!", "reviewBody": "Being a teenager in the 1990's, I have to say I was never a big fan of Jim Carrey's mainstream performances in the movies that made him the star that he is today. Hits like Ace Ventura, Dumb & Dumber and Liar Liar left me mostly indifferent to Carrey's rather obscene personality. It was only when he shined in more complex roles like The Truman Show, Man on the Moon and eventually Eternal Sunshine of the Spotless Mind that I grew to respect the wide range of characters Carrey is able to bring to life.\n\nOver recent years, Carrey continued doing his thing, moving from comedy to dramatic roles and vice versa. The problem is that all of the sudden he wasn't alone in the ring anymore, and countless other comedians have tried to slip into his shoes to various degrees of success. There was no place to deny it; Carrey was in need of a hit to re-establish his place in the Hollywood sky.\n\nCue the brand new comedy Yes Man, that finds Carrey once again in his favorite \"What if...?\" sub-genre. This time around, he plays Carl, a lonely divorcée that has somehow alienated even his best friend (portrayed successfully by Wedding Crasher's Bradley Cooper). Carl is stuck in a dead-end job at a bank, yearns for his ex-wife and spends his evenings watching rented DVDs... all by himself. When an old friend introduces him to a corny self-help program (lead by a hilarious Terrence Stamp) that persuades him to answer \"yes\" to every question thrown his way, Carl's life takes a dramatic turn.\n\nAs expected, the new approach gets our hero into all kinds of wacky situations - such as spending a steamy morning with his horny elderly neighbor (!); meeting a potential Iranian wife through an online service; partying all night whilst drinking countless cans of Red-Bull and over excessively helping a homeless person. Luckily enough, it also introduces him to the extremely free-spirited Allison (portrayed by the ever-so-cute Zooey Dashnel).\n\nIf you've seen the average Carrey comedy, you can probably guess how the plot unfolds from here on out, necessary complications included. The format is more or less the same of what we've been used to seeing Carrey perform in his comic outings, with the main idea being a modern moral story urging people to stop going through the motions of life and start seizing the day. But I digress. It seems as though years of perfecting his comic roles as well as starring in more \"grown up\" roles have tamed Carrey a bit. A lot of the arrogance and awkwardness revolving his earlier films seem to be missing this time out, and instead I could actually feel true emotion and heart in Yes Man. It seems as if this fact alone contributed greatly to the fact that most of the punch lines actually worked here and I found myself smiling for the larger part of the film.\n\nSome points that still managed to ruin some of the fun are: A. As mentioned above, the film was very predictable, and formulated at that. B. Carrey has definitely aged recently, and it's starting to show. The age gap between him and Dashnel left me feeling somewhat uncomfortable.\n\nHowever, all in all I had a great time with some excellent laughs - and at the end of the day that's what really counts (:", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H44M", "trailer": {"@type": "VideoObject", "name": "Yes Man", "embedUrl": "/video/imdb/vi3042902041", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTkxNTAzMzE5N15BMl5BanBnXkFtZTgwNzU3MzczMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTkxNTAzMzE5N15BMl5BanBnXkFtZTgwNzU3MzczMzE@._V1_.jpg", "description": "Yes Man - Trailer #2", "uploadDate": "2008-11-12T09:28:29Z"}, "EntryURL": "https://www.imdb.com/title/tt1068680", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Yes-Man", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Yes-Man/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Yes-Man/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Yes-Man/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Yes-Man/thumb.jpg", "EntryAdded": "2013-02-19"}