{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2345112/", "name": "Parkland", "image": "https://m.media-amazon.com/images/M/MV5BMjE2NjkwNDE2MF5BMl5BanBnXkFtZTgwNDY5ODIxMDE@._V1_.jpg", "genre": ["Drama", "History", "Mystery", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm1374980/", "name": "Zac Efron"}, {"@type": "Person", "url": "/name/nm0919991/", "name": "Tom Welling"}, {"@type": "Person", "url": "/name/nm0000671/", "name": "Billy Bob Thornton"}, {"@type": "Person", "url": "/name/nm0316079/", "name": "Paul Giamatti"}], "director": {"@type": "Person", "url": "/name/nm1481618/", "name": "Peter Landesman"}, "creator": [{"@type": "Person", "url": "/name/nm1481618/", "name": "Peter Landesman"}, {"@type": "Person", "url": "/name/nm0119514/", "name": "Vincent Bugliosi"}, {"@type": "Organization", "url": "/company/co0234935/"}, {"@type": "Organization", "url": "/company/co0176864/"}, {"@type": "Organization", "url": "/company/co0036575/"}], "description": "Parkland is a movie starring Zac Efron, Tom Welling, and Billy Bob Thornton. A recounting of the chaotic events that occurred at Dallas' Parkland Hospital on the day U.S. President John F. Kennedy was assassinated.", "datePublished": "2013-10-02", "keywords": "john f. kennedy assassination,secret service,assassination,motorcade,year 1963", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 14695, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2345112/"}, "author": {"@type": "Person", "name": "ferguson-6"}, "dateCreated": "2013-10-15", "inLanguage": "English", "name": "Immediate Fallout", "reviewBody": "Greetings again from the darkness. Fifty years of investigation and research have spawned an endless number of theories about what happened, how it happened, and why it happened, that tragic day in 1963. President John F Kennedy and his lovely wife Jacqueline had captured the hearts of many Americans, and on a trip to Ft Worth and then Dallas, the streets were lined with eager citizens who just wanted to catch a glimpse ... hoping some of that Camelot magic would rub off. Instead, a city and a country, went spinning off into feelings of anger and devastation. Rather than show us what we already know, this is a peek at a few individuals impacted in ways you might not have previously thought about.\n\nVincent Bugliosi made a name for himself as the prosecutor in the Charles Manson Family murder case, and then penning the corresponding book Helter Skelter (subsequently made into a movie). This movie is based on Bugliosi's book \"Four Days in November: The Assassination of President John F. Kennedy\".\n\nThe main stories we follow are that of Abraham Zapruder (Paul Giamatti), Lee Harvey Oswald's brother Robert (James Badge Dale), their mother Margueritte (Jacki Weaver), Secret Service Agent Forrest Sorrels (Billy Bob Thornton), local FBI Agent James Hosty (Ron Livingston), and the emergency room doctors and nurses who treated JFK and Oswald (Zac Efron, Colin Hanks, Marcia Gay Harden). You might think that's too many stories for a single movie, and you are probably correct. However, it's fascinating to see the frenetic pace and immediate fallout of just how these people were impacted. Sure, we would like more details and backstory, but that's not the approach this film takes. It just provides a taste of the gut-wrenching decisions Mr. Zapruder has to make while grieving for his beloved President; and the shock of Oswald's brother as reality hits; the stomach-churning delusions of Oswald's mother; the absolute frustration of the CIA and FBI agents knowing their historic failures will be their legacy; and the disparate emotions that enter the operating rooms with Kennedy and Oswald.\n\nThe film doesn't take any stance on the grassy knoll, CIA involvement, LBJ involvement, or number of shooters. This is not a crime solving story or research into conspiracy theories. No, this is a look at real people in extraordinary situations that no amount of preparation can pacify. There are so many little details revealed ... one of the most powerful occurring at the Lee Harvey Oswald funeral, and another as the JFK casket is loaded onto Air Force One just prior to LBJ taking the oath. So many little things you have probably never before considered.\n\nIf you were alive at the time of the assassination, you understand the impact. If you have read any of the stacks of books written about that day, you understand what happened and the messy investigation that followed. Bugliosi and director Peter Landesman effectively mix news reels from the day with dramatizations of the fallout, and the actors do a tremendous job of showing just how personal this affected those at the time. A different perspective brings with it interesting discussion ... and a big thanks if your mother is nothing like Oswald's!", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H33M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi2669390105", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzY0MjAyODQ3NF5BMl5BanBnXkFtZTgwMzg0ODAxMDE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzY0MjAyODQ3NF5BMl5BanBnXkFtZTgwMzg0ODAxMDE@._V1_.jpg", "description": "A recounting of the chaotic events that occurred at Dallas' Parkland Hospital on the day U.S. President John F. Kennedy was assassinated.", "uploadDate": "2013-08-24T12:58:29Z"}, "EntryURL": "https://www.imdb.com/title/tt2345112", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Parkland", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Parkland/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Parkland/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Parkland/thumb.jpg", "EntryAdded": "2013-10-18"}