{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt1701982/", "name": "Good Vibes", "image": "https://m.media-amazon.com/images/M/MV5BMTg0NzY5MjQxNV5BMl5BanBnXkFtZTcwMDUyODY5Ng@@._V1_.jpg", "genre": ["Animation", "Comedy"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm0111013/", "name": "Adam Brody"}, {"@type": "Person", "url": "/name/nm0000998/", "name": "Jake Busey"}, {"@type": "Person", "url": "/name/nm1265802/", "name": "Josh Gad"}, {"@type": "Person", "url": "/name/nm0355024/", "name": "Tony Hale"}], "creator": [{"@type": "Person", "url": "/name/nm0337773/", "name": "David Gordon Green"}, {"@type": "Organization", "url": "/company/co0066916/"}, {"@type": "Organization", "url": "/company/co0227256/"}, {"@type": "Organization", "url": "/company/co0054176/"}, {"@type": "Organization", "url": "/company/co0120568/"}], "description": "Good Vibes is a TV series starring Adam Brody, Jake Busey, and Josh Gad. Transplanted Jersey boy, Mondo and his best bud Woodie are on a mission to surf the biggest waves, crash the wildest parties and chase the prettiest girls in...", "datePublished": "2011-10-27", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 902, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1701982/"}, "author": {"@type": "Person", "name": "meltinzone"}, "dateCreated": "2012-10-13", "inLanguage": "English", "name": "Funniest animated show in a long time! Comedy Central or Adult Swim pick it UP!", "reviewBody": "Good Vibes is the funniest 'new/fresh' animated show that's ever been made, period. If you haven't at least watched the first episode, well I guarantee you'll get at least one moment where you spit your meal or beverage across the room in an uplifting chuckle-roar. And seriously, who doesn't like a good chuckle-roar, hahaha. Now think, when's the last time one of those long-running animated shows truly made you laugh like that? Can't remember, don't worry, me neither ;)\n\nEveryone I meet that seems like they need a good laugh, well I tell them about this funny unheard of animated show called Good Vibes. You know, only funny huge names like Adam Brody (Smiley Face, The Other Guys) and Danny McBride (Your Highness, Eastbound & Down) chose to star in it because they could see the animated scene needed something this fresh and cleverly written.\n\nComing here and seeing the low rating and lack of reviews, well hell. I actually wrote a review way back in April with the title: \"Haven't laughed so hard at a first episode since Good Vibes!\" for the show Betty White's Off Their Rockers. I then went on to say something about laughing as hard or as much since seeing Good Vibes. I mean think of it like this, if writing a review for another show makes you think back to the last time you laughed so long and hard, well that must mean the show you're thinking back to left quite a funny impression. In this case that show I was thinking back to was Good Vibes, therefore one could say it's pretty damn funny from that aspect alone.\n\nWith the plethora of new shows all starting up, I decided to try the new animated show Brickleberry, hoping for one tenth of the laughter that Good Vibes brought me, but nope. So I guess the question becomes, if MTV is stupid enough to drop a TRULY HILARIOUS GEM like Good Vibes, not realizing it could/will go on to be the next Family Guy or South Park, well Comedy Central and Adult Swim, Where you at!? If you pick Good Vibes up, do you know how loyal those fans would become to your brand? I'd buy a whole bunch of merchandise just because you kept a great show alive long enough and brought it to an audience that truly appreciate awesome humor. In turn, bringing a show like this to your already amazing network/s, well I'm sure fans of the network would be so amazed at the level of humor and writing in Good Vibes that even they'd buy some merch, just to say thanks for bringing them something so profoundly funny. The one thing I'd ask is you leave it alone, don't change anything, anything. Everything as it was made the show great, adding or changing writers/styles/characters/etc before fans of your network got to see it as it was will kill any chance of a third season. By all means, in season 3, make it even more awesome, just give it a single season on your network to run as it was and watch what happens ;)\n\nI'm a 24yo dude with a wicked sense of humor, for instance, my elbow isn't my 'funny bone', that name's reserved for something else...right ;p Therefore one would be right in assuming you'll enjoy Good Vibes providing you fall into at least one of these categories: 1) are a chilled person 2) enjoy laughing till your belly hurts 3) aren't a pretentious politically correct douche who thinks you're 'above/better than' dick and fart jokes 4) can laugh at yourself 5) like to part-ay!\n\nAs all those other long running shows can become kind of stale from time to time, well at least give the first episode of Good Vibes a go, it brings a whole new shi-BANG back to animation. Plus, you'll be glad you did. ;)\n\nMy idea of comedy? Well here's some other funny TV shows I enjoy/ed; South Park, Crank Yankers, Bored To Death, Chuck, Fonejacker, That '70s Show, Wilfred, Robot Chicken, Workaholics, IT Crowd, Family Guy, Futurama, Boston Legal, Beavis and Butthead (new season) -- there's a ton more but that's a pretty diverse list of shows that have all, at one point or another, had me (quite literally) in tears laughing.\n\nHope that helps some of you in deciding whether or not to give it a go. :)", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "EntryURL": "https://www.imdb.com/title/tt1701982", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Good-Vibes", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Good-Vibes/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Good-Vibes/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Good-Vibes/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Good-Vibes/thumb.jpg", "EntryAdded": "2012-03-10"}