{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt1701982/", "name": "Good Vibes", "image": "https://m.media-amazon.com/images/M/MV5BMTg0NzY5MjQxNV5BMl5BanBnXkFtZTcwMDUyODY5Ng@@._V1_.jpg", "genre": ["Animation", "Comedy"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm0111013/", "name": "Adam Brody"}, {"@type": "Person", "url": "/name/nm0000998/", "name": "Jake Busey"}, {"@type": "Person", "url": "/name/nm1265802/", "name": "Josh Gad"}, {"@type": "Person", "url": "/name/nm0355024/", "name": "Tony Hale"}], "creator": [{"@type": "Person", "url": "/name/nm0337773/", "name": "David Gordon Green"}, {"@type": "Organization", "url": "/company/co0066916/"}, {"@type": "Organization", "url": "/company/co0227256/"}, {"@type": "Organization", "url": "/company/co0054176/"}, {"@type": "Organization", "url": "/company/co0120568/"}], "description": "Good Vibes is a TV series starring Adam Brody, Jake Busey, and Josh Gad. Transplanted Jersey boy, Mondo and his best bud Woodie are on a mission to surf the biggest waves, crash the wildest parties and chase the prettiest girls in...", "datePublished": "2011-10-27", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 902, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1701982/"}, "author": {"@type": "Person", "name": "evyeniarocks"}, "dateCreated": "2017-03-22", "inLanguage": "English", "name": "Memories are tainted by youth", "reviewBody": "My brother and I used to watch this show when we were in middle school. And we thought this was the single greatest piece of art humanity had ever created. We seriously thought this was the funniest thing of all time. We worshiped this show like Christians worship Jesus Christ. So when it went off the air, we were shocked and devastated. We kept all fourteen episodes on our DVR and watched them over and over again until we switched TV providers and lost them all for good - because, despite it being the greatest show ever made, the network never re-aired the episodes, never put it on Netflix, or even some smaller streamer. It was like it ceased to exist.\n\nYears passed. My brother and I would every so often reminisce on the greatest show ever. \"Hey remember good vibes?\" I'd ask. \"Yeah, that show was hilarious,\" he'd reply. \"Wish there was some way we could watch it.\" Times were changing. I graduated high school, my brother now standing significantly taller than me, both of us had seen so much more than our young, wide- eyed middle school selves. The world was different now. Life was a bit colder, a bit harsher. But Good Vibes still stood cemented atop a pedestal, frozen in time. I almost wish we'd just let it stay up there. But we reached for it, and it all came smashing down.\n\nOnce again, my brother reminded me of the hilarious show from our youth, Good Vibes. This time, I decided I was done wallowing in memories. I wanted to experience the comedic goldmine once again. So I took to the internet, found a sketchy streaming website where Good Vibes would actually play. We got some popcorn, pulled up the website on the TV, and, after a long 6 years, watched Good Vibes once more. As I was selecting the episode from the short list, my brother said, \"God, I can't believe they only made fourteen episodes of this show!\" After the first episode was over, we both sat there in a stunned silence for a moment, only to be broken by my brother saying \"God, I can't believe they made fourteen episodes of that show.\"\n\nI don't know what there is to like about the show. I don't even really know what I ever liked about the show. There is no comedic value in any of the joke writing. It seems each joke only plays on shock value, meant to get a reaction out of middle schoolers, which they clearly do succeed in. But watching it as an adult, these jokes meant to shock are either so not shocking that I didn't realize they were jokes, or just straight up uncomfortable to watch. There is a right way to do shocking, but this is not it.\n\nAlso, Woody is probably the most unlikable and unrelatable character in television (perhaps all of storytelling?)history. He seems like a shell of a human, with no clear personality. Each episode, it seems like the writers just sort of mold his character into whatever's necessary to that plot line. His voice acting doesn't help either. It's so cold and emotionless, so not right for the part. I just don't understand him at all.\n\nThe show does have a few good moments. Mondo is a pretty likable kid and, although his jokes usually fall flat, he can get, maybe, one laugh per episode. Which is good! His mom is pretty funny, too. Although she seems kinda like a cool person who's trapped in the script these terrible writers are setting her in. Like, she's just hanging out and being chill and cool, and then the writers nudge her with a stick from the wings and shout \"Hey! Talk about your boobs some more!\" \n\nWhat I've learned from this experience is that when you remember something from your childhood that you love and cherish, maybe just let it be loved and cherished and don't try to go looking for it and realize it's terrible and rotten and nothing's good anymore because your'e an adult. Cause.. you know, you're childhood memories are the only salvaged things that you can still see like a child.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "2"}}, "EntryURL": "https://www.imdb.com/title/tt1701982", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Good-Vibes", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Good-Vibes/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Good-Vibes/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Good-Vibes/thumb.jpg", "EntryAdded": "2012-03-10"}