{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt3530002/", "name": "The Night Before", "image": "https://m.media-amazon.com/images/M/MV5BMTkyNDY1ODQwNV5BMl5BanBnXkFtZTgwNzA2MjUwNzE@._V1_.jpg", "genre": ["Comedy", "Fantasy"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0330687/", "name": "Joseph Gordon-Levitt"}, {"@type": "Person", "url": "/name/nm0736622/", "name": "Seth Rogen"}, {"@type": "Person", "url": "/name/nm3255459/", "name": "Jillian Bell"}, {"@type": "Person", "url": "/name/nm0135221/", "name": "Lizzy Caplan"}], "director": {"@type": "Person", "url": "/name/nm1349522/", "name": "Jonathan Levine"}, "creator": [{"@type": "Person", "url": "/name/nm1349522/", "name": "Jonathan Levine"}, {"@type": "Person", "url": "/name/nm3773434/", "name": "Kyle Hunter"}, {"@type": "Person", "url": "/name/nm3782043/", "name": "Ariel Shaffir"}, {"@type": "Person", "url": "/name/nm1698571/", "name": "Evan Goldberg"}, {"@type": "Person", "url": "/name/nm1349522/", "name": "Jonathan Levine"}, {"@type": "Organization", "url": "/company/co0050868/"}, {"@type": "Organization", "url": "/company/co0380492/"}, {"@type": "Organization", "url": "/company/co0479739/"}, {"@type": "Organization", "url": "/company/co0345956/"}], "description": "The Night Before is a movie starring Joseph Gordon-Levitt, Seth Rogen, and Jillian Bell. On Christmas Eve, three lifelong friends spend the night in New York City looking for the Holy Grail of Christmas parties.", "datePublished": "2015-11-20", "keywords": "christmas,christmas party,new york city,male frontal nudity,drug dealer", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 62761, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3530002/"}, "author": {"@type": "Person", "name": "ArchonCinemaReviews"}, "dateCreated": "2015-12-06", "inLanguage": "English", "name": "Watching this movie is like feasting on a handful full of drugs - just buy the ticket and take the ride", "reviewBody": "For the past decade, nobody has worn the mantle of \"endearingly lost and confused\" quite like Seth Rogen. His fuzzy visage is famously disarming, dialed somewhere between \"I don't want any problems, man\" and \"I actually don't even know how I got here.\" In modern cinema, Rogen is the reigning on-screen avatar for your inner overgrown man-child. He's the Peter Pan of Stoner Stoner land. If you've enjoyed tumbling out the window with him before, it's likely you'll enjoy most of The Night Before. If not, well, Joseph Gordon- Levitt is also here, and does stuff.\n\nLike all films written or produced by Rogen and his partner Evan Goldberg, The Night Before centers around earnest relationships blended with a platter of substance fueled escapades. A Tracy Morgan narrated opening monologue sets the scene: fourteen years ago, a young man named Ethan (Joseph Gordon-Levitt) loses both of his parents on Christmas, and in order to make sure he never feels alone, his best friends Isaac (Rogen) and Chris (Anthony Mackie) start an annual tradition of bromantic Christmas debauchery.\n\nAs they settle into their 30's, mounting responsibilities–in the form of impending fatherhood for Isaac and sudden NFL fame for Chris — shroud the prospect of future partying. This year, the boys decide to go all out for one final hurrah. However, with no family and no career, Ethan remains stuck in post-adolescence limbo and desperately clings to the significance of this yuletide ritual. Through a stroke of fate, he lands tickets to a legendary bash called The Nutcracka Ball, and leads the group on an adventure through New York City to reach the party. Sleigh bells ring, shenanigans ensue.\n\nThe comedy throughout the film is anchored in Isaac's gradual drug- induced transformation into a tripped out, befuddled nomad of the suddenly bizarre Manhattan landscape. Towards the beginning of the night, Isaac's wife (Jillian Bell of Workaholics and 22 Jump Street fame) gifts him a treasure box full of narcotic goodies. Blessed with unexpected powers of self-intoxication, he proceeds to ingest a stir-fry meal of assorted drugs (cocaine combines well with mushrooms, right?) and becomes hopelessly and hilariously unhinged.\n\nRogen is a rocket on a launch pad. As the night proceeds, he soars, bouncing from situation to situation in freewheeling confusion, guided only by his friends and the prospect of reaching the gilded land of El Dorado in the form of a Christmas party. His emotions flip like television channels, each thought a mere flash before succeeding situations careen in and hijack his attention. Quick! Lunge for that drink you just bled coke-blood into—OK, now respond to this mysteriously explicit text and quizzically question my own sexuality–actually, wait, go talk to that friendly looking sheep in the nativity scene. It's a master class in profound psychedelic confusion. Isaac's solution? Balance things out with more drugs, of course.\n\nThe film dims whenever Rogen is off screen. Ethan is relegated to the thankless straight man role, and his personal journey of rekindling a relationship with his ex-girlfriend Diana (Lizzy Caplan) is a charming slog at best. Chris is a tech-age celebrity blowhard, a walking #blessed whose steroid-fueled fame is rapidly smothering his real personality. Along with Isaac's drug inspired revelation of his anxiety around having kids, the three friends each have personal journeys to undertake and resolve by the end of the night.\n\nCentral plot aside, the film basically provides a red and green colored canvas to pack in as many bits and gags as possible. Director Jonathan Levine scatters in pop culture references throughout, from a \"Big\" inspired rendition of Kanye West's \"Runaway\" in FAO Schwarz to a karaoke performance of Run-D.M.C. to an actual performance of \"Wrecking Ball\" by the actual Miley Cyrus. The references, while funny, are somewhat jumbled and possibly topical (I have doubts that the pointed nostalgia men in their 30's feel currently for Baby One More Time will resonate with future audiences). More effective were the numerous cameo appearances from actors and comedians, ranging from a magical Yoda- like pot dealing performance by Michael Shannon to a scene-stealing appearance by Ilana Glazer as a manic pixie weed nymph.\n\nAs a pure story, The Night Before suffers the classic comedic pitfall of having slightly contrived emotional stakes. That being said, drab sincerity is a standard price-of-entry for any holiday comedy, and it would be foolish to let narrative shortcomings stand in the way of simply letting go and embracing the silliness. Watching this movie, like feasting on an Altoids tin full of white powder and pills, is best done with drug guru Hunter S. Thompson's sage advice in mind: buy the ticket, take the ride.\n\nPlease check out our website for more reviews of all the recent releases.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H41M", "trailer": {"@type": "VideoObject", "name": "International Trailer", "embedUrl": "/video/imdb/vi933671449", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjAxNjM0NzQzMV5BMl5BanBnXkFtZTgwMTczNzQxNzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjAxNjM0NzQzMV5BMl5BanBnXkFtZTgwMTczNzQxNzE@._V1_.jpg", "description": "In New York City for their annual tradition of Christmas Eve debauchery, three lifelong best friends set out to find the Holy Grail of Christmas parties since their yearly reunion might be coming to an end.", "uploadDate": "2015-10-29T08:57:21Z"}, "EntryURL": "https://www.imdb.com/title/tt3530002", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Night-Before", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Night-Before/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Night-Before/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Night-Before/thumb.jpg", "EntryAdded": "2016-02-22"}