{"name": "Diablo", "slug": "diablo", "EntryURL": "https://rawg.io/games/diablo", "description": "<p>Le module multijoueur de Battle.net® nécessite de configurer votre router et les ports de votre pare-feu ; plus de details ici.<br />\nAh, voyageur ! Restez donc un peu et écoutez...<br />\nLes ténèbres s&#39;éveillent dans les profondeurs de Tristram.<br />\nUn Mal ancien se répand dans tout le pays, terrorisant la population et la plongeant dans une guerre civile. Vous allez devoir résoudre un mystère dont les pièces maîtresses ne sont autres qu&#39;un roi fou, son fils disparu ainsi qu&#39;un mystérieux évêque.<br />\nVous avez voyagé jusqu&#39;à la source même de ce Mal : la ville de Tristram, qui ne compte plus désormais qu&#39;une poignée de survivants, harcelés et terrorisés par le fléau qui s&#39;est abattu sur eux. Bâtie sur les ruines d&#39;un vieux monastère, une cathédrale s&#39;y dresse encore, mais des lueurs sinistres et des bruits à glacer le sang résonnent dans ses salles abandonnées... et c&#39;est là que vous allez devoir vous aventurer.<br />\nLancez-vous si vous l&#39;osez dans une quête qui exigera que vous veniez à bout du Mal suprême...<br />\nPlongez-vous dans un jeu d&#39;action/RPG légendaire qui a influencé tout un genre.<br />\nÉcumez les salles de Diablo dans la peau d&#39;un guerrier, d&#39;un sorcier ou d&#39;une archère, chacun ayant des capacités et des aptitudes qui lui sont propres.<br />\nUnissez-vous pour vaincre Diablo - Possibilité de grouper jusqu&#39;à 4 joueurs via Internet ou connexion réseau, ou en liaison directe d’IP à IP.<br />\nUne rejouabilité sans précédent - Plus de 200 monstres différents hantent l&#39;antre de Diablo, un labyrinthe en perpétuelle transformation. Équipez-vous d&#39;objets épiques pour vaincre de terribles boss et leurs serviteurs.<br />\nUne histoire à glacer le sang - Affrontez toute l&#39;horreur d&#39;un monde tombé aux mains du Seigneur de la Terreur.<br />\nAaah... de la chair fraîche !<br />\nLes voyageurs souhaitant retrouver le frisson du Diablo d&#39;origine peuvent jouer à ce jeu tel qu&#39;il est sorti en 1996, avec des graphismes d&#39;époque SVGA en 20 FPS. Ils ont en outre la possibilité de chercher d&#39;autres joueurs par l&#39;intermédiaire de la version classique de Battle.net®, le service de jeu en ligne de Blizzard.<br />\nPour ceux préférant quelque chose d&#39;un peu plus moderne, Blizzard et GOG.COM ont concocté une version adaptée aux ordinateurs de gaming d&#39;aujourd&#39;hui, avec une compatibilité Windows 10, une armée de correctifs et la prise en charge de la haute résolution via un upscaling gérant le ratio de l&#39;image.<br />\nLe jeu le plus attendu sur GOG.com, enfin piégé dans une pierre d&#39;âme sans DRM !<br />\nRetournez au commencement de cette sombre saga, désormais au format numérique pour la toute première fois.<br />\nOn vous promet que c&#39;est plus intéressant que les bricoles de Wirt !</p>", "added": 453, "background_image": "https://media.rawg.io/media/games/923/923a5dd13b6e79dd23ab2d09934f0e8d.jpg", "genres": ["Action", "RPG"], "platforms": ["PlayStation", "PC", "macOS"], "developers": ["Blizzard Entertainment, Inc.", "Blizzard North"], "publishers": ["Electronic Arts", "Ubisoft Entertainment", "Blizzard Entertainment"], "released": "1996-12-30", "EntryPath": "Favorites/Games/snapshot/Diablo", "Entry_py": "Favorites/Games/snapshot/Diablo/info.py", "Entry_json": "Favorites/Games/snapshot/Diablo/entry.json", "Entry_thumb": "Favorites/Games/snapshot/Diablo/thumb.jpg", "EntryAdded": "06-05-2020"}