{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt9827854/", "name": "Hollywood", "image": "https://m.media-amazon.com/images/M/MV5BODc5ZDZmNTEtZDJjZC00ZmMzLWJlZWQtOWNiODI5YjE0YzBmXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg", "genre": "Drama", "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm4825178/", "name": "David Corenswet"}, {"@type": "Person", "url": "/name/nm2023050/", "name": "Darren Criss"}, {"@type": "Person", "url": "/name/nm5637553/", "name": "Laura Harrier"}, {"@type": "Person", "url": "/name/nm0544079/", "name": "Joe Mantello"}], "creator": [{"@type": "Person", "url": "/name/nm0107302/", "name": "Ian Brennan"}, {"@type": "Person", "url": "/name/nm0614682/", "name": "Ryan Murphy"}, {"@type": "Organization", "url": "/company/co0156994/"}], "description": "Hollywood is a TV mini-series starring David Corenswet, Darren Criss, and Laura Harrier. A group of aspiring actors and filmmakers in post-World War II Hollywood try to make it big - no matter the cost.", "datePublished": "2020-05-01", "keywords": "hollywood,1940s,post world war two,actor,filmmaking", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 19636, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt9827854/"}, "author": {"@type": "Person", "name": "alindsay-al"}, "dateCreated": "2020-05-26", "inLanguage": "English", "name": "A Great show that deals with serious subject matters", "reviewBody": "As a big fan of the film industry I was looking forward to watching the Netflix miniseries Hollywood and now I have got around to watch it and here is my review for it. The premise of the show sees a group of actors and filmakers try to get there big break in Hollywood after World War 2 and what exactly that requires. Main Character There are plenty of characters on the show but the one we mainly follow is Jack Castello played by relatively unknown actor David Corenswet and I really liked him on this show. He plays the leading man very well, he mixes the cheesiness and the dramatic aspects of the character, he should come across as generic but I didn't find this because of his strong performance. He manages to get sympathy but also feel flawed making him an interesting protagonist for this show. Supporting Characters As I said there are plenty of characters here but I will talk about a few of them, first Dylan Mcdermott plays Ernie and this guy is so charming and charismatic on this show. He tries to help Jack and because of that we like him but you just can't help it, even when he does questionable things you just want to like Ernie and that is a highlight of the show. Jim Parsons plays the agent in this show and he is brilliant, for those that just think of him in The Big Bang Theory then watch this show, he plays a slimy and powerful agent and you see this interesting character and how his mind works throughout the show. There are a bunch of younger actors on this show and they are all great, Jeremy Pope as Archie in particular could have a big future after this show as he really nails his performance. Story The story is somewhat interesting seeing these different people literally doing just about anything to get into the limelight of Hollywood. It also does a great job of showing just how important cinema can be and how it can really inspire people and change society. But this show's story is also a little boring especially for the first few episodes, plus it sometimes feel's really forced. You would not believe how many people in Hollywood are gay according to this show, I get the message they were going for and it does work, it just feels a bit forced and over done. Also there are just too many characters that the show wants you to care about, it could have done with less characters and less plotlines to give things more depth. Script The script for this show is good, if you can accept some of the cheesiness that is here then it works, I accept it because from the start the show lets you know what kind of show you are getting and it works. The drama starts off slow but by the time you get to the final episode I would be suprised if you weren't moved and emotional then you have a heart of stone. Style The style of the show as mentioned is very glitz and glamour, if you are a fan of film you will love the setting of Hollywood and it does a great job in nailing its Hollywood style here. But there is an issue with tone here, it goes from a cheesy over the top situation to an emotional really serious subject and it does feel a bit jarring at times. Overall Overall, I was enjoying this show and then the final episode pushed it further, for a fan of film this is a great show worth the watch. It is over the top and deals with some serious subject matter but it is an entertaining and maybe even an important watch.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi1727970841", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTI2ZGYwODQtNzkzYi00MGExLTk5ZDEtYmY2NWQ2ZGFlZjlhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTI2ZGYwODQtNzkzYi00MGExLTk5ZDEtYmY2NWQ2ZGFlZjlhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "In post-World War II Hollywood, an ambitious group of aspiring actors and filmmakers will do almost anything to make their showbiz dreams come true.", "uploadDate": "2020-04-20T15:16:27Z"}, "EntryURL": "https://www.imdb.com/title/tt9827854", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Hollywood", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Hollywood/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Hollywood/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Hollywood/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Hollywood/thumb.jpg", "EntryAdded": "06-03-2020"}