{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1907668/", "name": "Flight", "image": "https://m.media-amazon.com/images/M/MV5BMTUxMjI1OTMxNl5BMl5BanBnXkFtZTcwNjc3NTY1OA@@._V1_.jpg", "genre": ["Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000243/", "name": "Denzel Washington"}, {"@type": "Person", "url": "/name/nm1229204/", "name": "Nadine Velazquez"}, {"@type": "Person", "url": "/name/nm0000332/", "name": "Don Cheadle"}, {"@type": "Person", "url": "/name/nm0000422/", "name": "John Goodman"}], "director": {"@type": "Person", "url": "/name/nm0000709/", "name": "Robert Zemeckis"}, "creator": [{"@type": "Person", "url": "/name/nm0309691/", "name": "John Gatins"}, {"@type": "Organization", "url": "/company/co0023400/"}, {"@type": "Organization", "url": "/company/co0038131/"}, {"@type": "Organization", "url": "/company/co0108321/"}, {"@type": "Organization", "url": "/company/co0251916/"}, {"@type": "Organization", "url": "/company/co0139355/"}], "description": "Flight is a movie starring Denzel Washington, Nadine Velazquez, and Don Cheadle. An airline pilot saves almost all his passengers on his malfunctioning airliner which eventually crashed, but an investigation into the accident...", "datePublished": "2012-11-02", "keywords": "stewardess,alcoholism,pilot,lawyer,alcoholic", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 316632, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1907668/"}, "author": {"@type": "Person", "name": "EmmaDinkins"}, "dateCreated": "2012-11-03", "inLanguage": "English", "name": "Chix Chat on Film Review: Prepare for take off!", "reviewBody": "Flight is the story of a commercial pilot Whip Whitaker (Denzel Washington) who is able to land a defective plane with extraordinary skill, maneuvering it into an inverted position in order to slow the decent. We see this inverted flight captured in the trailer, but believe it or not this is not the most provocative element of this film. The story is so thought provoking that it will have you walking out of the theater questioning whether or not you could or would choose nobility over self-preservation. Most of what takes place behind the scenes looming like a predator waiting to strike is the blame game, with Whip continuously asserting that no one could have landed that plane except him. That point is supported but it's the collateral damage of his arrogance that is at the forefront of determining liability. The trailer also lets the audience in on the fact that Whip is found to have alcohol in his system as is discussed with Hugh Lang (Don Cheadle) who is the attorney brought in to defend Whip on behalf of the Pilot's association. Hugh was very straight and very narrow, which was the case with most of the characters aside from Whip. It was the dichotomy of Whip's persona so brilliantly conveyed in his mannerisms, responses, and facial expressions that makes the performance Oscar, Golden Globe, BET, Trumpet, Image, MTV and any other awards worthy. If Mr. Washington had uttered eight bars I would say he deserves a Hip Hop award or a Grammy, he was that convincing. I recognized this person that Mr. Washington portrayed so true to life, which is not just a testament to good writing, but mostly to the phenomenal acting talent that is Denzel. All the characteristics that made this individual a hero were the same characteristics that could potentially make him infamous. I will say that I as well as many fans am always open to greater insight into who Denzel is, however the rear view was totally unnecessary. The film does a great job of telling a story about the human condition, nobody is one dimensional and sometimes extreme circumstances make you write yourself a reality check. The question is when you cash that check will you be happy with the results. If you have any fear of flying this is not the movie for you. It will reinforce that fear and possibly cause you to swear off flying altogether. I give this film a green light.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT2H18M", "trailer": {"@type": "VideoObject", "name": "UK Trailer", "embedUrl": "/video/imdb/vi2384176153", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTQ0NjAzNTMzM15BMl5BanBnXkFtZTcwNTQ2MTA2OA@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTQ0NjAzNTMzM15BMl5BanBnXkFtZTcwNTQ2MTA2OA@@._V1_.jpg", "description": "An airline pilot saves a flight from crashing, but an investigation into the malfunctions reveals something troubling.", "uploadDate": "2012-10-13T07:53:13Z"}, "EntryURL": "https://www.imdb.com/title/tt1907668", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Flight", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Flight/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Flight/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Flight/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Flight/thumb.jpg", "EntryAdded": "2013-06-29"}