{"name": "Doom", "slug": "doom-2", "EntryURL": "https://rawg.io/games/doom-2", "description": "<p>Doom (typeset as DOOM in official documents) is a 1993 science fiction horror-themed first-person shooter (FPS) video game by id Software. It is considered one of the most significant and influential titles in video game history, for having helped to pioneer the now-ubiquitous first-person shooter. The original game was divided into three nine-level episodes and was distributed via shareware and mail order. The Ultimate Doom, an updated release of the original game featuring a fourth episode, was released in 1995 and sold at retail.<br />\nIn Doom, players assume the role of an unnamed space marine, who became popularly known as &quot;Doomguy&quot;, fighting his way through hordes of invading demons from Hell. With one-third of the game (nine levels) distributed as shareware, Doom was played by an estimated 15–20 million people within two years of its release, popularizing both the business model of online distribution and the mode of gameplay, and spawning a gaming subculture. In addition to popularizing the first-person shooter genre, it pioneered immersive 3D graphics, networked multiplayer gaming, and support for customized additions and modifications via packaged files in a data archive known as &quot;WADs&quot;. As a sign of its effect on the industry, first-person shooter games from the genre&#39;s boom in the 1990s, helped in no small part by the game&#39;s release, became known simply as &quot;Doom clones&quot;. Its graphic violence, as well as satanic imagery, made Doom the subject of considerable controversy.<br />\nThe Doom franchise was later continued with the follow-up Doom II: Hell on Earth (1994) and numerous expansion packs, including Master Levels for Doom II (1995), and Final Doom (1996). Originally released for MS-DOS, the games have been ported to numerous other platforms. Once the game&#39;s source code was released in 1997, it spawned even more adaptations, as fans further ported the code to countless devices. The series started to lose mainstream appeal as the technology of the Doom game engine was surpassed in the mid-1990s, although fans have continued making Wads, speedruns, and modifications to the original. The franchise again received popular attention in 2004 with the release of Doom 3, a retelling of the original game using id Tech 4, with an associated 2005 Doom motion picture. Another release, simply titled Doom and powered by id Tech 6, was released in 2016 and focused on returning to the fast paced action of the first two games.</p>", "added": 685, "background_image": "https://media.rawg.io/media/games/47b/47b50d880be8453bf9cda6e5c007bc26.jpg", "genres": ["Action", "Shooter"], "platforms": ["PlayStation 3", "Xbox 360", "Nintendo Switch", "Xbox One", "PlayStation 4", "PC", "Linux", "PlayStation", "Game Boy Advance", "Jaguar", "SEGA 32X", "3DO", "SNES"], "developers": ["id Software", "Nerve Software"], "publishers": ["Atari", "Bethesda Softworks", "SEGA", "Valve", "Activision Blizzard", "GT Interactive Software", "Ocean Software", "Williams Entertainment", "WMS Industries", "Imagineer", "GT Interactive", "'''Genesis'''", "'''PlayStation", "'''SNES (Europe)'''", "SNES (North America)'''", "'''Game Boy Advance", "'''SNES (Japan)'''"], "released": "1993-12-10", "EntryPath": "Favorites/Games/snapshot/Doom-2", "Entry_py": "Favorites/Games/snapshot/Doom-2/info.py", "Entry_json": "Favorites/Games/snapshot/Doom-2/entry.json", "Entry_thumb": "Favorites/Games/snapshot/Doom-2/thumb.jpg", "EntryAdded": "08-01-2020"}