{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0102511/", "name": "Naked Lunch", "image": "https://m.media-amazon.com/images/M/MV5BMTRiOTQ2ZWQtMmIwYy00Y2Y3LWFmMzgtNzgzZWU1MDhlOGJhXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg", "genre": "Drama", "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000693/", "name": "Peter Weller"}, {"@type": "Person", "url": "/name/nm0001114/", "name": "Judy Davis"}, {"@type": "Person", "url": "/name/nm0000453/", "name": "Ian Holm"}, {"@type": "Person", "url": "/name/nm0001696/", "name": "Julian Sands"}], "director": {"@type": "Person", "url": "/name/nm0000343/", "name": "David Cronenberg"}, "creator": [{"@type": "Person", "url": "/name/nm0123221/", "name": "William S. Burroughs"}, {"@type": "Person", "url": "/name/nm0000343/", "name": "David Cronenberg"}, {"@type": "Organization", "url": "/company/co0029168/"}, {"@type": "Organization", "url": "/company/co0053578/"}, {"@type": "Organization", "url": "/company/co0017692/"}, {"@type": "Organization", "url": "/company/co0039782/"}, {"@type": "Organization", "url": "/company/co0052648/"}, {"@type": "Organization", "url": "/company/co0045032/"}, {"@type": "Organization", "url": "/company/co0064350/"}], "description": "Naked Lunch is a movie starring Peter Weller, Judy Davis, and Ian Holm. After developing an addiction to the substance he uses to kill bugs, an exterminator accidentally kills his wife, and becomes involved in a secret government...", "datePublished": "1992-03-11", "keywords": "secret agent,lynchian,psychological disintegration,reality vs fantasy,repressed homosexual", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 45370, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0102511/"}, "author": {"@type": "Person", "name": "bob the moo"}, "dateCreated": "2004-01-04", "inLanguage": "English", "name": "Not easy to watch but an imaginative trip", "reviewBody": "New York 1953.  Bill Lee is a bug exterminator who follows his wife down the road of using the bug powder as a hallucinatory drug.  When he is picked up by the police for suspected drug use he is left in the cell with a large bug that tells him that he is on a mission and must watch his wife.  When he accidentally kills his wife he flees to Interzone to prepare his report, increasingly losing his grip on what is real and what is not.\n\nI have seen this movie several times and am always taken in by it.  In terms of narrative it is not the strongest film you'll ever see.  In all honesty the plot is pretty thin and the film is best seen as a journey into destruction with Lee's drug addled writer slowly but surely losing grip on reality with every passing moment.  The journey is reasonably interesting, even if it doesn't have enough pace to really be fascinating.  What does hold the attention is the imagination of the film and it's ability to put onscreen a decent representation of Lee's hallucinations.\n\nThe effects are very good but it is their use that is better.  While it does have a certain amount of gore, the creatures and hallucinations are actual characters (creepy characters at that) that are used well within the story, rather than just being effects or gore.  The cast can't all say that and some of them are distinctly average at times.  Weller is as good as ever in a dead eyed performance that gives way to madness and fear at times. Davis is every bit as good, delivering two roles and be riveting in both.  Holm is OK and it's not his fault that I couldn't get Bilbo out of my mind!  Sands and Schneider don't have enough to do but are interesting faces.\n\nCronenberg is the perfect choice for director, but it is good that he holds back from the full on gore or body horror, call it what you will.  He uses a measured camera to film the hallucinations rather than using swinging `crazy' angles to portray mental state - that is a lazy technique.  Here Cronenberg (and Weller's blank face) calmly and methodically fall into despair and it is good to watch.\n\nOverall, this is not a perfect film - it is slow and the narrative doesn't totally grip, however it manages to make a good fist out of filming a descent into a hallucinatory nightmare.  Worth seeing it once, but I can't imagine that the word `enjoyable' would really ever apply to this film."}, "duration": "PT1H55M", "EntryURL": "https://www.imdb.com/title/tt0102511", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Naked-Lunch", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Naked-Lunch/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Naked-Lunch/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Naked-Lunch/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Naked-Lunch/thumb.jpg", "EntryAdded": "2013-02-19"}