{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0272020/", "name": "The Last Castle", "image": "https://m.media-amazon.com/images/M/MV5BMzZlMTllYjMtZmQ0NS00ZGJkLTg1ODItODM2MmViYjlmNzcyXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_.jpg", "genre": ["Action", "Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000602/", "name": "Robert Redford"}, {"@type": "Person", "url": "/name/nm0001254/", "name": "James Gandolfini"}, {"@type": "Person", "url": "/name/nm0749263/", "name": "Mark Ruffalo"}, {"@type": "Person", "url": "/name/nm0123733/", "name": "Steve Burton"}], "director": {"@type": "Person", "url": "/name/nm0527109/", "name": "Rod Lurie"}, "creator": [{"@type": "Person", "url": "/name/nm0769227/", "name": "David Scarpa"}, {"@type": "Person", "url": "/name/nm0769227/", "name": "David Scarpa"}, {"@type": "Person", "url": "/name/nm0003662/", "name": "Graham Yost"}, {"@type": "Organization", "url": "/company/co0040938/"}, {"@type": "Organization", "url": "/company/co0021936/"}], "description": "The Last Castle is a movie starring Robert Redford, James Gandolfini, and Mark Ruffalo. A court-martialed General rallies together twelve hundred inmates to rise against a corrupt and sadistic warden.", "datePublished": "2001-10-19", "keywords": "u.s. military,coercion,prison,military officer,prison riot", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 68718, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0272020/"}, "author": {"@type": "Person", "name": "mlbou"}, "dateCreated": "2002-03-27", "inLanguage": "English", "name": "Wait for this to reach cable", "reviewBody": "I have eagerly awaited my chance to see The Last Castle. I thought the previews looked interesting and at the very least I loved The Rock and think Redford is great so I figured this movie would be good. Heck I almost skipped paying the $4 rental fee to just buy the DVD. Glad I didn't.\n\nDespite what others may believe, I feel that this movie strongly apes Shawshank Redemption and other heretofore well-tramped ground. We have a power-hungry, egocentric warden, a quiet, reserved new prisoner who was quite successful on the outside and whose previous life is known of by his inmates. And a struggle of wits, warden vs. prisoner plays out like a game of chess. Interesting to note, both Shawshank and Last Castle incorporate chess as the greatest battle of wits...I doubt the similarity is coincidental.\n\nThe acting is good...I won't take that away from the film. The characters are relatively believable and the actors handle their roles well. The problem with this film is that it relies too much on illogical or contradictory ideas to move itself along. Ok, first the title \"the last castle\" is contradicted again and again as Redford keeps saying that anywhere you raise the flag and say you can't take this away from me is a castle. It's almost the theme of the film and it directly contradicts the title...seems like a case of a line too good to throw out, even though it really does not fit.\n\nAlso, Redford demonstrates a great deal of respect to the warden but speaks very harshly of him when the warden is simply removed to the other room to grab a book to have signed. Redford criticizes the warden in a most uncivil way right in front of the warden and it just doesn't make sense...it's completely unlike the character to do so. But there has to be some animosity between the two and that was the easiest way to do it...illogical yes, but whatever gets the action moving, right? The guards are also painfully one-dimensional. We get a glimpse early on that the captain is a good guy forced to do bad things but all that we know of the snipers, etc. is that they enjoy shooting prisoners and that the warden enjoys manipulating everyone within the walls. A scene that showed them to be human, to have any feeling other than hate for prisoners, would make them far more believable and make the story that much better...again, this is an action movie and moving the story along fast is key: not a logical progression of events, not keeping the promise to show both sides of the story made in the opening scenes.\n\nIn short, this movie is woefully inconsistent. Is it filled with good action sequences, especially for a prison movie. Is it entertaining...sure, it's not bad. But as a film, a piece of art, it just does not pass muster...in their attempts to push this movie onto the screen the film makers simply left too much out and obviously did not spend enough time developing the script. It has so much potential and so little payoff. A 6 in my book.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT2H11M", "trailer": {"@type": "VideoObject", "name": "The Last Castle", "embedUrl": "/video/imdb/vi2525954329", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTI0NGI4YjItN2IzZC00NTk1LTlkZmUtMjNjYjk4ZDc3NTI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTI0NGI4YjItN2IzZC00NTk1LTlkZmUtMjNjYjk4ZDc3NTI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Theatrical Trailer from Dreamworks", "uploadDate": "2008-04-11T16:32:55Z"}, "EntryURL": "https://www.imdb.com/title/tt0272020", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Last-Castle", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Last-Castle/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Last-Castle/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Last-Castle/thumb.jpg", "EntryAdded": "2013-02-22"}