{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Battle-of-Chernobyl", "EntryURL": "https://www.imdb.com/title/tt1832484", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Battle-of-Chernobyl/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Battle-of-Chernobyl/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Battle-of-Chernobyl/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Battle-of-Chernobyl/thumb.jpg", "actor": [{"@type": "Person", "name": "Tim Birkett", "url": "/name/nm4299133/"}, {"@type": "Person", "name": "Hans Blix", "url": "/name/nm1556284/"}, {"@type": "Person", "name": "Mikhail Gorbachev", "url": "/name/nm0329784/"}, {"@type": "Person", "name": "Oleg Mirochnikov", "url": "/name/nm1360310/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 1298, "ratingValue": "8.3", "worstRating": "1.0"}, "creator": {"@type": "Organization", "url": "/company/co0121147/"}, "datePublished": "2007-01-28", "description": "The Battle of Chernobyl is a movie starring Tim Birkett, Hans Blix, and Mikhail Gorbachev. Documentary of the nuclear disaster of Chernobyl.", "director": {"@type": "Person", "name": "Thomas Johnson", "url": "/name/nm4297891/"}, "duration": "PT1H34M", "genre": "Documentary", "image": "https://m.media-amazon.com/images/M/MV5BZGI4NjYzYjItZmIwYy00YTMzLWI1ZjctYWQ5MDFlMzRmMjgzXkEyXkFqcGdeQXVyMzkxNjQ1Mw@@._V1_.jpg", "keywords": "nuclear energy,nuclear,nuclear power,nuclear disaster,nuclear accident", "name": "The Battle of Chernobyl", "review": {"@type": "Review", "author": {"@type": "Person", "name": "Lechuguilla"}, "dateCreated": "2016-12-01", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1832484/"}, "name": "A Real Life Horror Story", "reviewBody": "If ever there was a film that documented the horrors of nuclear weapons \"The Battle Of Chernobyl\" is surely it. What makes this film so potent are the images: photos yes, but also a surprising number of retro news and secret camera footage from the nuclear power plant site and surrounding area, as the catastrophe unfolded in April of 1986, in Ukraine.\n\nOne of the most haunting components here is the story of Pripyat, a bustling city of almost fifty thousand people in 1986; everyone had to be evacuated. And none of the residents ever returned to live there; the structures remain, but Pripyat is now a ghost town, as are hundreds of small villages in the region, thirty years after the nuclear explosion.\n\nOne of the big problems with radioactive material is that not only can it be lethal to humans, but it is also invisible, and it remains for a very long time. This film documents the government's secrecy and lies in the immediate aftermath of the tragedy and in later years, and then the denial that now exists among people living in Ukraine and neighboring Belarus that bore the brunt of the radiation fallout.\n\nIn addition to the images, a narrator (Tim Birkett) describes the events; interviews include comments by Gorbachev and Hans Blix, along with Soviet technical experts and medical personnel that dealt firsthand with the disaster.\n\nThe Chernobyl apocalypse continues ten years after this film was released. People in Ukraine and Belarus, and even in parts of Western Europe, are still exposed to some radiation. Mercifully, in November, 2016, a giant arched shelter, decades in the making, was slid into place over the original, hastily built, cement and steel sarcophagus, to more adequately contain the still leaking radiation at the plant site.\n\nYet, for several hundreds more years at least, a one thousand square mile area surrounding the Chernobyl nuclear power plant will be off-limits to human habitation, a no-mans land of invisible but deadly radioactivity.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "9", "worstRating": "1"}}, "url": "/title/tt1832484/", "EntryAdded": "2013-11-30"}