{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0144084/", "name": "American Psycho", "image": "https://m.media-amazon.com/images/M/MV5BZTM2ZGJmNjQtN2UyOS00NjcxLWFjMDktMDE2NzMyNTZlZTBiXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg", "genre": ["Comedy", "Crime", "Drama"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000288/", "name": "Christian Bale"}, {"@type": "Person", "url": "/name/nm0857620/", "name": "Justin Theroux"}, {"@type": "Person", "url": "/name/nm0524197/", "name": "Josh Lucas"}, {"@type": "Person", "url": "/name/nm0756083/", "name": "Bill Sage"}], "director": {"@type": "Person", "url": "/name/nm0366004/", "name": "Mary Harron"}, "creator": [{"@type": "Person", "url": "/name/nm0254735/", "name": "Bret Easton Ellis"}, {"@type": "Person", "url": "/name/nm0366004/", "name": "Mary Harron"}, {"@type": "Person", "url": "/name/nm0877587/", "name": "Guinevere Turner"}, {"@type": "Organization", "url": "/company/co0220056/"}, {"@type": "Organization", "url": "/company/co0006728/"}, {"@type": "Organization", "url": "/company/co0060306/"}, {"@type": "Organization", "url": "/company/co0019350/"}, {"@type": "Organization", "url": "/company/co0018564/"}, {"@type": "Organization", "url": "/company/co0048446/"}, {"@type": "Organization", "url": "/company/co0005073/"}], "description": "American Psycho is a movie starring Christian Bale, Justin Theroux, and Josh Lucas. A wealthy New York City investment banking executive, Patrick Bateman, hides his alternate psychopathic ego from his co-workers and friends as he...", "datePublished": "2000-04-14", "keywords": "narcissism,materialism,serial murder,1980s,business card", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 465177, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0144084/"}, "author": {"@type": "Person", "name": "jamalio9"}, "dateCreated": "2003-06-12", "inLanguage": "English", "name": "LENGTHY BOOK TO FILM COMPARISON: MAY ONLY MAKE SENSE TO THOSE WHO HAVE SEEN THE FILM AND WERE DISSAPOINTED", "reviewBody": "There are numerous things wrong with this otherwise faithfull adaptation in terms of it's structure, plot and ability to portray a strong focus on it's lead character (although heavily watered down). For starters, it is far too tame. You may argue that a lot of the explicit sex and violence in the book was unnecessary but the truth is the Patrick Bateman in the book is obsessed with detail, perfection and routine, so he explains popular culture, food and restaurants and bathing products with the same explicit nature as he describes his killings with his victims and the sex he has with them beforehand. This was missing. I never once heard Patrick Bateman describe what he likes to do to his female victims in sickening detail. Although this was sick it does serve a purpose and would have proven to be a very uniquely cinematic function that would be very disturbing and almost something we have never seen before in a film. Plus the fact it would sidestep the censors as its not physical violence being committed, merely psychological. They lost something unique in this. Also Patrick Bateman in the book does some unbelievably f***** up things to his victims which makes it hard to read. That's why there was all the controversy. The film does NOT have this effect and it should at least have been shocking, and the fact that there was no controversy surrounding the films release sums it up quite well. It's like a book that is really heartbreaking and sad and brings you to tears but the adapted film doesn't make you feel this way- you often think that something important was missing and the film makers have missed the point.\n\nSecondly were the production values. In the book you imagine the locations- Bateman's apartment, his office, the parties they attend, the nightclubs and restaurants, to exceed anything we could ever imagine and associate with 'rich' in reality. In the book they are lavish, far more than we could ever imagine. Now its fairly obvious that this film is relatively low budget and as result it suffers a little by showing us locations we would associate with upper middle class in a TV sitcom, not upper class people who have that sense of materialistic achievement the likes of which we never knew existed. And it's a little too obvious that most of it was shot in a film studio. Many of the characters in the book would frown upon the living conditions of what the characters in the film have.\n\nThirdly was Patrick Bateman himself. He was never this much of a geek in the book. He was a very powerful, ruthless man, who describes all that sense of materialism that is apparently appealing to most humans, whilst displaying a sense of genuine animosity and sinister ness that you would almost regard as 'inhuman'. A lot of people miss the point of this; sometimes your confused as to whether he is human or some form of demon and it plays with your perceptions a little, thereby proving to be the most disturbing element of the book itself. Patrick Bateman in the book is actually very well respected and his possibly so far at the top of his game its no surprise he appears to be inhuman. In the film he is a run of the mill yuppie that is a bit of a loser compared to his mates. In the film he does what he does 'cause he feels he has no choice, in the book he does what he does 'cause he gets such a kick out of it and is such a spoilt brat that enjoying the most expensive things in life are not enough for him. He is so disgusted with meals, clothes, other products etc that don't cost thousands of dollars and aren't the best it is actually quite unbelievable yet interesting, and you get the sense that he spends a thousand just to walk out his door. You don't get a sense of what an expensive life Patrick Bateman lives in the film. Also in the book he really is a ladies man and wherever he goes he always gets a chicks phone number- which would lead onto inevitable consequences. In the film he often has to rely on hookers- one of which the ugly blonde one, who is so ugly the character in the book wouldn't even look at her (the book version of his character is VERY fussy about his women and wouldn't have sex with her unless she was 100% perfect looking, and NOT one that has the characteristics of a yorkshire terrier). In short, the book version of Patrick Bateman would have eaten the one in the film (literally alive) for breakfast in terms of greed and corruption and wanting the best of everything.\n\nFourthly was the scope of the film, again a fault with the films production values. In the book the characters get up to far more interesting things- conference meetings, huge parties, rock concerts, opera and so one, in the film all they ever seem to do is go to the same nightclub and restaurants and sit around and talk. As a result the film shows little achievement as to some of the excitement the characters get up to. That's also what was disturbing about the book, it shows a lifestyle that these yuppies have that entices you and almost makes you feel a little envious of what they get up to. In the film the characters lives are just boring, plain and simple.\n\nLast of all (and thank god after all my bitching) the other characters in the book are far more complex and interesting than the 1 dimensional representation we get of them in the film. All of them are obsessed about the same things as Bateman who isn't such a loner and makes you question whether or not they get up to the same things as Bateman despite the fact that they give the impression otherwise. All of them are vain and are obsessed with looking good and getting the best out of everything. Again in the film they are just traditional yuppies.\n\nWell I'm sorry I've bored you after this lengthy comparison but if you have read the book long ago as I have; and expected something special and monumental as the book was, rather than a film that was too small scale and lacked the passion and ambition it so desperately needed, I'm sure you'd agree. There should have been moments in this film that really shocked you into realising what a human being is capable of in terms of committing acts of evil towards others but alas, all we got was a naked guy running down a corridor wearing sneakers and wielding a chainsaw. I feel that the strongest thing about the film is easily Christian Bales' outstanding performance, and you wonder what could have been achieved in the hands of a greater director like Oliver Stone, Brian De Palma or even Martin Scorsese, who had a bigger budget and a little more verve and daringness to do it more justice, rather than Mary Hannon's merely competent but pedestrian and un-cinematic take on the book"}, "duration": "PT1H41M", "trailer": {"@type": "VideoObject", "name": "American Psycho", "embedUrl": "/video/imdb/vi4060743449", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzFiZmIwOTUtMmVkNy00YmZkLWE4ODAtYjE4NWUwNzNiZDM0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzFiZmIwOTUtMmVkNy00YmZkLWE4ODAtYjE4NWUwNzNiZDM0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "text os", "uploadDate": "2010-05-18T14:52:19Z"}, "EntryURL": "https://www.imdb.com/title/tt0144084", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/American-Psycho", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/American-Psycho/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/American-Psycho/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/American-Psycho/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/American-Psycho/thumb.jpg", "EntryAdded": "2013-02-19"}