{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1210166/", "name": "Moneyball", "image": "https://m.media-amazon.com/images/M/MV5BMjAxOTU3Mzc1M15BMl5BanBnXkFtZTcwMzk1ODUzNg@@._V1_.jpg", "genre": ["Biography", "Drama", "Sport"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000093/", "name": "Brad Pitt"}, {"@type": "Person", "url": "/name/nm0000705/", "name": "Robin Wright"}, {"@type": "Person", "url": "/name/nm1706767/", "name": "Jonah Hill"}, {"@type": "Person", "url": "/name/nm0000450/", "name": "Philip Seymour Hoffman"}], "director": {"@type": "Person", "url": "/name/nm0587955/", "name": "Bennett Miller"}, "creator": [{"@type": "Person", "url": "/name/nm0001873/", "name": "Steven Zaillian"}, {"@type": "Person", "url": "/name/nm0815070/", "name": "Aaron Sorkin"}, {"@type": "Person", "url": "/name/nm3133181/", "name": "Stan Chervin"}, {"@type": "Person", "url": "/name/nm1034122/", "name": "Michael Lewis"}, {"@type": "Organization", "url": "/company/co0050868/"}, {"@type": "Organization", "url": "/company/co0093765/"}, {"@type": "Organization", "url": "/company/co0174505/"}, {"@type": "Organization", "url": "/company/co0208135/"}, {"@type": "Organization", "url": "/company/co0015447/"}, {"@type": "Organization", "url": "/company/co0332023/"}], "description": "Moneyball is a movie starring Brad Pitt, Robin Wright, and Jonah Hill. Oakland A's general manager Billy Beane's successful attempt to assemble a baseball team on a lean budget by employing computer-generated analysis to acquire new...", "datePublished": "2011-09-23", "keywords": "strategy,baseball,statistics,voice over,meeting", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 348166, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1210166/"}, "author": {"@type": "Person", "name": "moviemanMA"}, "dateCreated": "2011-09-24", "inLanguage": "English", "name": "Baseball by the numbers", "reviewBody": "Moneyball tells the story of the 2002 season of the Oakland Athletics, a team that rose to notoriety because of its low payroll and unorthodox player selection. Billy Beane (Brad Pitt), a former player turned general manage, grows tired with the ancient, inefficient ways of the game he has committed his entire life to. When a transaction goes awry he stumbles across Peter Brand (Jonah Hill), a Yale, economics graduate who believes he has a system to rating players based on numbers.\n\nBilly and Peter begin trading, signing, and grooming the team based on data, not scouting, something that other members of the team are not fond of, including Art Howe (Philip Seymour Hoffman), the team's manager. Billy and Peter's system defies current baseball logic, but when the club starts to win games with players like Scott Hatteberg (Chris Pratt), David Justice (Stephen Bishop), and Chad Bradford (Casey Bond), the eyes of the country turn to Oakland, where only seeing is believing.\n\nWhat happened in Oakland back in '02 was incredible. It shouldn't have happened if you ask the right people, and other people will tell you it means nothing. Well, it did mean something it has changed the way people think about the game for good. You couldn't just go out and look at a kid to see if he would be a star or not. There were more stats to consider than home runs, strikeouts, and batting average. The game was expanding and becoming more and more a battle of logic.\n\nThe film's structure is centered mostly on Billy Beane, but the most exciting parts for me were about the system. Writer Aaron Sorkin, who a few months back accepted a slew of awards for his screenplay The Social Network, tosses out jargon that baseball fanatics go crazy for. For the general audience, that's where Billy helps out. Peter explains the system and has to break it down more for Beane (i.e. the audience) so everybody on screen and in the seats is on the same page.\n\nPitt's portrayal of Beane won me over. He completely caught me off guard. I know Pitt can act but I remember him for performances that were very complex on the outside. Aldo Raine (Inglourious Basterds) with his pronounces chin, squinty eyes, and thick accent. Benjamin Button (The Curious Case of Benjamin Button) who grew younger as he got older. Jeffrey Goines (12 Monkeys) who couldn't sit still let alone focus on one subject in a conversation. Yes, he was nominated for all these performances, but in a performance like this there is something bubbling under the surface. All of his characters to an extent have something going on underneath, only this character, Billy Beane, is so normal and calm on the outside, yet when he is alone we can see pain and frustration.\n\nHis supporting cast of Hill, Hoffman, and the slew of ball players and colleagues, help turn this baseball team into the world of Oakland Athletics. Hill and Hoffman especially play perfect compliments to Pitt's sunny exterior. Hill is quiet, timid, and very smart. Hoffman is cold, weathered, and stubborn. Pitt is able to play off of both temperaments and make their scenes together pop off the screen.\n\nThe one thing that this movie has going for it is the lack of actual action on the diamond. There are some great scenes of actual baseball, one at bat by Hatteberg in particular struck a chord with me, but for the most part the action is behind the scenes. There is enough for a sports junkie to get their fix and enough drama and with Beane and his family to entice any average viewer into the theater. I can't think of many target groups that wouldn't find it interesting, except for children, due to language and complexity of some of the dialogue. All in all this is one movie that will please a lot of people, and more importantly a lot of different people, sort of like The Blind Side, only the movie is actually really good.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT2H13M", "trailer": {"@type": "VideoObject", "name": "International Version", "embedUrl": "/video/imdb/vi3229326361", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BODM1NDMxMTI3M15BMl5BanBnXkFtZTcwMDAzODY1Ng@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODM1NDMxMTI3M15BMl5BanBnXkFtZTcwMDAzODY1Ng@@._V1_.jpg", "description": "Oakland A's general manager Billy Beane (Brad Pitt) works to put together a baseball club on a budget by employing computer-generated analysis to draft his players.", "uploadDate": "2011-09-06T07:41:44Z"}, "EntryURL": "https://www.imdb.com/title/tt1210166", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Moneyball", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Moneyball/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Moneyball/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Moneyball/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Moneyball/thumb.jpg"}