{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1386588/", "name": "The Other Guys", "image": "https://m.media-amazon.com/images/M/MV5BMTc0NDQzNTA2Ml5BMl5BanBnXkFtZTcwNzI2OTQzMw@@._V1_.jpg", "genre": ["Action", "Comedy", "Crime"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0002071/", "name": "Will Ferrell"}, {"@type": "Person", "url": "/name/nm0000242/", "name": "Mark Wahlberg"}, {"@type": "Person", "url": "/name/nm1157013/", "name": "Derek Jeter"}, {"@type": "Person", "url": "/name/nm0578949/", "name": "Eva Mendes"}], "director": {"@type": "Person", "url": "/name/nm0570912/", "name": "Adam McKay"}, "creator": [{"@type": "Person", "url": "/name/nm0570912/", "name": "Adam McKay"}, {"@type": "Person", "url": "/name/nm0376260/", "name": "Chris Henchy"}, {"@type": "Organization", "url": "/company/co0050868/"}, {"@type": "Organization", "url": "/company/co0186190/"}, {"@type": "Organization", "url": "/company/co0262627/"}, {"@type": "Organization", "url": "/company/co0265519/"}], "description": "The Other Guys is a movie starring Will Ferrell, Mark Wahlberg, and Derek Jeter. Two mismatched New York City detectives seize an opportunity to step up like the city's top cops, whom they idolize, only things don't quite go as...", "datePublished": "2010-08-06", "keywords": "detective,police,new york city,original story,buddy", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 235195, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1386588/"}, "author": {"@type": "Person", "name": "diac228"}, "dateCreated": "2010-08-06", "inLanguage": "English", "name": "Everything you expect from Ferrell, except with much more", "reviewBody": "Just when you think you've seen one Will Ferrell movie, you've seen them all, think again. Try this on for size: Usual Ferrell comedy plus crazy action plus subtle political and economical commentary plus excellent soundtrack. The Other Guys is a surprisingly hilarious and surprisingly action-packed movie that will keep you entertained throughout without actually dumbing you down. Unlike most Will Ferrell movies, you don't have to shut off your brain in this one; you actually have to pay attention because aside from the comedy, there is a complex crime to solve. Adam McKay delivers his best writing and directing performance, while the excellent cast ranging from Ferrell to Wahlberg to Keaton provides plenty of laughs, plenty of one-liners, and plenty of entertaining moments that propel this movie past the slowest of scenes.\n\nThe Other Guys is about two mismatched behind-the-scenes paper-pushers (Will Ferrell and Mark Wahlberg) quietly investigating a series of suspicious events stemming from a unique bank robbery. Along the way they try to defeat their personal demons and try to figure out how to get along with each other. Unlike most Ferrell movies, in which it's a simple concept and improv provides the filler material, this movie actually has a mildly complex and heavy script, but still gives the cast a chance for a little improvisation. Written by the director and also Chris Henchy, I'll even go as far as to say that this among the best comedic scripts since last year's The Hangover. To add to that, McKay and Henchy pull a neat trick by slowly feeding you some commentary about big business and its mannerisms. The last mainstream comedy to attempt this was the mildly underrated Fun with Dick and Jane remake with Jim Carrey.\n\nWhile this movie does not have the extensive magical gathering of comedians like Anchorman (then again, what movie does?), the cast still does an excellent job bringing the comedy from the script to the screen. Will Ferrell is a little more toned-down this time, but still has his usual moments (screaming like a girl, random quotes, random singing, quirky one-liners). Mark Wahlberg however, steals the show with his angry lines, his bitter delivery, and his outbursts. The only thing hindering Wahlberg is the PG-13 rating; who knows what more classic lines he could have pulled off if he was allowed to go uncut (Remember him in The Departed?). Smaller roles fill the bill in the laughs department, including Eva Mendez (beautiful as always), Michael Keaton, Steve Coogan, Samuel L. Jackson, Dwayne Johnson, and the cameos.\n\nEven though Farrell has been hit-and-miss with the public and the critics, his best work always has been with Adam McKay. Anchorman, Talladega Nights, and Step Brothers were their previous collaborations and those three clearly top anything else Farrell has pulled off. The Other Guys in terms of directing and pacing dethrones them all. McKay does more than just handle the camera and let the actors mouth off; he stages some great action sequences and does a fantastic job directing a slow-motion bar sequence that displays the coolest slo-mo effects since Zombieland. The first half was so overloaded with funny scenarios, the audience very often was laughing so hard they missed the next couple of jokes while trying to recover from the last two. One scene in particular had the audience nearly drown out the sound of the audio coming from the movie.\n\nThe first half was absolutely spectacular and downright comical; the second half never had a chance to duplicate the magic of the first hour. This is where Adam Mckay's biggest issues have been: in the final third of the flicks. All of McKay's movies lose steam and slow down towards the end, preventing them from becoming eternal comedic classics. In the case of The Other Guys, he improved a bit by still providing some of the laughs, even though you will still feel the momentum slowly die down. The cop clichés, while not taken seriously, still mildly hindered the moments leading up to the climax. There were some unnecessary scenes; a little bit of editing could have really helped this movie. But, unlike the other movies, the third act stays afloat thanks to the Wahlberg/Ferrell mix, as well as the continuing mystery that was slowly unfolding. Then stay tuned for the credits, when the commentary rushes at you full-force.\n\nBottom Line: Honestly, I never thought that Will Ferrell would be involved with Mark Wahlberg, a creative script, hidden commentary (that unveils itself when you least expect it), and a soundtrack consisting of Rage against the Machine. Nonetheless, the combination worked like a great mixed drink that has you asking for seconds and thirds. The one-liners are flying all over the place, and so are the bullets. The Other Guys is the funniest movie of the year so far, and clearly the best surprise we've had this summer. Adam McKay continues to claim the throne as the best comedic director in the business, and this movie is more evidence. All McKay needs to do is cut back on the overall running time. This is the first Will Ferrell movie that you must pay close attention to (in terms of visual humor and crime-solving), and is overall one of his best movies.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H47M", "trailer": {"@type": "VideoObject", "name": "The Other Guys: International Trailer", "embedUrl": "/video/imdb/vi1253639705", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTM5MTI1MzI2OF5BMl5BanBnXkFtZTcwMTM0MTk1Mw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTM5MTI1MzI2OF5BMl5BanBnXkFtZTcwMTM0MTk1Mw@@._V1_.jpg", "description": "Two mismatched New York City detectives (Ferrell and Wahlberg) seize an opportunity to step up like the city's top cops whom they idolize -- only things don't quite go as planned.", "uploadDate": "2010-06-22T07:44:54Z"}, "EntryURL": "https://www.imdb.com/title/tt1386588", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Other-Guys", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Other-Guys/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Other-Guys/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Other-Guys/thumb.jpg", "EntryAdded": "2013-02-23"}