{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0140352/", "name": "The Insider", "image": "https://m.media-amazon.com/images/M/MV5BODg0YjAzNDQtOGFkMi00Yzk2LTg1NzYtYTNjY2UwZTM2ZDdkL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Biography", "Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000128/", "name": "Russell Crowe"}, {"@type": "Person", "url": "/name/nm0000199/", "name": "Al Pacino"}, {"@type": "Person", "url": "/name/nm0001626/", "name": "Christopher Plummer"}, {"@type": "Person", "url": "/name/nm0893204/", "name": "Diane Venora"}], "director": {"@type": "Person", "url": "/name/nm0000520/", "name": "Michael Mann"}, "creator": [{"@type": "Person", "url": "/name/nm0107493/", "name": "Marie Brenner"}, {"@type": "Person", "url": "/name/nm0744839/", "name": "Eric Roth"}, {"@type": "Person", "url": "/name/nm0000520/", "name": "Michael Mann"}, {"@type": "Organization", "url": "/company/co0049348/"}, {"@type": "Organization", "url": "/company/co0035930/"}, {"@type": "Organization", "url": "/company/co0160787/"}, {"@type": "Organization", "url": "/company/co0437457/"}, {"@type": "Organization", "url": "/company/co0004216/"}, {"@type": "Organization", "url": "/company/co0037280/"}, {"@type": "Organization", "url": "/company/co0031181/"}], "description": "The Insider is a movie starring Russell Crowe, Al Pacino, and Christopher Plummer. A research chemist comes under personal and professional attack when he decides to appear in a 60 Minutes exposé on Big Tobacco.", "datePublished": "1999-11-05", "keywords": "whistleblower,tortuous interference,1990s,tobacco,cbs news", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 155613, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.8"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0140352/"}, "author": {"@type": "Person", "name": "bldsimple2"}, "dateCreated": "1999-11-06", "inLanguage": "English", "name": "SMOKE 'EM IF YOU GOT 'EM!!!", "reviewBody": "I'll make this simple for you with short attention spans: Al Pacino's best performance of the 90s. Russell Crowe's best work on par with LA Confidential (if not better) and a gripping shot by Christopher Plummer as 60 Minutes anchor Mike Wallace.\n\nFor those who can handle it, read on:\n\nJeffrey Wigand (Russell Crowe) has been fired from his job. He has to break the news to his wife (Diane Venora, who I believe should go on to be one of the best actresses of all time) that their beautiful home, swank cars and health care plan (their oldest daughter is athsmatic) are about to go down the tubes. He's been given a severance package but that's about to fall apart as well.\n\nEnter Lowell Bergman (Pacino), producer for CBS Television News' bastion of journalistic integrity, 60 Minutes. Bergman's doing a report on fires that were started by careless smokers and has been given a report so huge and full of technical jargon he can't make heads or tales of it. Through a friend he is put in touch with Wigand in the hopes of finding a translator. Wigand thinks Lowell is coming after him because of what he knows about his former employers, a major tobacco company.\n\nIt is at this moment that director Michael Mann institutes a trick, the likes of which hasn't been seen since All The President's Men. The two exchange a cat-and-mouse conversation via fax. Bergman finally calls Wigand's bluff by daring him to meet him the next day. He does.\n\nWhat does Wigand know? Well, its all over the papers these days about how the tobacco industry lied about manipulating the leaves to make them more habit forming. We have Wigand to thank for that. But that isn't where the story ends. This is a two-fold tale; on one hand you have the self-destruction of a man who put everything on the line just so he could do the right thing. On the other, you have a television producer who so believes in the integrity of himself, the network, and his show that he is willing to risk everything he has to fight for the protection of his source. I haven't seen this much commitment outside of Woodward and Berstein's staunch protection of \"Deep Throat.\"\n\nThe trump card of this film though comes in the form of Christopher Plummer playing one of the most visible news figures of the past 25 years, Mike Wallace. Wallace teeters on the edge of looking like a foul-mouthed, celebrity hungry, media hound who's only thought is about ratings. However, before its over, he evokes the \"integrity of Edward R. Murrow,\" a line that gave me chills and made me pray for an Oscar Nomination.\n\nDirector Michael Mann is known chiefly for his Action/Thrillers. This 155 minute film is slow paced but gripping for ever second it is on the screen. A lot of people have complained over the past 7-8 years about Pacino's \"staccato\" performances, suddenly shouting at the slightest provocation. This film returns him to his prime form, a style he hasn't walked in since Dog Day Afternoon, ...And Justice For All and Serpico.\n\nAnybody got a light?", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT2H37M", "trailer": {"@type": "VideoObject", "name": "The Insider", "embedUrl": "/video/imdb/vi1173618969", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzIwYjI3OTUtNjE0MS00YzMyLWE0Y2QtYmI2Y2VlMmE3NjhjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzIwYjI3OTUtNjE0MS00YzMyLWE0Y2QtYmI2Y2VlMmE3NjhjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Home Video Trailer from Touchstone Pictures", "uploadDate": "2008-04-11T16:49:00Z"}, "EntryURL": "https://www.imdb.com/title/tt0140352", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Insider", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Insider/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Insider/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Insider/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Insider/thumb.jpg"}