{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt1586680/", "name": "Shameless", "image": "https://m.media-amazon.com/images/M/MV5BYzFmODNkNDMtOTgzMy00NzQ1LWEwNDItNzU1MmYyYThhYzUwXkEyXkFqcGdeQXVyOTA3MTMyOTk@._V1_.jpg", "genre": ["Comedy", "Drama"], "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm0002536/", "name": "Emmy Rossum"}, {"@type": "Person", "url": "/name/nm0000513/", "name": "William H. Macy"}, {"@type": "Person", "url": "/name/nm3103119/", "name": "Ethan Cutkosky"}, {"@type": "Person", "url": "/name/nm2087739/", "name": "Jeremy Allen White"}], "creator": [{"@type": "Person", "url": "/name/nm0008036/", "name": "Paul Abbott"}, {"@type": "Person", "url": "/name/nm0920274/", "name": "John Wells"}, {"@type": "Organization", "url": "/company/co0265986/"}, {"@type": "Organization", "url": "/company/co0037310/"}, {"@type": "Organization", "url": "/company/co0005035/"}, {"@type": "Organization", "url": "/company/co0052980/"}, {"@type": "Organization", "url": "/company/co0332089/"}], "description": "Shameless is a TV series starring Emmy Rossum, William H. Macy, and Ethan Cutkosky. A scrappy, feisty, fiercely loyal Chicago family makes no apologies.", "datePublished": "2011-01-09", "keywords": "gay relationship,alcoholic father,poor family,brother sister relationship,gay brother", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 190213, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1586680/"}, "author": {"@type": "Person", "name": "ssih"}, "dateCreated": "2011-04-29", "inLanguage": "English", "name": "I've seen both.  The American is better.  (But not by a lot)", "reviewBody": "I was halfway through the American series before I even KNEW there was a British series. I think a was a little disappointed that we didn't create it, but I was also happy that it was one of the few shows that we copied without ruining it. When I checked some of the user reviews, I was surprised to see how many thought the show to be appalling. OK, not everyone will share my love for the show, but to rate it SO badly? But when I looked, the author of nearly every bad review was a fan of the original show. This simply sounds like a case of liking what you know. \"I don't care how good their cooking is. It ain't as good as my Mom's!\"\n\nOnce I finished the American series, I gave it about a month to settle in and then started watching the British series. But I'd like to think that I was objective enough to judge it on its on merits, and not simply that it's different than what I'm used to.\n\nSince, as many have pointed out, the script is nearly word-for-word identical, the difference lies mainly in how the actors portray the characters.\n\nSo I'm going to give my character-by-character head-to-head appraisal of UK vs. US. I'm going to use the character names rather than the actors' names for simplicity. Starting from the youngest...\n\nLittle Debbie: UK wins this one hands down. No contest. She steals every scene she's in. Who can not fall in love with this girl???\n\nCarl: This one's close, but the UK one is (at least in the first season) a little more deranged and fun to watch.\n\nIan: Another close one, but this goes to UK, too. US Ian is somber and good looking, but UK Ian always seems a bit panicky, and the wide-angle closeups of his face make him look pretty bizarre. \n\nLip: This is solidly with the US. I like US Lip's darkness. He seems more responsible and intelligent. UK Lip is just kind of impish and unsure. You can depend on US Lip and he offers some of the only real family support to Fiona.\n\nKevin: Dead heat.\n\nVeronica: Very different performances by each, but in the end, I like them the same.\n\nFiona: This was a difficult one to call, but I'm giving it to the US. And this is probably because I saw them first. I just like her better. Hard to put my finger on the reason.\n\nFrank: Sorry, UK, but I just don't like your Frank. I understand the character is usually drunk, but he seems that way even before he starts drinking. He seems clinically stupid. US Frank (Macy) is equally as obnoxious, entitled, selfish and deluded, but he only seems drunk when he's drunk. At other times, his pontificating is fun to listen to. You feel good about hating the guy, because he's like this by choice. With UK Frank, you have to pity him. I feel like I'm laughing at someone who's mentally challenged.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "trailer": {"@type": "VideoObject", "name": "Season 10 Trailer", "embedUrl": "/video/imdb/vi2660286233", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmJlMDVmNmItOGEzNy00ZjhlLWFlODItZGEwNTBlMDczOWI0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmJlMDVmNmItOGEzNy00ZjhlLWFlODItZGEwNTBlMDczOWI0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "Catch the season premiere of Shameless on November 10 at 9/8c. Starring William H. Macy.", "uploadDate": "2019-09-15T16:20:15Z"}, "EntryURL": "https://www.imdb.com/title/tt1586680", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Shameless", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Shameless/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Shameless/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Shameless/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/TV/snapshot/Shameless/thumb.jpg", "EntryAdded": "06-03-2020"}