{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0266425/", "name": "Conspiracy", "image": "https://m.media-amazon.com/images/M/MV5BMTU3MDYxNjYxM15BMl5BanBnXkFtZTYwOTc2ODY5._V1_.jpg", "genre": ["Biography", "Drama", "History", "War"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000110/", "name": "Kenneth Branagh"}, {"@type": "Person", "url": "/name/nm0120206/", "name": "Clare Bullus"}, {"@type": "Person", "url": "/name/nm0001804/", "name": "Stanley Tucci"}, {"@type": "Person", "url": "/name/nm0548412/", "name": "Simon Markey"}], "director": {"@type": "Person", "url": "/name/nm0682757/", "name": "Frank Pierson"}, "creator": [{"@type": "Person", "url": "/name/nm0541662/", "name": "Loring Mandel"}, {"@type": "Organization", "url": "/company/co0005861/"}, {"@type": "Organization", "url": "/company/co0043107/"}], "description": "Conspiracy is a TV movie starring Kenneth Branagh, Clare Bullus, and Stanley Tucci. At the Wannsee Conference on January 20, 1942, senior Nazi officials meet to determine the manner in which the so-called \"Final Solution to the...", "datePublished": "2001-05-19", "keywords": "holocaust,nazis,final solution,conference,ss", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 17953, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0266425/"}, "author": {"@type": "Person", "name": "gus120970"}, "dateCreated": "2002-01-25", "inLanguage": "English", "name": "An astonishing record of a pivotal, but little known moment in human history", "reviewBody": "Our perception of the Holocaust is shaped by the harrowing images of the gas chambers and crematoria of Auswitz; watch Conspiracy and be jarred out of the complacency that comes from familiarity and be a fly-on-the-wall at the genesis of genocide.\n\nThe film documents a meeting held during WW2, when SS second-in-command, Reinhard Heydrich, assembles a group of Nazi bureaucrats and functionaries to 'discuss the final solution of the Jewish question'. In the sublime surroundings of a German country house, the assembled mingle for drinks, enjoy a first class buffet lunch and debate whether execution or sterilisation is the most efficient option of eliminating an entire race of people.\n\nSubject matter aside, Conspiracy is all the more devastating, and precious, from its excellent script and incredible ensemble performances. There is no attempt or need to manipulate the viewer - the enormity of the truth is compelling, and appalling enough. The are no cartoon Nazis here, the depiction of Heydrich is fascinating and complex: the man is urbane, witty, impeccably mannered and utterly devoid of morality.\n\nCredit must be given to Kenneth Branagh who propels the entire piece with one of the best portrayals on screen in memory. He is utterly convincing in the role of a man who epitomises the classic definition of evil: not just the doing of wrong, but the perversion of the human spirit so that it no longer has any perception of the good.\n\nWhere Heydrich is conviction, as the narrative develops, almost exclusively as table-talk, others are less sure. The range of attendees symbolises the various strains of Nazi culture, which developed over the course of the third reich. For the idealistic of these - the philosopher/technocrat Kritzinger; the legalistic Wilhelm Stuckart and the young soldier Major Lange, there is the dawning realisation of the human catastrophe in which they are complicit.\n\nTechnical objections are raised - Stuckhart expounds a ludicrous web of of objections on how the plan breaks the vile race laws he himself architected, and will be an 'administrative nightmare', but they soon realise this is a done deal - most of the mechanisms are already in place. The politically sharp Heydrich only needs to extract expressions of support in order to bind all the orders of Nazi society into equal guilt. During breaks in the proceedings he discreetly buttonholes the wobblers and silences their doubts: by naked threats, or in the case of Lange by invoking the fantasy that what they do is all part of a plan for a better tomorrow. Succumbing to Heydrich's magnetism and realising the dream is pretty much all that is left, Lange allows himself to be persuaded.\n\nThe eloquent script captures the delusional, the grotesque and the desparate qualities of the German position at that moment in the war: the calculation that defeat is inevitable, but unthinkable - despite the repeated whimsy of Heydrich that he will return here for a quiet country life once the war is over. He knows that he, and all others present, is headed only into the dark. And it's a one-way journey.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H36M", "trailer": {"@type": "VideoObject", "name": "Conspiracy", "embedUrl": "/video/imdb/vi2042560793", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmM2YmQ1OTctZjhhZC00MGQ1LWE5ZmUtN2NmMzZkMDY2YzMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmM2YmQ1OTctZjhhZC00MGQ1LWE5ZmUtN2NmMzZkMDY2YzMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Home Video Trailer from HBO Home Video", "uploadDate": "2008-04-11T13:32:28Z"}, "EntryURL": "https://www.imdb.com/title/tt0266425", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Conspiracy", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Conspiracy/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Conspiracy/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Conspiracy/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Conspiracy/thumb.jpg"}