{"@context": "http://schema.org", "@type": "Movie", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Interstellar", "EntryURL": "https://www.imdb.com/title/tt0816692", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Interstellar/entry.json", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Interstellar/info.php", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Interstellar/info.py", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Interstellar/thumb.jpg", "actor": [{"@type": "Person", "name": "Matthew McConaughey", "url": "/name/nm0000190/"}, {"@type": "Person", "name": "Anne Hathaway", "url": "/name/nm0004266/"}, {"@type": "Person", "name": "Jessica Chastain", "url": "/name/nm1567113/"}, {"@type": "Person", "name": "Mackenzie Foy", "url": "/name/nm3237775/"}], "aggregateRating": {"@type": "AggregateRating", "bestRating": "10.0", "ratingCount": 1420327, "ratingValue": "8.6", "worstRating": "1.0"}, "contentRating": "PG-13", "creator": [{"@type": "Person", "name": "Jonathan Nolan", "url": "/name/nm0634300/"}, {"@type": "Person", "name": "Christopher Nolan", "url": "/name/nm0634240/"}, {"@type": "Organization", "url": "/company/co0023400/"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0159111/"}, {"@type": "Organization", "url": "/company/co0147954/"}, {"@type": "Organization", "url": "/company/co0071668/"}, {"@type": "Organization", "url": "/company/co0627877/"}, {"@type": "Organization", "url": "/company/co0422290/"}], "datePublished": "2014-11-05", "description": "Interstellar is a movie starring Matthew McConaughey, Anne Hathaway, and Jessica Chastain. A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.", "director": {"@type": "Person", "name": "Christopher Nolan", "url": "/name/nm0634240/"}, "duration": "PT2H49M", "genre": ["Adventure", "Drama", "Sci-Fi", "Thriller"], "image": "https://m.media-amazon.com/images/M/MV5BZjdkOTU3MDktN2IxOS00OGEyLWFmMjktY2FiMmZkNWIyODZiXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg", "keywords": "astronaut,saving the world,relativity,gravity,nasa", "name": "Interstellar", "review": {"@type": "Review", "author": {"@type": "Person", "name": "slayerjmk95"}, "dateCreated": "2014-11-03", "inLanguage": "English", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0816692/"}, "name": "An Emotional, Beautiful Journey into the Unknown", "reviewBody": "(This is both a review of the film, and an assertion of Christopher Nolan's filmmaking style)\n\nThere have been many reviewers and critics alike that have high praise for the film (the visual effects, the acting, the music), but say how it's not Christopher Nolan's best directed film. This is where i personally would have to disagree. Before i get into it, though, i'll talk about Interstellar a bit.\n\nInterstellar is truly a sci-fi epic like no other. To compare said film to '2001: A Space Odyssey' isn't just a disservice, but unnecessary. The films are almost nothing alike, simply sharing small plot elements. Also, Stanley Kubrick's vision of Arthur C. Clarke's sci-fi epic wasn't to ponder the philosophical questions that accompanied the story, but to make art, and art is was, and is. With Interstellar, Mr. Nolan set out to make his most personal and emotional film to date about love and time (time being a recurring theme throughout all of Nolan's films). But it's so much more than that too. There are no words to express the epic journey Nolan takes us on in the film, but needless to say, it's tear-jerking and emotional throughout. The acting is top-notch, especially McConaughey, who gives (I would say) his most emotional performance yet. But the actor who stole the show in a few scenes (one in particular, when they're on an alien planet) was David Gyasi as Romilly, one of the astronauts aboard the Endurance, their spacecraft. The musical score from Hans Zimmer is, without a doubt, his best and most influential work to date, helping drive the film's bold and breath-taking vision (the church organ helped significantly). The visual effects are easily the best to date as well, and of the year. To see a black hole created through visual effects in such a way, with pages theoretical equations provided by Kip Thorne (theoretical physicist, of whom's work inspired the film's genesis); what you see in the film is the most realistic depiction of a black hole, and even offered new insight to accretion discs surrounding the anomalies. But even everything else, from the alien planets to the Endurance, the visuals always look real. Then, there's the writing. I would definitely have to say this has some of the best dialogue i've ever heard in a sci-fi movie, and the script continually pours or oozes emotion, keeping the audience tethered to the film.\n\nNow, about Mr. Nolan. Don't just look at Nolan, but look at his films. Some say Inception would be his masterpiece, while others would say it's The Dark Knight, or Memento. But honestly, every single film Christopher Nolan has directed is a masterpiece not of its genre, but of Nolan. Following is his quiet masterpiece, not the film that put Mr. Nolan on the map as a phenomenal director, but one people visited or revisited after becoming accustomed to Nolan, after seeing Memento, what could be called his breakout masterpiece. Then, right after, he directed the remake of the Norwegian thriller, Insomnia. This, too, could be considered a masterpiece, even if a remake. Then, we were given his take on the Batman universe, starting with Batman Begins, the origin masterpiece. Then, there's The Prestige, adapted from the novel of the same name, which can be called his dark masterpiece. The Dark Knight, his bold masterpiece; Inception, his complex masterpiece, and The Dark Knight Rises, his flawed masterpiece. Now, we have Interstellar, his emotional or personal masterpiece.\n\nThis is just my looking at Nolan and his films, but whatever your thoughts are, you can't deny Interstellar is one hell of a journey. He certainly is one of the best filmmakers of our time, and of all time. I can't wait to see what he does next, but i'm not sure it will be as emotionally powerful as Interstellar.", "reviewRating": {"@type": "Rating", "bestRating": "10", "ratingValue": "9", "worstRating": "1"}}, "trailer": {"@type": "VideoObject", "description": "A group of explorers make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.", "embedUrl": "/video/imdb/vi1586278169", "name": "Trailer #4", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjM5OTQzMTg4N15BMl5BanBnXkFtZTgwOTgyMjM0NTE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjM5OTQzMTg4N15BMl5BanBnXkFtZTgwOTgyMjM0NTE@._V1_.jpg", "uploadDate": "2014-10-02T08:55:19Z"}, "url": "/title/tt0816692/", "EntryAdded": "2014-11-30"}