{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0083907/", "name": "The Evil Dead", "image": "https://m.media-amazon.com/images/M/MV5BODc2MmVjZmUtNjAzMS00MDNiLWIyM2YtOGEzMjg0YjRhMzRmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": "Horror", "contentRating": "NC-17", "actor": [{"@type": "Person", "url": "/name/nm0132257/", "name": "Bruce Campbell"}, {"@type": "Person", "url": "/name/nm0762445/", "name": "Ellen Sandweiss"}, {"@type": "Person", "url": "/name/nm0217822/", "name": "Richard DeManincor"}, {"@type": "Person", "url": "/name/nm0048260/", "name": "Betsy Baker"}], "director": {"@type": "Person", "url": "/name/nm0000600/", "name": "Sam Raimi"}, "creator": [{"@type": "Person", "url": "/name/nm0000600/", "name": "Sam Raimi"}, {"@type": "Organization", "url": "/company/co0047594/"}], "description": "The Evil Dead is a movie starring Bruce Campbell, Ellen Sandweiss, and Richard DeManincor. Five friends travel to a cabin in the woods, where they unknowingly release flesh-possessing demons.", "datePublished": "1983-01-16", "keywords": "cult film,evil dead,necronomicon,supernatural rape,book of the dead", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 180142, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0083907/"}, "author": {"@type": "Person", "name": "ametaphysicalshark"}, "dateCreated": "2007-05-11", "inLanguage": "English", "name": "You don't need a big budget to make an accomplished film", "reviewBody": "Sam Raimi's feature length debut \"The Evil Dead\" is truly one of the greatest horror films of all time and the start of a magnificently entertaining trilogy of hilarity and some real scares. Made on a budget of only $375,000, the film is surprisingly accomplished on a technical level. The effects, although they do look fake by today's standards, hold up a lot better than you might have expected, and the stop motion sequence at the end, which looks a lot faker than anything else in the movie, was accomplished for its time and budget.\n\n\"The Evil Dead\" is about a group of young adults who travel to a cabin in the woods and discover a 'book of the dead'. No prizes for guessing what happens next as each character is possessed (except for Ash) and disposed of via an intriguing variety of methods. Considering its budget, unknown director (at the time), and typical slasher plot \"The Evil Dead\" would almost certainly seem headed towards forgotten B-movie status, and yet it has stood the test of time and remains one of the most widely acclaimed horror films of all time. Why? It's simple. Although \"The Evil Dead\" is nowhere near as funny as its sequels, it's still a humorous self-satire while also being terrifying despite its age. This odd combination (only perfected in this film's sequels and \"Creepshow\") works because Raimi crafts a tense and moody environment, puts his characters in there, and then ruthlessly disposes of them, sometimes doing so several times for the same character. What's worse is that there's nowhere to go. Raimi creates a claustrophobic feeling in anyone watching, he wants you to think about being in a situation where you're trapped with nothing but death and destruction surrounding you. For most people, he probably succeeds. As far as acting goes, none of it is really very good but Bruce Campbell is instantly likable as Ash, who just has to be one of the most memorable horror film characters of all time.\n\nGory, desolate, hopeless, and still funny, \"The Evil Dead\" is a horror masterpiece that isn't quite the strongest entry in the series, but is shockingly accomplished and entertaining despite its low budget and inexperienced cast and crew. This is a film everyone must see, along with its sequels. \n\n9/10"}, "duration": "PT1H25M", "trailer": {"@type": "VideoObject", "name": "U.S. Version", "embedUrl": "/video/imdb/vi37529113", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTExMzg0OTU4OV5BMl5BanBnXkFtZTgwNTA0OTIyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTExMzg0OTU4OV5BMl5BanBnXkFtZTgwNTA0OTIyMzE@._V1_.jpg", "description": "Five friends travel to a cabin in the woods, where they unknowingly release flesh-possessing demons.", "uploadDate": "2013-04-30T20:03:16Z"}, "EntryURL": "https://www.imdb.com/title/tt0083907", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Evil-Dead", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Evil-Dead/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Evil-Dead/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Evil-Dead/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Evil-Dead/thumb.jpg", "EntryAdded": "2013-02-19"}