{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2084989/", "name": "Upstream Color", "image": "https://m.media-amazon.com/images/M/MV5BMTQzMzQ4MDAyNF5BMl5BanBnXkFtZTcwNzE0MDk3OA@@._V1_.jpg", "genre": ["Drama", "Sci-Fi"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm1541272/", "name": "Amy Seimetz"}, {"@type": "Person", "url": "/name/nm1797014/", "name": "Frank Mosley"}, {"@type": "Person", "url": "/name/nm1503403/", "name": "Shane Carruth"}, {"@type": "Person", "url": "/name/nm2426419/", "name": "Andrew Sensenig"}], "director": {"@type": "Person", "url": "/name/nm1503403/", "name": "Shane Carruth"}, "creator": [{"@type": "Person", "url": "/name/nm1503403/", "name": "Shane Carruth"}, {"@type": "Organization", "url": "/company/co0403699/"}], "description": "Upstream Color is a movie starring Amy Seimetz, Frank Mosley, and Shane Carruth. A man and woman are drawn together, entangled in the life cycle of an ageless organism. Identity becomes an illusion as they struggle to assemble the...", "datePublished": "2013-08-30", "keywords": "underwater scene,blue orchid,psychological thriller,very little dialogue,caterpillar", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 30328, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2084989/"}, "author": {"@type": "Person", "name": "ferguson-6"}, "dateCreated": "2013-04-19", "inLanguage": "English", "name": "True Identity Theft", "reviewBody": "Greetings again from the darkness. This is no typical movie, so these will not be typical comments. In 2004, Shane Carruth became something of a cult hero with the Sundance Festival crowd when his debut film PRIMER won a Grand Jury Award. Nine years later, we get his follow-up ... the ultimate artsy, indie film for those who thrive on analysis and prefer to avoid a story ending wrapped up with a neat bow.\n\nThese comments will not give you much, but I can tell you the screening had many viewers who left frustrated and confused. The fragmented narrative can be a bit disorienting and it avoids the usual staple of a resolution at the end. The audience knows more than the characters, yet the audience is baffled while the characters just continue on.\n\nThe first segment of the film is when it's at its most traditional. We see Thief (Thiago Martins) perform some type of worm/parasite procedure that slowly brainwashes Kris (Amy Seimetz) or leads to mind control or loss of personality ... just depends how you prefer to describe it. We then see The Sampler (Andrew Sensenig) help her overcome thanks to a blood transfusion on his pig farm. Yes, really. Finally, Kris bonds with Jeff (Shane Carruth) as they seek to reassemble their lives and re-discover themselves. Watching them bicker over who belongs to what memory is frightening and fascinating. It makes you question the definition of personal identity, and what if we lost that (or it was stolen).\n\nNature plays a huge role here, along with the connection to Thoreau's Walden. Many will use the term pretentious. Some will call it boring. Still others will be drawn in by the imagery and sound (or sometimes lack thereof). Shane Carruth does not fit Hollywood and neither do his films. He is a writer, producer, director, co-editor, cinematographer, and actor. He clearly has a love of the material and his choice of Amy Seimetz really makes the film work. She is outstanding (and also a filmmaker). The tired phrase \"it's not for everyone\" certainly applies here, but if you are a Terrence Malick fan or just enjoy being challenged by somewhat abstract themes, this one is worth a look.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H36M", "trailer": {"@type": "VideoObject", "name": "U.S. Version #3", "embedUrl": "/video/imdb/vi3090851609", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzU2MTE3NTMwNl5BMl5BanBnXkFtZTcwNzY5ODY5OA@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzU2MTE3NTMwNl5BMl5BanBnXkFtZTcwNzY5ODY5OA@@._V1_.jpg", "description": "A man and woman are drawn together, entangled in the life cycle of an ageless organism. Identity becomes an illusion as they struggle to assemble the loose fragments of wrecked lives.", "uploadDate": "2013-01-17T08:28:49Z"}, "EntryURL": "https://www.imdb.com/title/tt2084989", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Upstream-Color", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Upstream-Color/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Upstream-Color/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Upstream-Color/thumb.jpg", "EntryAdded": "2014-11-01"}