{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2084989/", "name": "Upstream Color", "image": "https://m.media-amazon.com/images/M/MV5BMTQzMzQ4MDAyNF5BMl5BanBnXkFtZTcwNzE0MDk3OA@@._V1_.jpg", "genre": ["Drama", "Sci-Fi"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm1541272/", "name": "Amy Seimetz"}, {"@type": "Person", "url": "/name/nm1797014/", "name": "Frank Mosley"}, {"@type": "Person", "url": "/name/nm1503403/", "name": "Shane Carruth"}, {"@type": "Person", "url": "/name/nm2426419/", "name": "Andrew Sensenig"}], "director": {"@type": "Person", "url": "/name/nm1503403/", "name": "Shane Carruth"}, "creator": [{"@type": "Person", "url": "/name/nm1503403/", "name": "Shane Carruth"}, {"@type": "Organization", "url": "/company/co0403699/"}], "description": "Upstream Color is a movie starring Amy Seimetz, Frank Mosley, and Shane Carruth. A man and woman are drawn together, entangled in the life cycle of an ageless organism. Identity becomes an illusion as they struggle to assemble the...", "datePublished": "2013-08-30", "keywords": "underwater scene,blue orchid,psychological thriller,very little dialogue,caterpillar", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 30319, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2084989/"}, "author": {"@type": "Person", "name": "ClaytonDavis"}, "dateCreated": "2013-04-22", "inLanguage": "English", "name": "A new and unconventional birth in American cinema is fathered by Shane Carruth...", "reviewBody": "The film opens up with a mystery, a subtle yet powerful imagery that focuses on the senses of seeing, hearing, and touching. A lavish score by writer/director/star Shane Carruth lays mindful and precise to capture the enigmatic nature of the film. A hybrid of science fiction that keeps the viewer at a distance but intrigued enough to stay on the ride, Carruth develops and writes a model of storytelling that will be appreciated in years to come. Hypnotic, and often places you into sensory overload, but its imaginative and intoxicating nature are completely unconventional and will inspire a new age of filmmakers to come forward. The synopsis of Upstream Color is as vague as the film itself. From IMDb: A man and woman are drawn together, entangled in the life cycle of an ageless organism. Identity becomes an illusion as they struggle to assemble the loose fragments of wrecked lives. I couldn't have come up with a better, more ambiguous line of description. Amy Seimetz dives head first into her role of Kris; first as a woman under the spell of sorts by the dominant yet awkwardly charming thief. Later, Seimetz, who reminds me of a more seasoned Brit Marling, envelops the essence of loss and disorientation. Her constant puzzlement that only heightens and becomes more clear as the film progresses, goes hand- in-hand with the film's obscure and melancholic ambiance. It's a brilliant breakthrough for the actress that will hopefully get her noticed by more high-profile projects. The multi-talented Shane Carruth also lends his hand as the Director of Photography and has a keen eye for angles that captures the bold and poignant temper. Carruth is a visible factor of success for the film. Taking cues and narrative notes from screenwriters like Christopher and Jonathan Nolan, and even more recently Zoe Kazan, Upstream Color plays like a lucrative blend of Memento (2001) and Ruby Sparks (2012) for the first half before making a dramatic switch. There are even moments where you can find hints of The Human Centipede (2009) believe it or not.\n\nSound mixing on the film is the first technical marvel of the year. Blends the fusion of music and the sounds of life, Upstream Color sets a new standard for independent cinema and with Shane Carruth's benchmark for science fiction screen writing, a dynamic dragon of sorts is created. Colorful, creepy, and poetically ingenious.\n\nShane Carruth is a talent to watch in the near future.\n\nRead More at The Awards Circuit (http://www.awardscircuit.com)", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H36M", "trailer": {"@type": "VideoObject", "name": "U.S. Version #3", "embedUrl": "/video/imdb/vi3090851609", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzU2MTE3NTMwNl5BMl5BanBnXkFtZTcwNzY5ODY5OA@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzU2MTE3NTMwNl5BMl5BanBnXkFtZTcwNzY5ODY5OA@@._V1_.jpg", "description": "A man and woman are drawn together, entangled in the life cycle of an ageless organism. Identity becomes an illusion as they struggle to assemble the loose fragments of wrecked lives.", "uploadDate": "2013-01-17T08:28:49Z"}, "EntryURL": "https://www.imdb.com/title/tt2084989", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Upstream-Color", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Upstream-Color/info.py", "Entry_php": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Upstream-Color/info.php", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Upstream-Color/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/Upstream-Color/thumb.jpg"}