{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1817273/", "name": "The Place Beyond the Pines", "image": "https://m.media-amazon.com/images/M/MV5BMjc1OTEwNjU4N15BMl5BanBnXkFtZTcwNzUzNDIwOQ@@._V1_.jpg", "genre": ["Crime", "Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0331516/", "name": "Ryan Gosling"}, {"@type": "Person", "url": "/name/nm0177896/", "name": "Bradley Cooper"}, {"@type": "Person", "url": "/name/nm0578949/", "name": "Eva Mendes"}, {"@type": "Person", "url": "/name/nm3995471/", "name": "Craig Van Hook"}], "director": {"@type": "Person", "url": "/name/nm0161834/", "name": "Derek Cianfrance"}, "creator": [{"@type": "Person", "url": "/name/nm0161834/", "name": "Derek Cianfrance"}, {"@type": "Person", "url": "/name/nm1397579/", "name": "Ben Coccio"}, {"@type": "Person", "url": "/name/nm0161834/", "name": "Derek Cianfrance"}, {"@type": "Person", "url": "/name/nm1397579/", "name": "Ben Coccio"}, {"@type": "Person", "url": "/name/nm2942187/", "name": "Darius Marder"}, {"@type": "Organization", "url": "/company/co0015447/"}, {"@type": "Organization", "url": "/company/co0366362/"}, {"@type": "Organization", "url": "/company/co0212525/"}], "description": "The Place Beyond the Pines is a movie starring Ryan Gosling, Bradley Cooper, and Eva Mendes. A motorcycle stunt rider turns to robbing banks as a way to provide for his lover and their newborn child, a decision that puts him on a...", "datePublished": "2013-03-20", "keywords": "bank robbery,neo noir,original story,bank,high school student", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 238454, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1817273/"}, "author": {"@type": "Person", "name": "warthogjump"}, "dateCreated": "2013-05-13", "inLanguage": "English", "name": "Brilliant effort!", "reviewBody": "The place beyond the pines was a bold and magnificent effort by filmmaker Derek Cianfrance.\n\nThe movie is set with three major acts. The first focuses on Ryan Gosling, a motorcycle stunt rider who turns to robbing banks to support his new born child. This first act was executed with excellence. Gosling's character is a joy to watch, the soundtrack is phenomenally executed and the cinematography is so beautiful, not to mention Gosling's partner in crime also manages to give an outstanding performance.\n\nThe second act focuses on Avery Cross (Bradley Cooper), a rookie cop trying to move up the ranks with a family of his own. The second act was also executed with utter brilliance. Cooper's acting was beyond brilliant, his best yet in my opinion (including his recent Silver Linings Playbook). Cooper deserves to be rewarded for his beyond excellent portrayal of a good cop merely trying to fulfill his duties in a corrupt police department trying to profit from proceeds of crime. Cooper's conflict with the corrupt detective (Ray Liotta) is tension filled and a joy to watch.\n\nThe third act focuses on the son's of both Cooper and Gosling, who have both grown up to become teenagers. This is by far the weakest act in the movie in my opinion. Although I would rate this act as \"good\" of itself, it simply felt like it detracted from the overall viewing experience of the phenomenal first two acts. Although it seems the overarching purpose of the movie was to demonstrate the impact fatherhood (or lack of) has on kids, I felt that this last act was simply unnecessary.\n\nThe place beyond the pines was set to be an exceptional experience with the first two acts if it was tied up there, but the attempt to install the third act went too far. The attempt to demonstrate the impact fatherhood (or lack of) has on kids felt too rushed for it to have sufficient impact on me. The first two acts of themselves were extraordinary and the movie should have been left there! It didn't need to be stretched out to achieve some extended purpose sought out by the director.\n\nNevertheless, what we have are two excellent acts and one good one, which, in my opinion, would equate the movie to a \"very good\" viewing experience (as opposed to \"excellent\", \"extraordinary\" or \"top of the range\").\n\nIn my final opinion, I would highly recommend this movie for the first two acts alone.\n\nPS I might also add that the introduction of Cooper's cop character Avery has to be one of the best introductions ever! It was so subtle and realistic. I loved it!", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT2H20M", "trailer": {"@type": "VideoObject", "name": "UK Trailer", "embedUrl": "/video/imdb/vi267494937", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjIyMzkwNzU0N15BMl5BanBnXkFtZTcwODczNzAzOQ@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjIyMzkwNzU0N15BMl5BanBnXkFtZTcwODczNzAzOQ@@._V1_.jpg", "description": "A motorcycle stunt rider turns to robbing banks as a way to provide for his lover and their newborn child, a decision that puts him on a collision course with an ambitious rookie cop navigating a department ruled by a corrupt detective.", "uploadDate": "2013-03-28T05:18:03Z"}, "EntryURL": "https://www.imdb.com/title/tt1817273", "EntryPath": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Place-Beyond-the-Pines", "Entry_py": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Place-Beyond-the-Pines/info.py", "Entry_json": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Place-Beyond-the-Pines/entry.json", "Entry_thumb": "W:/Portfolio/PersonalWebsite/Favorites/Movies/snapshot/The-Place-Beyond-the-Pines/thumb.jpg", "EntryAdded": "2013-05-05"}